// Class Squad.CoreGetAllItemsCallbackProxy
// Size: 0x80 (Inherited: 0x28)
struct UCoreGetAllItemsCallbackProxy : UOnlineBlueprintCallProxyBase {
	struct FScriptMulticastDelegate OnSuccess; // 0x28(0x10)
	struct FScriptMulticastDelegate OnFailure; // 0x38(0x10)
	char pad_48[0x38]; // 0x48(0x38)

	struct UCoreGetAllItemsCallbackProxy* GetAllItems(struct UObject* WorldContextObject); // Function Squad.CoreGetAllItemsCallbackProxy.GetAllItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x829240
};

// Class Squad.CoreInventoryBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCoreInventoryBlueprintLibrary : UBlueprintFunctionLibrary {

	struct FString GetItemName(struct FBlueprintOnlineItem& Result); // Function Squad.CoreInventoryBlueprintLibrary.GetItemName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x829480
	int GetItemId(struct FBlueprintOnlineItem& Result); // Function Squad.CoreInventoryBlueprintLibrary.GetItemId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8293a0
	int GetItemCount(struct FBlueprintOnlineItem& Result); // Function Squad.CoreInventoryBlueprintLibrary.GetItemCount // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8292c0
};

// Class Squad.CoreSerializeItemSetCallbackProxy
// Size: 0x90 (Inherited: 0x28)
struct UCoreSerializeItemSetCallbackProxy : UOnlineBlueprintCallProxyBase {
	struct FScriptMulticastDelegate OnSuccess; // 0x28(0x10)
	struct FScriptMulticastDelegate OnFailure; // 0x38(0x10)
	char pad_48[0x48]; // 0x48(0x48)

	struct UCoreSerializeItemSetCallbackProxy* SerializeItemSet(struct UObject* WorldContextObject, struct TArray<struct FBlueprintOnlineItem>& Items); // Function Squad.CoreSerializeItemSetCallbackProxy.SerializeItemSet // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x829c80
};

// Class Squad.HeatMapRecorder
// Size: 0xe0 (Inherited: 0x28)
struct UHeatMapRecorder : UObject {
	char pad_28[0xb8]; // 0x28(0xb8)
};

// Class Squad.SQCloudAnalyticsGathererSubsystem
// Size: 0x68 (Inherited: 0x30)
struct USQCloudAnalyticsGathererSubsystem : UGameInstanceSubsystem {
	char pad_30[0x38]; // 0x30(0x38)
};

// Class Squad.ODKAnalyticsSubsystemInterface
// Size: 0x28 (Inherited: 0x28)
struct UODKAnalyticsSubsystemInterface : UInterface {
};

// Class Squad.RelativeCanvasPanel
// Size: 0x130 (Inherited: 0x130)
struct URelativeCanvasPanel : UCanvasPanel {
};

// Class Squad.SQ_HexMenu_BaseAction
// Size: 0x28 (Inherited: 0x28)
struct USQ_HexMenu_BaseAction : UObject {
};

// Class Squad.SQUndirectedGraph
// Size: 0x280 (Inherited: 0x248)
struct ASQUndirectedGraph : AActor {
	struct USceneComponent* Root; // 0x248(0x08)
	struct FScriptMulticastDelegate OnLatticeUpdated; // 0x250(0x10)
	struct TArray<struct USQGraphNodeComponent*> Nodes; // 0x260(0x10)
	struct TArray<struct FSQGraphLink> Links; // 0x270(0x10)

	void RemoveNode(struct USQGraphNodeComponent* Node); // Function Squad.SQUndirectedGraph.RemoveNode // (Native|Public|BlueprintCallable) // @ game+0x844930
	void RemoveLink(struct FSQGraphLink Link); // Function Squad.SQUndirectedGraph.RemoveLink // (Native|Public|BlueprintCallable) // @ game+0x90a4e0
	void OnRep_Nodes(); // Function Squad.SQUndirectedGraph.OnRep_Nodes // (Native|Public) // @ game+0x8674c0
	void GetNodes(struct TArray<struct USQGraphNodeComponent*>& InOutNodes); // Function Squad.SQUndirectedGraph.GetNodes // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x909bd0
	void GetLinks(struct TArray<struct FSQGraphLink>& InOutLinks); // Function Squad.SQUndirectedGraph.GetLinks // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x909b20
	void ClearNodesAndLinks(); // Function Squad.SQUndirectedGraph.ClearNodesAndLinks // (Final|Native|Public|BlueprintCallable) // @ game+0x909470
	void AddNode(struct USQGraphNodeComponent* Node); // Function Squad.SQUndirectedGraph.AddNode // (Native|Public|BlueprintCallable) // @ game+0x8449c0
	void AddLink(struct FSQGraphLink Link); // Function Squad.SQUndirectedGraph.AddLink // (Native|Public|BlueprintCallable) // @ game+0x909280
};

// Class Squad.SQAASGraph
// Size: 0x298 (Inherited: 0x280)
struct ASQAASGraph : ASQUndirectedGraph {
	bool bNodesHaveReplicated; // 0x280(0x01)
	char pad_281[0x17]; // 0x281(0x17)

	void RemoveSourceNode(struct USQGraphNodeComponent* Node); // Function Squad.SQAASGraph.RemoveSourceNode // (Final|Native|Public|BlueprintCallable) // @ game+0x829c00
	void PostNodeOwnerChanged(struct USQCaptureZoneComponent* CaptureZone, char Team); // Function Squad.SQAASGraph.PostNodeOwnerChanged // (Final|Native|Public) // @ game+0x829b40
	void GetTeamSourceNodes(char Team, struct TArray<struct USQGraphNodeComponent*>& InOutNodes); // Function Squad.SQAASGraph.GetTeamSourceNodes // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x829650
	void GetSourceNodes(struct TArray<struct USQGraphNodeComponent*>& InOutNodes); // Function Squad.SQAASGraph.GetSourceNodes // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x8295a0
	void AddSourceNode(struct USQGraphNodeComponent* Node); // Function Squad.SQAASGraph.AddSourceNode // (Final|Native|Public|BlueprintCallable) // @ game+0x829110
};

// Class Squad.SQUserWidget
// Size: 0x230 (Inherited: 0x230)
struct USQUserWidget : UUserWidget {

	void SelfRemove(); // Function Squad.SQUserWidget.SelfRemove // (Native|Public|BlueprintCallable) // @ game+0x90a6d0
	void BPInit(); // Function Squad.SQUserWidget.BPInit // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQMapLattice
// Size: 0x250 (Inherited: 0x230)
struct USQMapLattice : USQUserWidget {
	struct TArray<struct FSQLatticeLine> LatticeLines; // 0x230(0x10)
	struct USQCoreStateMapComponent* MapComponent; // 0x240(0x08)
	char pad_248[0x8]; // 0x248(0x08)

	struct FVector2D WorldLocationToDrawLocation(struct FVector& Location, struct USQMapWidgetBase* MapWidget); // Function Squad.SQMapLattice.WorldLocationToDrawLocation // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x892400
	void DrawWidget(struct FPaintContext Context); // Function Squad.SQMapLattice.DrawWidget // (Native|Public|BlueprintCallable|Const) // @ game+0x891050
};

// Class Squad.SQAASGraphLattice
// Size: 0x290 (Inherited: 0x250)
struct USQAASGraphLattice : USQMapLattice {
	bool bHidesUncapLinks; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FLinearColor LatticeNeutralColor; // 0x254(0x10)
	struct FLinearColor LatticeEnemyColor; // 0x264(0x10)
	struct FLinearColor LatticeFriendlyColor; // 0x274(0x10)
	float LineThickness; // 0x284(0x04)
	struct ASQAASGraph* lattice; // 0x288(0x08)
};

// Class Squad.SQGameRuleSet
// Size: 0x278 (Inherited: 0x248)
struct ASQGameRuleSet : AActor {
	struct ASQRulesetState* RulesetStateClass; // 0x248(0x08)
	struct ASQRulesetState* RulesetState; // 0x250(0x08)
	bool bUseTickets; // 0x258(0x01)
	char pad_259[0x3]; // 0x259(0x03)
	int RoundTimeOverride; // 0x25c(0x04)
	struct FString DisplayName; // 0x260(0x10)
	bool bRulesetEnabled; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)

	void VehicleDestroyed(struct ASQPlayerController* Killer, struct ASQPlayerController* Victim, struct ASQVehicle* DestroyedVehicle); // Function Squad.SQGameRuleSet.VehicleDestroyed // (Native|Event|Public|BlueprintEvent) // @ game+0x878630
	void UnregisterActor(struct AActor* Actor); // Function Squad.SQGameRuleSet.UnregisterActor // (Native|Event|Public|BlueprintEvent) // @ game+0x8783d0
	void SetRulesetEnabled(bool Value); // Function Squad.SQGameRuleSet.SetRulesetEnabled // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x877600
	void SetRoundTimeOverride(int InRoundTimeOverride); // Function Squad.SQGameRuleSet.SetRoundTimeOverride // (Native|Public|BlueprintCallable) // @ game+0x877570
	void SendChatMessage(enum class ESQChat ChatType, struct FString Message, enum class ESQTeam Team, int Squad, bool bBroadcastToAdmin, struct FString StreamerModeVariantMessage); // Function Squad.SQGameRuleSet.SendChatMessage // (Native|Public|BlueprintCallable) // @ game+0x8771f0
	void SecondPassed(); // Function Squad.SQGameRuleSet.SecondPassed // (Native|Event|Public|BlueprintEvent) // @ game+0x86d540
	void RegisterActor(struct AActor* Actor); // Function Squad.SQGameRuleSet.RegisterActor // (Native|Event|Public|BlueprintEvent) // @ game+0x877050
	enum class ESQReadyToEndMatch ReadyToEndMatch(); // Function Squad.SQGameRuleSet.ReadyToEndMatch // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x877020
	void PostPlayerSpawn(struct ASQSoldier* SpawningSoldier); // Function Squad.SQGameRuleSet.PostPlayerSpawn // (Native|Event|Public|BlueprintEvent) // @ game+0x876f90
	void PostPlayerLogout(struct AController* Controller); // Function Squad.SQGameRuleSet.PostPlayerLogout // (Native|Event|Public|BlueprintEvent) // @ game+0x876f00
	void PostPlayerLogin(struct APlayerController* Controller); // Function Squad.SQGameRuleSet.PostPlayerLogin // (Native|Event|Public|BlueprintEvent) // @ game+0x876e70
	void PlayerWounded(struct ASQPlayerController* Killer, struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerWounded // (Native|Event|Public|BlueprintEvent) // @ game+0x876da0
	void PlayerWound(struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerWound // (Native|Event|Public|BlueprintEvent) // @ game+0x876bd0
	void PlayerTeamWounded(struct ASQPlayerController* Killer, struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerTeamWounded // (Native|Event|Public|BlueprintEvent) // @ game+0x876b00
	void PlayerTeamKilled(struct ASQPlayerController* Killer, struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerTeamKilled // (Native|Event|Public|BlueprintEvent) // @ game+0x876a30
	void PlayerSuicide(struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerSuicide // (Native|Event|Public|BlueprintEvent) // @ game+0x85f6d0
	void PlayerSpawned(struct ASQPlayerController* NewPlayer); // Function Squad.SQGameRuleSet.PlayerSpawned // (Native|Event|Public|BlueprintEvent) // @ game+0x8769a0
	void PlayerSelfWound(struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerSelfWound // (Native|Event|Public|BlueprintEvent) // @ game+0x876910
	void PlayerSelfHealed(struct ASQPlayerController* Healer); // Function Squad.SQGameRuleSet.PlayerSelfHealed // (Native|Event|Public|BlueprintEvent) // @ game+0x876880
	void PlayerSelfBandaged(struct ASQPlayerController* Bandager); // Function Squad.SQGameRuleSet.PlayerSelfBandaged // (Native|Event|Public|BlueprintEvent) // @ game+0x8767f0
	void PlayerRevived(struct ASQPlayerController* Reviver, struct ASQPlayerController* RevivedPlayer); // Function Squad.SQGameRuleSet.PlayerRevived // (Native|Event|Public|BlueprintEvent) // @ game+0x876720
	void PlayerKilled(struct ASQPlayerController* Killer, struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerKilled // (Native|Event|Public|BlueprintEvent) // @ game+0x876580
	void PlayerJoinedTeam(struct ASQPlayerController* Player, int TeamIndex); // Function Squad.SQGameRuleSet.PlayerJoinedTeam // (Native|Event|Public|BlueprintEvent) // @ game+0x8764b0
	void PlayerJoined(struct ASQPlayerController* NewPlayer); // Function Squad.SQGameRuleSet.PlayerJoined // (Native|Event|Public|BlueprintEvent) // @ game+0x8449c0
	void PlayerHealed(struct ASQPlayerController* Healer, struct ASQPlayerController* HealedPlayer); // Function Squad.SQGameRuleSet.PlayerHealed // (Native|Event|Public|BlueprintEvent) // @ game+0x8763e0
	void PlayerDied(struct ASQPlayerController* Victim); // Function Squad.SQGameRuleSet.PlayerDied // (Native|Event|Public|BlueprintEvent) // @ game+0x876280
	void PlayerBandaged(struct ASQPlayerController* Bandager, struct ASQPlayerController* BandagedPlayer); // Function Squad.SQGameRuleSet.PlayerBandaged // (Native|Event|Public|BlueprintEvent) // @ game+0x876070
	void NotifyPlayerOnScoreEvent(struct ASQPlayerController* Player, struct FSQScoreEvent& ScoreEvent); // Function Squad.SQGameRuleSet.NotifyPlayerOnScoreEvent // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x875a50
	void NotifyPlayer(struct ASQPlayerController* Player, struct FString Message, enum class ESQNotificationTypes NotificationType, struct FString StreamerModeVariantMessage); // Function Squad.SQGameRuleSet.NotifyPlayer // (Native|Public|BlueprintCallable) // @ game+0x8758e0
	void ModifySoldierInventory(struct ASQSoldier* Soldier); // Function Squad.SQGameRuleSet.ModifySoldierInventory // (Native|Event|Public|BlueprintEvent) // @ game+0x875850
	void MatchStarted(); // Function Squad.SQGameRuleSet.MatchStarted // (Native|Event|Public|BlueprintEvent) // @ game+0x86d650
	void MatchIsWaitingToStart(); // Function Squad.SQGameRuleSet.MatchIsWaitingToStart // (Native|Event|Public|BlueprintEvent) // @ game+0x867cf0
	void LogisticsDropOff(struct AActor* VehicleActor, float AmmoDroppedOff, float ConstructionDroppedOff); // Function Squad.SQGameRuleSet.LogisticsDropOff // (Native|Event|Public|BlueprintEvent) // @ game+0x875750
	bool GetRulesetEnabled(); // Function Squad.SQGameRuleSet.GetRulesetEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8754c0
	int GetRoundTimeRemaining(); // Function Squad.SQGameRuleSet.GetRoundTimeRemaining // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x875490
	int GetRoundTimeOverride(); // Function Squad.SQGameRuleSet.GetRoundTimeOverride // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x875460
	struct ASQGameMode* GetGameMode(); // Function Squad.SQGameRuleSet.GetGameMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x875410
	struct FString GetDisplayName(); // Function Squad.SQGameRuleSet.GetDisplayName // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8752a0
	void BPRulesetEnabled(); // Function Squad.SQGameRuleSet.BPRulesetEnabled // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BPRulesetDisabled(); // Function Squad.SQGameRuleSet.BPRulesetDisabled // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQGameModeRuleset
// Size: 0x2b0 (Inherited: 0x278)
struct ASQGameModeRuleset : ASQGameRuleSet {
	struct TArray<struct FSQInventoryMod> InventoryModifications; // 0x278(0x10)
	struct FText PlayerJoinedMessageToPlayer; // 0x288(0x18)
	struct TArray<struct FSQGameModeRules> RulesToBeShownWhenPlayersJoinATeam; // 0x2a0(0x10)

	void SetWinningTeamFromEnum(enum class ESQTeam Team); // Function Squad.SQGameModeRuleset.SetWinningTeamFromEnum // (Native|Public|BlueprintCallable|Const) // @ game+0x877720
	void SetWinningTeam(struct ASQTeam* Team); // Function Squad.SQGameModeRuleset.SetWinningTeam // (Native|Public|BlueprintCallable|Const) // @ game+0x877690
	void SendMessageToPlayer(struct ASQPlayerController* Player, struct FString Message, struct FLinearColor& Color, float MessageLifetime); // Function Squad.SQGameModeRuleset.SendMessageToPlayer // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x8773e0
};

// Class Squad.SQAASRuleset
// Size: 0x2b8 (Inherited: 0x2b0)
struct ASQAASRuleset : ASQGameModeRuleset {
	struct ASQAASGraph* GraphActor; // 0x2b0(0x08)

	void LatticeUpdated(); // Function Squad.SQAASRuleset.LatticeUpdated // (Native|Event|Public|BlueprintEvent) // @ game+0x8297f0
};

// Class Squad.SQAction
// Size: 0x2a0 (Inherited: 0x248)
struct ASQAction : AActor {
	struct USQActionSettings* Setting; // 0x248(0x08)
	struct FSQActionParameters Parameters; // 0x250(0x40)
	int Team; // 0x290(0x04)
	struct TWeakObjectPtr<struct AController> DamageInstigatorController; // 0x294(0x08)
	char pad_29C[0x4]; // 0x29c(0x04)
};

// Class Squad.SQSettings
// Size: 0x58 (Inherited: 0x30)
struct USQSettings : UDataAsset {
	struct FName ID; // 0x30(0x08)
	struct FDataTableRowHandle Data; // 0x38(0x10)
	struct FString ModId; // 0x48(0x10)

	struct FString GetLogId(); // Function Squad.SQSettings.GetLogId // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8c60c0
	struct FString GetIdAsString(); // Function Squad.SQSettings.GetIdAsString // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8c6000
	struct FName GetId(); // Function Squad.SQSettings.GetId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8c5fc0
	bool GetDisplayName(struct FText& OutDisplayName); // Function Squad.SQSettings.GetDisplayName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x8c5d60
};

// Class Squad.SQActionSettings
// Size: 0x60 (Inherited: 0x58)
struct USQActionSettings : USQSettings {
	bool CreateMapMarker; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
};

// Class Squad.SQAdminPanel
// Size: 0x230 (Inherited: 0x230)
struct USQAdminPanel : UUserWidget {
};

// Class Squad.SQPlayerController
// Size: 0xa70 (Inherited: 0x598)
struct ASQPlayerController : APlayerController {
	char pad_598[0x8]; // 0x598(0x08)
	struct ASQTeam* AuthorityTeam; // 0x5a0(0x08)
	struct ASQTeamState* TeamState; // 0x5a8(0x08)
	struct ASQTeamStatePrivate* PrivateTeamState; // 0x5b0(0x08)
	struct ASQSquad* AuthoritySquad; // 0x5b8(0x08)
	struct ASQSquadState* SquadState; // 0x5c0(0x08)
	struct ASQSquadStatePrivateToTeam* TeamPrivateSquadState; // 0x5c8(0x08)
	struct USQCoreStateConnection* StateConnection; // 0x5d0(0x08)
	float SpawnMenuPopupDelay; // 0x5d8(0x04)
	char pad_5DC[0x4]; // 0x5dc(0x04)
	struct ASQSoldier* LastSpawnedSoldier; // 0x5e0(0x08)
	char pad_5E8[0x1]; // 0x5e8(0x01)
	bool AreCommunicationButtonsAllowed; // 0x5e9(0x01)
	char bIsCrouchedDuringMenu : 1; // 0x5ea(0x01)
	char bIsPronedDuringMenu : 1; // 0x5ea(0x01)
	char pad_5EA_2 : 6; // 0x5ea(0x01)
	bool IsWinner; // 0x5eb(0x01)
	float TimeBecameIncapacitated; // 0x5ec(0x04)
	float SpawnDelayPenalties; // 0x5f0(0x04)
	float MaxSpawnDelay; // 0x5f4(0x04)
	bool bWasInVehicle; // 0x5f8(0x01)
	char pad_5F9[0x3]; // 0x5f9(0x03)
	struct FSQBitFlag AccessLevel; // 0x5fc(0x04)
	char pad_600[0x18]; // 0x600(0x18)
	struct FScriptMulticastDelegate OnPlayerEnterVehicleEvent; // 0x618(0x10)
	struct FScriptMulticastDelegate OnPlayerExitVehicleEvent; // 0x628(0x10)
	struct FScriptMulticastDelegate OnRallyCreated; // 0x638(0x10)
	char pad_648[0x8]; // 0x648(0x08)
	struct FScriptMulticastDelegate OnChatStarted; // 0x650(0x10)
	struct USQToastWidget* ToastWidgetClass; // 0x660(0x08)
	struct FText ChangeRoleNoAmmoText; // 0x668(0x18)
	struct FText AmmoBagNoAmmoText; // 0x680(0x18)
	struct FText MaxAmmoBagText; // 0x698(0x18)
	struct FText RearmFromAmmoBagText; // 0x6b0(0x18)
	struct FText RoleCannotPickupAmmoBagText; // 0x6c8(0x18)
	struct FText RearmFromVehicleNoAmmoText; // 0x6e0(0x18)
	struct FText RearmFromVehicleConfirmationText; // 0x6f8(0x18)
	struct FText RearmFromVehiclePromptText; // 0x710(0x18)
	struct FText CannotStartVehicleInStagingPhaseText; // 0x728(0x18)
	float WalkingOriginRebaseThreshold; // 0x740(0x04)
	float RidingOriginRebaseThreshold; // 0x744(0x04)
	float FlyingOriginRebaseThreshold; // 0x748(0x04)
	float LeaveVehicleOriginRebaseThreshold; // 0x74c(0x04)
	float OriginRebaseFrequency; // 0x750(0x04)
	char pad_754[0x4]; // 0x754(0x04)
	struct TArray<struct ASQMapMarker*> MapMarkerArray; // 0x758(0x10)
	struct USQMapMarkerInputComponent* MapMarkerInputComponent; // 0x768(0x08)
	struct FScriptMulticastDelegate OnNewMarkerCreatedEvent; // 0x770(0x10)
	struct USQAdminStats* AdminStats; // 0x780(0x08)
	struct TArray<struct AActor*> SpawnableActors; // 0x788(0x10)
	struct UDataTable* ApprovalMessages; // 0x798(0x08)
	struct USQVehicleSeatComponent* CurrentSeat; // 0x7a0(0x08)
	char pad_7A8[0xb8]; // 0x7a8(0xb8)
	float AlwaysRenderPawnsDistance; // 0x860(0x04)
	char pad_864[0x34]; // 0x864(0x34)
	struct UAudioComponent* MusicAC; // 0x898(0x08)
	struct USoundBase* MusicSound; // 0x8a0(0x08)
	struct TArray<struct FSQSystemHUDMessage> QueuedSystemMessages; // 0x8a8(0x10)
	struct TArray<struct APawn*> RefreshTypes; // 0x8b8(0x10)
	struct USQDataGatheringComponent* DataGatheringComponent; // 0x8c8(0x08)
	struct USQCommanderInputComponent* CommanderInputComponent; // 0x8d0(0x08)
	struct USQBoundaryListener* BoundaryListener; // 0x8d8(0x08)
	float OutOfMapBoundsKillTimestamp; // 0x8e0(0x04)
	float PendingDeathKillTimestamp; // 0x8e4(0x04)
	struct APawn* LastRefreshedPawn; // 0x8e8(0x08)
	struct ASQGameSpawn* SelectedSpawn; // 0x8f0(0x08)
	char pad_8F8[0x8]; // 0x8f8(0x08)
	struct TMap<uint32, struct FSQApprovalEntryRequest> ApprovalEntries; // 0x900(0x50)
	struct TMap<uint32, struct FSQApprovalEntryClientDesc> ApprovalEntriesOnClient; // 0x950(0x50)
	char pad_9A0[0x20]; // 0x9a0(0x20)
	float PawnRenderDistance; // 0x9c0(0x04)
	char pad_9C4[0x34]; // 0x9c4(0x34)
	struct TMap<struct FUniqueNetIdRepl, struct ASQPlayerState*> CachedPlayersToMute; // 0x9f8(0x50)
	struct USQMovementComponentNetworker* Networker; // 0xa48(0x08)
	struct ASQDeployable* ActiveGhost; // 0xa50(0x08)
	bool IsDeployingItem; // 0xa58(0x01)
	char pad_A59[0x7]; // 0xa59(0x07)
	struct USQVotingComponent* VotingComponentClass; // 0xa60(0x08)
	struct USQVotingComponent* VotingComponent; // 0xa68(0x08)

	void UnmuteSquad(struct ASQSquadState* MuteSquadState); // Function Squad.SQPlayerController.UnmuteSquad // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8becd0
	void UnmuteAllPlayersExceptSquad(); // Function Squad.SQPlayerController.UnmuteAllPlayersExceptSquad // (Final|Native|Public|BlueprintCallable) // @ game+0x8becb0
	bool TryClaimVehicle(struct ASQVehicle* Vehicle); // Function Squad.SQPlayerController.TryClaimVehicle // (Final|Native|Public) // @ game+0x8bec20
	void ToggleShowRebase(bool Value); // Function Squad.SQPlayerController.ToggleShowRebase // (Final|Native|Public) // @ game+0x8beb90
	void ToggleMutePlayer(struct ASQPlayerState* MutePlayerState); // Function Squad.SQPlayerController.ToggleMutePlayer // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8beb10
	float TimeUntilCanSpawn(); // Function Squad.SQPlayerController.TimeUntilCanSpawn // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8beae0
	void StopMusic(); // Function Squad.SQPlayerController.StopMusic // (Native|Public|BlueprintCallable) // @ game+0x8beac0
	void StartPlaceDeployable(struct USQDeployableSettings* InDeployableSettings, bool InIsItem); // Function Squad.SQPlayerController.StartPlaceDeployable // (Final|Native|Public|BlueprintCallable) // @ game+0x8be9f0
	void SQSM_SetServerUpdateRate(float Value); // Function Squad.SQPlayerController.SQSM_SetServerUpdateRate // (Final|Exec|Native|Public) // @ game+0x8ba7b0
	void SQSM_SetNonRenderedUpdateRate(float Value); // Function Squad.SQPlayerController.SQSM_SetNonRenderedUpdateRate // (Final|Exec|Native|Public) // @ game+0x8ba730
	void SQSM_SetDistanceFactorThesholds(int Index, float Value); // Function Squad.SQPlayerController.SQSM_SetDistanceFactorThesholds // (Final|Exec|Native|Public) // @ game+0x8ba660
	void SQSM_RemoveDistanceFactorThesholds(int srcIndex, int Count); // Function Squad.SQPlayerController.SQSM_RemoveDistanceFactorThesholds // (Final|Exec|Native|Public) // @ game+0x8ba5a0
	void SQSM_PrintDistanceFactorThesholds(); // Function Squad.SQPlayerController.SQSM_PrintDistanceFactorThesholds // (Final|Exec|Native|Public) // @ game+0x8ba580
	void SQSM_InsertDistanceFactorThesholds(int Index, float Value); // Function Squad.SQPlayerController.SQSM_InsertDistanceFactorThesholds // (Final|Exec|Native|Public) // @ game+0x8ba4b0
	void SQBugit(struct FString ScreenShotDescription); // Function Squad.SQPlayerController.SQBugit // (Final|Exec|Native|Public) // @ game+0x8ba410
	void SpawnGhost(struct UClass* InDeployableReference, struct USQDeployableSettings* InDeployableSettings); // Function Squad.SQPlayerController.SpawnGhost // (Final|Native|Protected) // @ game+0x8be8d0
	void SpawnDeployableItem(struct UClass* InDeployableReference, struct FTransform InPosition); // Function Squad.SQPlayerController.SpawnDeployableItem // (Final|Native|Protected|HasDefaults) // @ game+0x8be760
	void SpawnDeployable(struct UClass* InDeployableReference, struct USQDeployableSettings* InDeployableSettings, struct FTransform InPosition); // Function Squad.SQPlayerController.SpawnDeployable // (Final|Native|Protected|HasDefaults) // @ game+0x8be5b0
	void SimulateInputKey(struct FKey Key, bool bPressed); // Function Squad.SQPlayerController.SimulateInputKey // (Final|Native|Public|BlueprintCallable) // @ game+0x8be480
	void ShowToast(struct FText& ToastText, float Lifetime, bool bForceSlate); // Function Squad.SQPlayerController.ShowToast // (BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8be310
	bool ShouldSkipPassword(); // Function Squad.SQPlayerController.ShouldSkipPassword // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8be2e0
	void ShareRallyPoint(int SquadId); // Function Squad.SQPlayerController.ShareRallyPoint // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8be260
	void SetWorldOrigin(struct FIntVector& NewOrigin); // Function Squad.SQPlayerController.SetWorldOrigin // (Final|Exec|Native|Private|HasOutParms|HasDefaults|Const) // @ game+0x8be1d0
	void SetSelectionMode(bool bEnabled); // Function Squad.SQPlayerController.SetSelectionMode // (Final|Native|Public|BlueprintCallable) // @ game+0x8be140
	void SetRoamingMapOpen(bool bOpen); // Function Squad.SQPlayerController.SetRoamingMapOpen // (Final|Native|Public|BlueprintCallable) // @ game+0x8be0b0
	void SetPendingDeathKillTimestamp(float Timestamp); // Function Squad.SQPlayerController.SetPendingDeathKillTimestamp // (Final|Native|Public|BlueprintCallable) // @ game+0x8be030
	void SetOutOfMapBoundsKillTimestamp(float Timestamp); // Function Squad.SQPlayerController.SetOutOfMapBoundsKillTimestamp // (Final|Native|Public|BlueprintCallable) // @ game+0x8bdfb0
	void SetIgnoreWeaponInput(bool bNewClickInput); // Function Squad.SQPlayerController.SetIgnoreWeaponInput // (Final|Native|Public|BlueprintCallable) // @ game+0x8bdf20
	void SetDeployRole(struct USQRoleSettings* NewRoleSettings); // Function Squad.SQPlayerController.SetDeployRole // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x8bdea0
	void SetCurrentRole(struct USQRoleSettings* NewRoleSettings, enum class ESQSpawnInventoryReason SpawnInventoryReason); // Function Squad.SQPlayerController.SetCurrentRole // (Final|Native|Public|BlueprintCallable) // @ game+0x8bdde0
	void ServerUnmuteSquad(struct ASQSquadState* MuteSquadState); // Function Squad.SQPlayerController.ServerUnmuteSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bdd20
	void ServerTryClaimVehicle(struct ASQVehicle* VehicleToClaim); // Function Squad.SQPlayerController.ServerTryClaimVehicle // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bdc60
	void ServerTryApproveVehicleClaim(); // Function Squad.SQPlayerController.ServerTryApproveVehicleClaim // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bdc10
	void ServerSwitchSeat(int Index); // Function Squad.SQPlayerController.ServerSwitchSeat // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bdb50
	void ServerSuicide(bool bLeavingServer); // Function Squad.SQPlayerController.ServerSuicide // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bda90
	void ServerStartHealing(struct ASQSoldier* HealedSoldier); // Function Squad.SQPlayerController.ServerStartHealing // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bd9d0
	void ServerSLInviteMember(struct ASQPlayerState* PlayerToInvite); // Function Squad.SQPlayerController.ServerSLInviteMember // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bd610
	void ServerShareRallyPoint(int SquadId); // Function Squad.SQPlayerController.ServerShareRallyPoint // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bd910
	void ServerSetVoipHandAnim(enum class ESQVoiceChannel VoiceChannel); // Function Squad.SQPlayerController.ServerSetVoipHandAnim // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x8bd860
	void ServerSetMuteAllPlayersExceptSquad(bool bMute); // Function Squad.SQPlayerController.ServerSetMuteAllPlayersExceptSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bd7a0
	void ServerSay(struct FString Msg); // Function Squad.SQPlayerController.ServerSay // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0x8bd6d0
	void ServerRequestServerTime(struct FDateTime InClientUTCTime); // Function Squad.SQPlayerController.ServerRequestServerTime // (Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate) // @ game+0x8bd560
	void ServerRequestRoleRearm(struct FName InRoleId, struct UObject* InRearmSource); // Function Squad.SQPlayerController.ServerRequestRoleRearm // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x8bd460
	void ServerRequestRole(struct FName InRoleId); // Function Squad.SQPlayerController.ServerRequestRole // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x8bd3a0
	void ServerRequestRestartPlayer(struct ASQGameSpawn* Spawn); // Function Squad.SQPlayerController.ServerRequestRestartPlayer // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bd2e0
	void ServerRequestPlaceDeployableItem(struct FName InDeployableItemId, struct FTransform InPosition); // Function Squad.SQPlayerController.ServerRequestPlaceDeployableItem // (Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|BlueprintCallable|NetValidate) // @ game+0x8bd1a0
	void ServerRequestPlaceDeployable(struct FName InDeployabeId, struct FTransform InPosition); // Function Squad.SQPlayerController.ServerRequestPlaceDeployable // (Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|BlueprintCallable|NetValidate) // @ game+0x8bd060
	void ServerRequestDeployRole(struct USQRoleSettings* NewRole); // Function Squad.SQPlayerController.ServerRequestDeployRole // (Final|Native|Protected|BlueprintCallable) // @ game+0x8bcfe0
	void ServerRemoveVehicleOverlayWidget(); // Function Squad.SQPlayerController.ServerRemoveVehicleOverlayWidget // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bcf90
	void ServerRearmWeapons(struct UObject* RearmObject, struct TArray<struct FSQRearmWeaponRequest> RearmRequest); // Function Squad.SQPlayerController.ServerRearmWeapons // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bce80
	void ServerProcessApprovalEntry(char Mode, uint32 VerifyKey); // Function Squad.SQPlayerController.ServerProcessApprovalEntry // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bcd80
	void ServerPlayEmoteAnim(enum class ESQEmotes Emote); // Function Squad.SQPlayerController.ServerPlayEmoteAnim // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x8bccd0
	void ServerPlayCustomEmote(struct FName CustomName); // Function Squad.SQPlayerController.ServerPlayCustomEmote // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x8bcc10
	void ServerOnPlayerToggleVoice_Editor(struct FUniqueNetIdRepl TalkingPlayerId, enum class ESQVoiceChannel VoiceChannel); // Function Squad.SQPlayerController.ServerOnPlayerToggleVoice_Editor // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bca50
	void ServerNotifyExplosiveHit(struct FSQShotInfo ShotInfoZeroBased, struct TArray<struct FSQPenetrationTrace> TargetsZeroBased, struct FHitResult HitResult, struct FArmorPenetration CachedPenetration, struct FSQWeaponData WeaponConfig); // Function Squad.SQPlayerController.ServerNotifyExplosiveHit // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc7a0
	void ServerMuteSquad(struct ASQSquadState* MuteSquadState); // Function Squad.SQPlayerController.ServerMuteSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc6e0
	void ServerMovePlayerToFireTeam(struct ASQPlayerState* TargetPlayerState, int FireTeamIndex, int Position); // Function Squad.SQPlayerController.ServerMovePlayerToFireTeam // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc5b0
	void ServerLeaveSquad(); // Function Squad.SQPlayerController.ServerLeaveSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc560
	void ServerKickPlayerFromSquad(struct ASQPlayerState* ToKick); // Function Squad.SQPlayerController.ServerKickPlayerFromSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc4a0
	void ServerJoinSquad(struct ASQSquadStatePrivateToTeam* ToJoin); // Function Squad.SQPlayerController.ServerJoinSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc3e0
	void ServerGiveUp(); // Function Squad.SQPlayerController.ServerGiveUp // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc390
	void ServerGiveSquadLeader(struct ASQPlayerState* NewLeader); // Function Squad.SQPlayerController.ServerGiveSquadLeader // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc2d0
	void ServerGiveFireTeamLeader(struct ASQPlayerState* NewLeader, int FireTeamIndex); // Function Squad.SQPlayerController.ServerGiveFireTeamLeader // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc1d0
	void ServerGameplayUnmutePlayer(struct FUniqueNetIdRepl MutePlayerId); // Function Squad.SQPlayerController.ServerGameplayUnmutePlayer // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bc060
	void ServerGameplayMutePlayer(struct FUniqueNetIdRepl MutePlayerId); // Function Squad.SQPlayerController.ServerGameplayMutePlayer // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bbef0
	void ServerGameCommandFromRemotePlayer(struct FString Cmd); // Function Squad.SQPlayerController.ServerGameCommandFromRemotePlayer // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bbe20
	void ServerFinishSeatProgress(struct ASQVehicle* Vehicle); // Function Squad.SQPlayerController.ServerFinishSeatProgress // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bbd60
	void ServerEndHealing(); // Function Squad.SQPlayerController.ServerEndHealing // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bbd10
	void ServerEmergencyTeleport(struct ASQVehicle* Vehicle, float HeightOffset, float YawDegrees); // Function Squad.SQPlayerController.ServerEmergencyTeleport // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bbbe0
	void ServerDisbandSquad(); // Function Squad.SQPlayerController.ServerDisbandSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bbb90
	void ServerDisbandFireTeam(int FireTeamIndex); // Function Squad.SQPlayerController.ServerDisbandFireTeam // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bbad0
	void ServerDebugToggleVehicleGodMode(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleVehicleGodMode // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bba10
	void ServerDebugToggleShowVehicleDamageReceived(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleShowVehicleDamageReceived // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb950
	void ServerDebugToggleShowRebase(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleShowRebase // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb890
	void ServerDebugToggleShowHitreg(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleShowHitreg // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb7d0
	void ServerDebugToggleNoStaminaDrain(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleNoStaminaDrain // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb710
	void ServerDebugToggleInfiniteMags(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleInfiniteMags // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb650
	void ServerDebugToggleForceNoCommanderCooldowns(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleForceNoCommanderCooldowns // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb590
	void ServerDebugToggleForceAllowCommanderActions(bool Value); // Function Squad.SQPlayerController.ServerDebugToggleForceAllowCommanderActions // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb4d0
	void ServerDebugSkipStaging(); // Function Squad.SQPlayerController.ServerDebugSkipStaging // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb480
	void ServerDebugSetServerTickRate(float NewTickRate); // Function Squad.SQPlayerController.ServerDebugSetServerTickRate // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb3d0
	void ServerDebugSetServerSecondsNonSeamlessForced(float Seconds); // Function Squad.SQPlayerController.ServerDebugSetServerSecondsNonSeamlessForced // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb320
	void ServerDebugRemoveSteamTestItem(int ID, int Amount); // Function Squad.SQPlayerController.ServerDebugRemoveSteamTestItem // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x8bb220
	void ServerDebugEndMatch(); // Function Squad.SQPlayerController.ServerDebugEndMatch // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bb1d0
	void ServerDebugBugItGo(float X, float Y, float Z, float Pitch, float Yaw, float Roll); // Function Squad.SQPlayerController.ServerDebugBugItGo // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bafb0
	void ServerDebugAssignSteamTestItem(int ID, int Amount); // Function Squad.SQPlayerController.ServerDebugAssignSteamTestItem // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x8baeb0
	void ServerCreateVehicleOverlayWidget(struct USQVehicleViewWidget* WidgetClass); // Function Squad.SQPlayerController.ServerCreateVehicleOverlayWidget // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8badf0
	void ServerCreateSquad(struct FString Name, bool Locked); // Function Squad.SQPlayerController.ServerCreateSquad // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bacd0
	void ServerCreateRallyPoint(); // Function Squad.SQPlayerController.ServerCreateRallyPoint // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8bac80
	void ServerChat(struct FString Msg, enum class ESQChat ChatType); // Function Squad.SQPlayerController.ServerChat // (Net|Native|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8bab70
	void ServerChangeSquadLock(struct ASQSquadState* Squad); // Function Squad.SQPlayerController.ServerChangeSquadLock // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8baab0
	void ServerCancelRestartPlayer(); // Function Squad.SQPlayerController.ServerCancelRestartPlayer // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8baa60
	void ServerAddApprovalEntry(struct FSQApprovalEntryRequest Entry, enum class EApprovalRequestChannels Filter); // Function Squad.SQPlayerController.ServerAddApprovalEntry // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8ba960
	void SelectSpawn(struct ASQGameSpawn* Spawn); // Function Squad.SQPlayerController.SelectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x8ba8e0
	void Say(struct FString Msg); // Function Squad.SQPlayerController.Say // (Exec|Native|Public|BlueprintCallable) // @ game+0x8ba830
	void Respawn(); // Function Squad.SQPlayerController.Respawn // (Exec|Native|Public|BlueprintCallable) // @ game+0x8ba3f0
	bool RequestRoleRearm(struct USQRoleSettings* InRoleSettings, struct TScriptInterface<Class>& InRearmSource); // Function Squad.SQPlayerController.RequestRoleRearm // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8ba300
	bool RequestRole(struct USQRoleSettings* InRoleSettings); // Function Squad.SQPlayerController.RequestRole // (Final|Native|Public|BlueprintCallable) // @ game+0x8ba270
	void RandomizeOriginOffset(); // Function Squad.SQPlayerController.RandomizeOriginOffset // (Final|Native|Public) // @ game+0x8ba250
	void ProcessApprovalEntry(char Mode); // Function Squad.SQPlayerController.ProcessApprovalEntry // (Final|Native|Public|BlueprintCallable) // @ game+0x8ba1d0
	void PrintWeaponHashes(); // Function Squad.SQPlayerController.PrintWeaponHashes // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8ba1b0
	void PlayMusic(); // Function Squad.SQPlayerController.PlayMusic // (Native|Public|BlueprintCallable) // @ game+0x8ba190
	void PlayEmoteAnim(enum class ESQEmotes Emote, struct FName CustomName); // Function Squad.SQPlayerController.PlayEmoteAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x8ba0d0
	void OnWorldOriginLocationChangedEventHandler(struct FVector WorldOrigin); // Function Squad.SQPlayerController.OnWorldOriginLocationChangedEventHandler // (Final|Native|Public|HasDefaults) // @ game+0x8ba040
	void OnSpawningEnabledStateChanged(struct ASQGameSpawn* SpawnPoint); // Function Squad.SQPlayerController.OnSpawningEnabledStateChanged // (Final|Native|Private) // @ game+0x8b9fc0
	void OnSelectedSpawnSiegedStateChanged(struct ASQGameSpawn* SpawnPoint); // Function Squad.SQPlayerController.OnSelectedSpawnSiegedStateChanged // (Final|Native|Private) // @ game+0x8b9ec0
	void OnSelectedSpawnerDestroyed(struct AActor* Actor); // Function Squad.SQPlayerController.OnSelectedSpawnerDestroyed // (Final|Native|Private) // @ game+0x8b9f40
	void OnSelectedSpawnActivatedTimeStampChangedSignal(struct ASQGameSpawn* SpawnPoint); // Function Squad.SQPlayerController.OnSelectedSpawnActivatedTimeStampChangedSignal // (Final|Native|Private) // @ game+0x8b9e40
	void OnRep_TeamState(); // Function Squad.SQPlayerController.OnRep_TeamState // (Native|Public) // @ game+0x8b9e20
	void OnRep_SquadState(struct ASQSquadState* OldSquadState); // Function Squad.SQPlayerController.OnRep_SquadState // (Native|Public) // @ game+0x8b9d90
	void OnRep_PendingDeathKillTimestamp(); // Function Squad.SQPlayerController.OnRep_PendingDeathKillTimestamp // (Final|Native|Private) // @ game+0x8b9d70
	void OnRep_OutOfMapBoundsKillTimestamp(); // Function Squad.SQPlayerController.OnRep_OutOfMapBoundsKillTimestamp // (Final|Native|Private) // @ game+0x8b9d50
	void OnRep_CurrentSeat(); // Function Squad.SQPlayerController.OnRep_CurrentSeat // (Final|Native|Public) // @ game+0x8b9d30
	void OnReceiveChat(struct ASQPlayerState* Speaker, struct FString Message, enum class ESQChat Channel, enum class ESQNotificationTypes NotificationType, struct FString StreamerModeVariantMessage); // Function Squad.SQPlayerController.OnReceiveChat // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x8b9b80
	void OnPendingDeathChanged(float KillTimestamp, bool bDeathIsPending); // Function Squad.SQPlayerController.OnPendingDeathChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnOutOfMapBoundsChanged(float KillTimestamp, bool bIsOutOfBounds); // Function Squad.SQPlayerController.OnOutOfMapBoundsChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	bool OnFireWeaponOverride(); // Function Squad.SQPlayerController.OnFireWeaponOverride // (Native|Event|Public|BlueprintEvent) // @ game+0x8b9b50
	void OnExitBoundary(struct USQBoundaryListener* Listener, struct ASQBoundary* Boundary); // Function Squad.SQPlayerController.OnExitBoundary // (Final|Native|Public) // @ game+0x8b9a90
	void OnEnterBoundary(struct USQBoundaryListener* Listener, struct ASQBoundary* Boundary); // Function Squad.SQPlayerController.OnEnterBoundary // (Final|Native|Public) // @ game+0x8b99d0
	void OnDelayedSpawnCallback(); // Function Squad.SQPlayerController.OnDelayedSpawnCallback // (Final|Native|Private) // @ game+0x8b99b0
	bool OnAltFireWeaponOverride(); // Function Squad.SQPlayerController.OnAltFireWeaponOverride // (Native|Event|Public|BlueprintEvent) // @ game+0x8b9980
	void MuteSquad(struct ASQSquadState* MuteSquadState); // Function Squad.SQPlayerController.MuteSquad // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b9900
	void MuteAllPlayersExceptSquad(); // Function Squad.SQPlayerController.MuteAllPlayersExceptSquad // (Final|Native|Public|BlueprintCallable) // @ game+0x8b98e0
	void MovePlayerToFireTeam(struct ASQPlayerState* TargetPlayerState, int FireTeamIndex, int Position); // Function Squad.SQPlayerController.MovePlayerToFireTeam // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b97e0
	void LeaveSquad(); // Function Squad.SQPlayerController.LeaveSquad // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b9740
	void KickPlayerFromSquad(struct ASQPlayerState* ToKick); // Function Squad.SQPlayerController.KickPlayerFromSquad // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b96c0
	void JoinSquadWithName(struct FString Name); // Function Squad.SQPlayerController.JoinSquadWithName // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b9620
	void JoinSquadWithId(int ID); // Function Squad.SQPlayerController.JoinSquadWithId // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b95a0
	bool IsWounded(); // Function Squad.SQPlayerController.IsWounded // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9570
	bool IsWeaponInputIgnored(); // Function Squad.SQPlayerController.IsWeaponInputIgnored // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9540
	bool IsUsingFreeLook(); // Function Squad.SQPlayerController.IsUsingFreeLook // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9510
	bool IsSquadLeader(); // Function Squad.SQPlayerController.IsSquadLeader // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b94e0
	bool IsShowingSpawnMenu(); // Function Squad.SQPlayerController.IsShowingSpawnMenu // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b94b0
	bool IsRoamingMapOpen(); // Function Squad.SQPlayerController.IsRoamingMapOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9480
	bool IsQA(); // Function Squad.SQPlayerController.IsQA // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9450
	bool IsPlayer(); // Function Squad.SQPlayerController.IsPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b9420
	bool IsOutOfMapBounds(); // Function Squad.SQPlayerController.IsOutOfMapBounds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b93f0
	bool IsMember(); // Function Squad.SQPlayerController.IsMember // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b93c0
	bool IsInVehicle(); // Function Squad.SQPlayerController.IsInVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b9360
	bool IsInactive(); // Function Squad.SQPlayerController.IsInactive // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b9390
	bool IsFireTeamLeader(); // Function Squad.SQPlayerController.IsFireTeamLeader // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9330
	bool IsEntryMap(); // Function Squad.SQPlayerController.IsEntryMap // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b9300
	bool IsDev(); // Function Squad.SQPlayerController.IsDev // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b92d0
	bool IsDeployRoleAvailable(); // Function Squad.SQPlayerController.IsDeployRoleAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b92a0
	bool IsDeathPending(); // Function Squad.SQPlayerController.IsDeathPending // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9270
	bool IsCommander(); // Function Squad.SQPlayerController.IsCommander // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9240
	bool IsCameraMan(); // Function Squad.SQPlayerController.IsCameraMan // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b9210
	bool IsAlive(); // Function Squad.SQPlayerController.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b91e0
	bool IsAdminCamera(); // Function Squad.SQPlayerController.IsAdminCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b91b0
	bool IsAdmin(); // Function Squad.SQPlayerController.IsAdmin // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b9180
	void GiveUp(); // Function Squad.SQPlayerController.GiveUp // (Exec|Native|Public|BlueprintCallable) // @ game+0x8b9160
	void GiveSquadLeader(struct ASQPlayerState* NewLeader); // Function Squad.SQPlayerController.GiveSquadLeader // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b90e0
	void GiveFireTeamLeader(struct ASQPlayerState* NewLeader, int FireTeamIndex); // Function Squad.SQPlayerController.GiveFireTeamLeader // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b9020
	float GetYawInputScale(); // Function Squad.SQPlayerController.GetYawInputScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8ff0
	int GetTeam(); // Function Squad.SQPlayerController.GetTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8f20
	struct ASQPlayerState* GetSquadPlayerState(); // Function Squad.SQPlayerController.GetSquadPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8ef0
	struct ASQSoldier* GetSoldier(); // Function Squad.SQPlayerController.GetSoldier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8ec0
	struct ASQGameSpawn* GetSelectedSpawn(); // Function Squad.SQPlayerController.GetSelectedSpawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8d30
	float GetPitchInputScale(); // Function Squad.SQPlayerController.GetPitchInputScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8c70
	float GetPendingDeathKillTimestamp(); // Function Squad.SQPlayerController.GetPendingDeathKillTimestamp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8c50
	float GetOutOfMapBoundsKillTimestamp(); // Function Squad.SQPlayerController.GetOutOfMapBoundsKillTimestamp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8ac0
	float GetLastDeathTime(); // Function Squad.SQPlayerController.GetLastDeathTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b8a10
	struct USQRoleSettings* GetDeployRole(); // Function Squad.SQPlayerController.GetDeployRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b86d0
	void GetDeployableReference(struct USQDeployableSettings* InDeployableSettings, struct UClass*& OutDeployableReference); // Function Squad.SQPlayerController.GetDeployableReference // (Event|Protected|HasOutParms|BlueprintEvent|Const) // @ game+0x12b8b50
	struct ASQVehicle* GetCurrentVehicle(); // Function Squad.SQPlayerController.GetCurrentVehicle // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8530
	struct ASQVehicleSeat* GetCurrentSeatPawn(); // Function Squad.SQPlayerController.GetCurrentSeatPawn // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8500
	struct USQVehicleSeatComponent* GetCurrentSeat(); // Function Squad.SQPlayerController.GetCurrentSeat // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b84d0
	struct USQRoleSettings* GetCurrentRole(); // Function Squad.SQPlayerController.GetCurrentRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b84a0
	void FinalizePendingDeployableItem(bool& OutSuccess); // Function Squad.SQPlayerController.FinalizePendingDeployableItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8b8370
	void FinalizePendingDeployable(bool& OutSuccess); // Function Squad.SQPlayerController.FinalizePendingDeployable // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8b82e0
	void DisbandSquad(); // Function Squad.SQPlayerController.DisbandSquad // (Final|Native|Public|BlueprintCallable) // @ game+0x8b82c0
	void DisbandFireTeam(int FireTeamIndex); // Function Squad.SQPlayerController.DisbandFireTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x8b8240
	void DisapproveQueue(); // Function Squad.SQPlayerController.DisapproveQueue // (Final|Native|Public|BlueprintCallable) // @ game+0x8b8220
	void DebugToggleVehicleGodMode(bool Value); // Function Squad.SQPlayerController.DebugToggleVehicleGodMode // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b8190
	void DebugToggleShowVehicleDamageReceived(bool Value); // Function Squad.SQPlayerController.DebugToggleShowVehicleDamageReceived // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b8100
	void DebugToggleShowRebase(bool Value); // Function Squad.SQPlayerController.DebugToggleShowRebase // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b8070
	void DebugToggleShowHitreg(bool Value); // Function Squad.SQPlayerController.DebugToggleShowHitreg // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7fe0
	void DebugToggleNoStaminaDrain(bool Value); // Function Squad.SQPlayerController.DebugToggleNoStaminaDrain // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7f50
	void DebugToggleInfiniteMags(bool Value); // Function Squad.SQPlayerController.DebugToggleInfiniteMags // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7ec0
	void DebugToggleForceNoCommanderCooldowns(bool Value); // Function Squad.SQPlayerController.DebugToggleForceNoCommanderCooldowns // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7e30
	void DebugToggleForceAllowCommanderActions(bool Value); // Function Squad.SQPlayerController.DebugToggleForceAllowCommanderActions // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7da0
	void DebugToggleEditorBlastCones(bool Value); // Function Squad.SQPlayerController.DebugToggleEditorBlastCones // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7d10
	void DebugToggleCenterDot(); // Function Squad.SQPlayerController.DebugToggleCenterDot // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7cf0
	void DebugSkipStaging(); // Function Squad.SQPlayerController.DebugSkipStaging // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7cd0
	void DebugSetServerTickRate(float NewTickRate); // Function Squad.SQPlayerController.DebugSetServerTickRate // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7c50
	void DebugSetServerSecondsNonSeamlessForced(float Seconds); // Function Squad.SQPlayerController.DebugSetServerSecondsNonSeamlessForced // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7c50
	void DebugRemoveSteamTestItem(int ID, int Amount); // Function Squad.SQPlayerController.DebugRemoveSteamTestItem // (Final|Exec|Native|Private|BlueprintCallable) // @ game+0x8b7b90
	void DebugForceOriginRebase(); // Function Squad.SQPlayerController.DebugForceOriginRebase // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7b70
	void DebugEndMatch(); // Function Squad.SQPlayerController.DebugEndMatch // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7b50
	void DebugBugItGo(float X, float Y, float Z, float Pitch, float Yaw, float Roll); // Function Squad.SQPlayerController.DebugBugItGo // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b7970
	void DebugAssignSteamTestItem(int ID, int Amount); // Function Squad.SQPlayerController.DebugAssignSteamTestItem // (Final|Exec|Native|Private|BlueprintCallable) // @ game+0x8b78b0
	void CreateSquad(struct FString Name, bool Locked); // Function Squad.SQPlayerController.CreateSquad // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b77c0
	void CreateRallyPoint(); // Function Squad.SQPlayerController.CreateRallyPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x8b77a0
	void CreateMarker(int TeamId, int ClientId, struct UTexture2D* IconTexture, struct FVector2D MapPosition, float LifeT, struct AActor* MyOwner); // Function Squad.SQPlayerController.CreateMarker // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|BlueprintCallable|NetValidate) // @ game+0x8b7590
	void CoreStateRefreshVisibility(); // Function Squad.SQPlayerController.CoreStateRefreshVisibility // (Final|Native|Protected|BlueprintCallable) // @ game+0x8b7570
	void CommitSpawn(); // Function Squad.SQPlayerController.CommitSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x8b7550
	void CloseConsole(); // Function Squad.SQPlayerController.CloseConsole // (Final|Native|Public|BlueprintCallable) // @ game+0x8b7530
	void ClientWasKickedFromSquad(struct FText KickReason, int SquadId, float DurationOfBan); // Function Squad.SQPlayerController.ClientWasKickedFromSquad // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b73d0
	void ClientSystemMessage(struct FString Message, struct FLinearColor Color, float MessageLifetime, enum class ESQNotificationTypes NotificationType); // Function Squad.SQPlayerController.ClientSystemMessage // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient|BlueprintCallable) // @ game+0x8b7260
	void ClientStartSeatProgressBar(float Timer, struct ASQVehicle* Vehicle, enum class ESeatProgressMenuMode MenuMode); // Function Squad.SQPlayerController.ClientStartSeatProgressBar // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b7110
	void ClientStartOnlineGame(); // Function Squad.SQPlayerController.ClientStartOnlineGame // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b70f0
	void ClientStartingNewPlayer(); // Function Squad.SQPlayerController.ClientStartingNewPlayer // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x8b7210
	void ClientShowVehicleInventory(struct ASQVehicle* Vehicle, enum class ESeatProgressMenuMode MenuMode); // Function Squad.SQPlayerController.ClientShowVehicleInventory // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b7020
	void ClientShowToast(struct FText ToastText, float Lifetime); // Function Squad.SQPlayerController.ClientShowToast // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b6f10
	void ClientSetSpectatorCamera(struct FVector CameraLocation, struct FRotator CameraRotation); // Function Squad.SQPlayerController.ClientSetSpectatorCamera // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0x8b6e30
	void ClientSendRoundEndEvent(int WinningTeam, int LosingTeam, int WinnerTickets, int LoserTickets); // Function Squad.SQPlayerController.ClientSendRoundEndEvent // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6cf0
	void ClientSendLineToConsole(struct FString Line); // Function Squad.SQPlayerController.ClientSendLineToConsole // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6c40
	void ClientResetInventoryWeaponIndex(); // Function Squad.SQPlayerController.ClientResetInventoryWeaponIndex // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b6c20
	void ClientReportServerTime(struct FDateTime InRequestClientUTCTime, struct FDateTime InServerUTCTime, float WaterTimeSeconds); // Function Squad.SQPlayerController.ClientReportServerTime // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0x8b6b20
	void ClientRemoveVehicleOverlayWidget(); // Function Squad.SQPlayerController.ClientRemoveVehicleOverlayWidget // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b6b00
	void ClientPushApprovalMessage(uint32 Key, struct FSQApprovalEntryRequest ApprovalEntry, struct ASQPlayerState* Requester); // Function Squad.SQPlayerController.ClientPushApprovalMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b69f0
	void ClientOpenDeployableInteractableMenu(struct ASQDeployableInteractable* DeployableInteractable); // Function Squad.SQPlayerController.ClientOpenDeployableInteractableMenu // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b6960
	void ClientOpenAmmoBag(struct ASQDeployableAmmoBag* ammobag); // Function Squad.SQPlayerController.ClientOpenAmmoBag // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b68d0
	void ClientOnPlayerToggleVoice_Editor(struct FUniqueNetIdRepl TalkingPlayerId, enum class ESQVoiceChannel VoiceChannel); // Function Squad.SQPlayerController.ClientOnPlayerToggleVoice_Editor // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6760
	void ClientNotifyPlayerWounded(struct ASQPlayerController* WoundedPlayer); // Function Squad.SQPlayerController.ClientNotifyPlayerWounded // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b66d0
	void ClientNotifyPlayerDestroyedVehicle(struct ASQVehicle* Vehicle); // Function Squad.SQPlayerController.ClientNotifyPlayerDestroyedVehicle // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6640
	void ClientIgnoreWeaponInput(bool bIgnore); // Function Squad.SQPlayerController.ClientIgnoreWeaponInput // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b65b0
	void ClientHideVehicleRadial(); // Function Squad.SQPlayerController.ClientHideVehicleRadial // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6590
	void ClientGameStarted(); // Function Squad.SQPlayerController.ClientGameStarted // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6570
	void ClientExposeUnavailabilityReason(struct FDataTableRowHandle InReason); // Function Squad.SQPlayerController.ClientExposeUnavailabilityReason // (BlueprintAuthorityOnly|Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable|NetValidate) // @ game+0x8b64a0
	void ClientEndOnlineGame(); // Function Squad.SQPlayerController.ClientEndOnlineGame // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6480
	void ClientEndHealing(); // Function Squad.SQPlayerController.ClientEndHealing // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8b6460
	void ClientDrawSphere(struct FVector ZeroLocation, float Radius, int Segments, struct FColor Color, bool RebaseOntoLocal, bool bPersistentLines, float Lifetime, struct FString LogLabel, char DepthPriority, float Thickness); // Function Squad.SQPlayerController.ClientDrawSphere // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0x8b6170
	void ClientCreateVehicleOverlayWidget(struct USQVehicleViewWidget* WidgetClass); // Function Squad.SQPlayerController.ClientCreateVehicleOverlayWidget // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b60e0
	void ClientCloseDeployableInteractableMenu(struct ASQDeployableInteractable* DeployableInteractable); // Function Squad.SQPlayerController.ClientCloseDeployableInteractableMenu // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b6050
	void ClientCloseAmmoBag(struct ASQDeployableAmmoBag* ammobag); // Function Squad.SQPlayerController.ClientCloseAmmoBag // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x8b5fc0
	void ClientChat(struct ASQPlayerState* Speaker, struct FString Message, enum class ESQChat Channel, enum class ESQNotificationTypes NotificationType, struct FString StreamerModeVariantMessage); // Function Squad.SQPlayerController.ClientChat // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable|Const) // @ game+0x8b5e10
	void CheckForAdmin(); // Function Squad.SQPlayerController.CheckForAdmin // (Final|Native|Public) // @ game+0x8b5df0
	void ChatToTeam(struct FString Msg); // Function Squad.SQPlayerController.ChatToTeam // (Exec|Native|Public|BlueprintCallable) // @ game+0x8b5d40
	void ChatToSquad(struct FString Msg); // Function Squad.SQPlayerController.ChatToSquad // (Exec|Native|Public|BlueprintCallable) // @ game+0x8b5c90
	void ChatToAll(struct FString Msg); // Function Squad.SQPlayerController.ChatToAll // (Exec|Native|Public|BlueprintCallable) // @ game+0x8b5be0
	void Chat(struct FString Msg, enum class ESQChat ChatType); // Function Squad.SQPlayerController.Chat // (Exec|Native|Public) // @ game+0x8b5af0
	void ChangeTeamsWithId(int NewTeam); // Function Squad.SQPlayerController.ChangeTeamsWithId // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b5a70
	void ChangeTeams(); // Function Squad.SQPlayerController.ChangeTeams // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8b5a50
	void ChangeRoleFromDeployable(struct USQRoleSettings* NewRole, struct ASQDeployable* Deployable); // Function Squad.SQPlayerController.ChangeRoleFromDeployable // (Final|Native|Protected|BlueprintCallable) // @ game+0x8b5990
	void ChangeRole(struct USQRoleSettings* NewRole, bool bGivePartialAmmo, bool bLeavingSquad); // Function Squad.SQPlayerController.ChangeRole // (Final|Native|Protected|BlueprintCallable) // @ game+0x8b5880
	void CancelPendingDeployable(); // Function Squad.SQPlayerController.CancelPendingDeployable // (Final|Native|Public|BlueprintCallable) // @ game+0x8b5860
	void BPTraceMarkerLocation(struct ASQMapMarker* MarkerClass, struct FVector& Start, struct FVector& End); // Function Squad.SQPlayerController.BPTraceMarkerLocation // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x12b8b50
	void BPServerRearmWeapons(struct TScriptInterface<Class>& RearmSource, struct TArray<struct FSQRearmWeaponRequest>& RearmRequest); // Function Squad.SQPlayerController.BPServerRearmWeapons // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8b5620
	bool BPHasAccessLevel(enum class ESQAdminAccessLevels RequestedLevel); // Function Squad.SQPlayerController.BPHasAccessLevel // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8b5590
	void BP_InitializeDeployableFromEquippable(struct ASQDeployableItem* DeployableItem, struct ASQEquipableItem* Equippable); // Function Squad.SQPlayerController.BP_InitializeDeployableFromEquippable // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void BP_FailPlaceDeployableFromEquippable(struct ASQEquipableItem* Equippable); // Function Squad.SQPlayerController.BP_FailPlaceDeployableFromEquippable // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void BP_ExposeUnavailabilityReason(struct FDataTableRowHandle& InReason); // Function Squad.SQPlayerController.BP_ExposeUnavailabilityReason // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x12b8b50
	void BlueprintPlayerSpawned(); // Function Squad.SQPlayerController.BlueprintPlayerSpawned // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BlueprintPlayerDied(); // Function Squad.SQPlayerController.BlueprintPlayerDied // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BlueprintOnMatchStarted(); // Function Squad.SQPlayerController.BlueprintOnMatchStarted // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BlueprintOnMatchEnded(int WinningTeam, int LosingTeam, int WinnerTickets, int LoserTickets); // Function Squad.SQPlayerController.BlueprintOnMatchEnded // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void ApproveVehicleClaim(); // Function Squad.SQPlayerController.ApproveVehicleClaim // (Exec|Native|Public) // @ game+0x8b5570
	void ApproveQueue(); // Function Squad.SQPlayerController.ApproveQueue // (Final|Native|Public|BlueprintCallable) // @ game+0x8b5550
	void ApprovalEntryExpireOnServer(uint32 Index); // Function Squad.SQPlayerController.ApprovalEntryExpireOnServer // (Final|Native|Private) // @ game+0x8b54d0
	void ApprovalEntryExpireOnClient(uint32 Index); // Function Squad.SQPlayerController.ApprovalEntryExpireOnClient // (Final|Native|Private) // @ game+0x8b5450
};

// Class Squad.SQAdminStats
// Size: 0xf0 (Inherited: 0xd8)
struct USQAdminStats : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)
};

// Class Squad.SQAIController
// Size: 0x370 (Inherited: 0x350)
struct ASQAIController : AAIController {
	struct UBlackboardComponent* BlackboardComp; // 0x350(0x08)
	struct UBehaviorTreeComponent* BehaviorComp; // 0x358(0x08)
	char pad_360[0x10]; // 0x360(0x10)

	void SpawnBots(int NumberOfBotsToSpawn); // Function Squad.SQAIController.SpawnBots // (Final|Exec|Native|Static|Public|BlueprintCallable) // @ game+0x829df0
	void ShootEnemy(); // Function Squad.SQAIController.ShootEnemy // (Final|Native|Public|BlueprintCallable) // @ game+0x829dd0
	bool IsEnemy(struct ASQSoldier* Soldier); // Function Squad.SQAIController.IsEnemy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x829760
	bool FindClosestEnemyWithLOS(struct ASQSoldier* ExcludeEnemy); // Function Squad.SQAIController.FindClosestEnemyWithLOS // (Final|Native|Public|BlueprintCallable) // @ game+0x8291b0
	void FindClosestEnemy(); // Function Squad.SQAIController.FindClosestEnemy // (Final|Native|Public|BlueprintCallable) // @ game+0x829190
};

// Class Squad.SQAmbientAndReverbComponent
// Size: 0x260 (Inherited: 0x220)
struct USQAmbientAndReverbComponent : USceneComponent {
	struct FScriptMulticastDelegate OnComponentBeginOverlap; // 0x218(0x01)
	struct FScriptMulticastDelegate OnComponentEndOverlap; // 0x219(0x01)
	struct FSQReverbVolumeEffect ReverbEffectSettings; // 0x220(0x20)
	struct UAudioComponent* SoundComponent; // 0x240(0x08)
	struct USoundBase* SoundEffect; // 0x248(0x08)
	float AmbientFadeInTime; // 0x250(0x04)
	float AmbientFadeOutTime; // 0x254(0x04)
	char pad_25A[0x6]; // 0x25a(0x06)

	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int OtherBodyIndex); // Function Squad.SQAmbientAndReverbComponent.OnOverlapEnd // (Final|Native|Public) // @ game+0x829a00
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Squad.SQAmbientAndReverbComponent.OnOverlapBegin // (Final|Native|Public|HasOutParms) // @ game+0x829810
};

// Class Squad.SQVehicleResource
// Size: 0x280 (Inherited: 0x248)
struct ASQVehicleResource : AActor {
	float ResourceDropQuantity; // 0x248(0x04)
	float ResourceDropRate; // 0x24c(0x04)
	float ServerResourceRate; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct ASQForwardBase* CurrentFob; // 0x258(0x08)
	struct AActor* CurrentCaptureZone; // 0x260(0x08)
	struct USQVehicleResourceWeaponInventoryComponent* ParentInventory; // 0x268(0x08)
	char pad_270[0x8]; // 0x270(0x08)
	int MaxResources; // 0x278(0x04)
	int Resources; // 0x27c(0x04)

	void UseResource(float ModifyAmount); // Function Squad.SQVehicleResource.UseResource // (Final|Native|Protected|BlueprintCallable) // @ game+0x911e20
	void ServerEndResourceDropOff(); // Function Squad.SQVehicleResource.ServerEndResourceDropOff // (Net|NetReliableNative|Event|Protected|NetServer|BlueprintCallable|NetValidate) // @ game+0x911490
	void ServerBeginResourceDropOff(struct ASQForwardBase* fob, struct AActor* Zone, float DropRate); // Function Squad.SQVehicleResource.ServerBeginResourceDropOff // (Net|NetReliableNative|Event|Protected|NetServer|BlueprintCallable|NetValidate) // @ game+0x9112a0
	void ModifyResource(float Amount); // Function Squad.SQVehicleResource.ModifyResource // (Final|BlueprintAuthorityOnly|Native|Protected|BlueprintCallable) // @ game+0x910dd0
	bool FindValidDropOffs(struct ASQForwardBase*& fob, struct AActor*& Zone); // Function Squad.SQVehicleResource.FindValidDropOffs // (Final|Native|Protected|HasOutParms) // @ game+0x9105d0
	void BeginResourceDropOff(); // Function Squad.SQVehicleResource.BeginResourceDropOff // (Final|Native|Protected|BlueprintCallable) // @ game+0x910410
	bool AtValidResourcePoint(); // Function Squad.SQVehicleResource.AtValidResourcePoint // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x9103e0
};

// Class Squad.SQAmmoResource
// Size: 0x280 (Inherited: 0x280)
struct ASQAmmoResource : ASQVehicleResource {
};

// Class Squad.SQAmmoWidget
// Size: 0x340 (Inherited: 0x230)
struct USQAmmoWidget : USQUserWidget {
	struct TArray<struct USQMagazineGroupWidget*> MagazineGroupWidgets; // 0x230(0x10)
	struct UCanvasPanel* HighestLevelCanvas; // 0x240(0x08)
	struct UTextBlock* FiremodeTextBlock; // 0x248(0x08)
	struct UTextBlock* AmmoCountTextBlock; // 0x250(0x08)
	struct UTextBlock* ZeroingTextBlock; // 0x258(0x08)
	struct UImage* RoundInChamberImage; // 0x260(0x08)
	bool bShowFireSelectorInfo; // 0x268(0x01)
	bool bShowAmmoInMag; // 0x269(0x01)
	char pad_26A[0x6]; // 0x26a(0x06)
	struct ASQPlayerController* PlayerController; // 0x270(0x08)
	struct ASQPlayerState* PlayerState; // 0x278(0x08)
	struct FLinearColor RefillableMagazineColor; // 0x280(0x10)
	struct FLinearColor FullMagazineColor; // 0x290(0x10)
	struct FLinearColor NearlyFullMagazineColor; // 0x2a0(0x10)
	struct FLinearColor HalfMagazineColor; // 0x2b0(0x10)
	struct FLinearColor EmptyMagazineColor; // 0x2c0(0x10)
	struct FText FireModeAutoText; // 0x2d0(0x18)
	struct FText SightRangeText; // 0x2e8(0x18)
	struct FText FireModeSingleText; // 0x300(0x18)
	struct FText FireModeBurstText; // 0x318(0x18)
	struct ASQEquipableItem* CachedCurrentWeapon; // 0x330(0x08)
	char pad_338[0x8]; // 0x338(0x08)

	void UpdateState(); // Function Squad.SQAmmoWidget.UpdateState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829fd0
	bool UpdateShowingStatus(); // Function Squad.SQAmmoWidget.UpdateShowingStatus // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829fa0
	void UpdateMags(struct ASQEquipableItem* CurrentItem); // Function Squad.SQAmmoWidget.UpdateMags // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829f10
	void UpdateFiremode(struct ASQEquipableItem* CurrentItem); // Function Squad.SQAmmoWidget.UpdateFiremode // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829e80
	void UpdateCurrentWeapon(); // Function Squad.SQAmmoWidget.UpdateCurrentWeapon // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829e60
	void OnShowResourceAmounts(); // Function Squad.SQAmmoWidget.OnShowResourceAmounts // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnShowCurrentWeapon(); // Function Squad.SQAmmoWidget.OnShowCurrentWeapon // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnCurrentWeaponChanged(); // Function Squad.SQAmmoWidget.OnCurrentWeaponChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void InitWidget(); // Function Squad.SQAmmoWidget.InitWidget // (Native|Public|BlueprintCallable) // @ game+0x829740
};

// Class Squad.SQAnimDataEmotes
// Size: 0x210 (Inherited: 0x30)
struct USQAnimDataEmotes : UDataAsset {
	struct FSQEmoteAnims EmoteAnims[0xa]; // 0x30(0x190)
	struct TMap<struct FName, struct FSQEmoteAnims> CustomEmotes; // 0x1c0(0x50)
};

// Class Squad.SQAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct USQAnimInstance : UAnimInstance {
	int LastBoredMontagePlayedIndex; // 0x268(0x04)
	float BoredTargetTime; // 0x26c(0x04)
	bool bIsAds; // 0x270(0x01)
	bool bIsUsingItemOrIsAdsOrIsClimbing; // 0x271(0x01)
	struct USQItemStaticInfo* CurrentItemStaticInfo; // 0x278(0x08)
	struct ASQSoldier* Soldier; // 0x280(0x08)
	struct ASQSoldierNew* SoldierNew; // 0x288(0x08)

	void UpdateStaticItemInfo(struct USQItemStaticInfo* InfoObject); // Function Squad.SQAnimInstance.UpdateStaticItemInfo // (Native|Public|BlueprintCallable) // @ game+0x82ba10
	void UpdateBoredMontage(); // Function Squad.SQAnimInstance.UpdateBoredMontage // (Native|Public|BlueprintCallable) // @ game+0x82b770
	void StopAnimationHandler(struct UAnimMontage* WeaponMontage, struct UAnimMontage* Soldier1pMontage, struct UAnimMontage* Soldier3pMontage, float blendOutTime, bool bStopAllWeaponAnims); // Function Squad.SQAnimInstance.StopAnimationHandler // (Native|Public) // @ game+0x82b520
	void SetAnimationPlayRateHandler(struct UAnimMontage* WeaponMontage, struct UAnimMontage* Soldier1pMontage, struct UAnimMontage* Soldier3pMontage, float NewPlayRate); // Function Squad.SQAnimInstance.SetAnimationPlayRateHandler // (Native|Public) // @ game+0x82b3e0
	void ResumeAnimationHandler(struct UAnimMontage* WeaponMontage, struct UAnimMontage* Soldier1pMontage, struct UAnimMontage* Soldier3pMontage); // Function Squad.SQAnimInstance.ResumeAnimationHandler // (Native|Public) // @ game+0x82b2e0
	void PlayAnimationHandler(struct UAnimMontage* WeaponMontage, struct UAnimMontage* Soldier1pMontage, struct UAnimMontage* Soldier3pMontage); // Function Squad.SQAnimInstance.PlayAnimationHandler // (Native|Public) // @ game+0x82b1e0
	void PauseAnimationHandler(struct UAnimMontage* WeaponMontage, struct UAnimMontage* Soldier1pMontage, struct UAnimMontage* Soldier3pMontage); // Function Squad.SQAnimInstance.PauseAnimationHandler // (Native|Public) // @ game+0x82b0e0
	void EndLoopAnimationHandler(struct UAnimMontage* WeaponMontage, struct UAnimMontage* Soldier1pMontage, struct UAnimMontage* Soldier3pMontage, struct FSQMontageSectionNames SectionNames); // Function Squad.SQAnimInstance.EndLoopAnimationHandler // (Native|Public) // @ game+0x82af30
};

// Class Squad.SQAnimInstanceSoldier
// Size: 0x420 (Inherited: 0x290)
struct USQAnimInstanceSoldier : USQAnimInstance {
	bool bDrawDebugSpheres; // 0x290(0x01)
	bool bIsSoldierAlive; // 0x291(0x01)
	bool bIsSoldierRagdolled; // 0x292(0x01)
	char pad_293[0x1]; // 0x293(0x01)
	struct FVector LeftHandIKLocation; // 0x294(0x0c)
	struct FRotator LeftHandIKRotation; // 0x2a0(0x0c)
	float LeftHandIKAlpha; // 0x2ac(0x04)
	struct FVector RightHandIKLocation; // 0x2b0(0x0c)
	struct FRotator RightHandIKRotation; // 0x2bc(0x0c)
	float RightHandIKAlpha; // 0x2c8(0x04)
	bool bIsDragging; // 0x2cc(0x01)
	char pad_2CD[0x3]; // 0x2cd(0x03)
	struct FRotator DraggingLeftArmRotation; // 0x2d0(0x0c)
	float YawDeltaRaw; // 0x2dc(0x04)
	struct FRotator AddRotShot; // 0x2e0(0x0c)
	struct FRotator AddRotCameraShot; // 0x2ec(0x0c)
	struct FRotator AddAdsRotCameraShot; // 0x2f8(0x0c)
	bool bLeanConditions; // 0x304(0x01)
	char pad_305[0x3]; // 0x305(0x03)
	float BipodLength; // 0x308(0x04)
	struct FVector BipodHeight; // 0x30c(0x0c)
	bool bAutoLowered; // 0x318(0x01)
	char pad_319[0x3]; // 0x319(0x03)
	struct FRotator OffsetLineOfFire; // 0x31c(0x0c)
	float LastVelocityWhenIsInAir; // 0x328(0x04)
	float LeftHandWeaponIkAlpha; // 0x32c(0x04)
	float RightHand3pWeaponIkAlpha; // 0x330(0x04)
	float AdjustAdsSightItemAnimPos; // 0x334(0x04)
	bool bVelocityProneTransAnim; // 0x338(0x01)
	char pad_339[0x3]; // 0x339(0x03)
	float Direction; // 0x33c(0x04)
	bool bCanSprintToProne; // 0x340(0x01)
	bool bIsCrouched; // 0x341(0x01)
	bool bIsProne; // 0x342(0x01)
	bool bIsJumping; // 0x343(0x01)
	bool bIsFalling; // 0x344(0x01)
	char pad_345[0x3]; // 0x345(0x03)
	float Speed; // 0x348(0x04)
	struct FVector Velocity; // 0x34c(0x0c)
	float PitchDeltaRaw; // 0x358(0x04)
	bool bFirstPersonVisibility; // 0x35c(0x01)
	char pad_35D[0x3]; // 0x35d(0x03)
	struct FVector ClimbWeaponSocketLoc; // 0x360(0x0c)
	struct FRotator ClimbWeaponSocketRot; // 0x36c(0x0c)
	struct FRotator VaultClimbAo; // 0x378(0x0c)
	struct FRotator FreeLookRot; // 0x384(0x0c)
	bool bSprintToProneTransAnim; // 0x390(0x01)
	bool bLeanRight; // 0x391(0x01)
	bool bLeanLeft; // 0x392(0x01)
	char LeaningDirection; // 0x393(0x01)
	bool bBipodIsDeployed; // 0x394(0x01)
	char pad_395[0x3]; // 0x395(0x03)
	float BipodTransitionAlpha; // 0x398(0x04)
	bool bShot; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float SprintSpeedMultiplier; // 0x3a0(0x04)
	float MaxWalkSpeedCrouched; // 0x3a4(0x04)
	float MaxWalkSpeedProne; // 0x3a8(0x04)
	float MaxWalkSpeed; // 0x3ac(0x04)
	bool bIsInVehicle; // 0x3b0(0x01)
	char pad_3B1[0x3]; // 0x3b1(0x03)
	float VehiclePitch; // 0x3b4(0x04)
	float VehicleYaw; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct UAnimSequence* VehicleBaseAnim; // 0x3c0(0x08)
	struct UBlendSpace* VehicleAimOffsets; // 0x3c8(0x08)
	bool bUseWheelBlendSpace1D; // 0x3d0(0x01)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	struct UBlendSpace1D* VehicleWheelBlendSpace1D; // 0x3d8(0x08)
	float VehicleWheel; // 0x3e0(0x04)
	float CustomVehicleWheel1; // 0x3e4(0x04)
	float InterpSpeed; // 0x3e8(0x04)
	float CustomSteeringWheelAnimExplTime; // 0x3ec(0x04)
	bool bHandIKAlphaEnabled; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	float SteeringWheelAnimExplTime; // 0x3f4(0x04)
	float RightHandAlpha; // 0x3f8(0x04)
	float LeftHandAlpha; // 0x3fc(0x04)
	float LastVehicleWheelAbs; // 0x400(0x04)
	float VehicleWheelAbsRate; // 0x404(0x04)
	struct UAnimSequence* SteeringWheelSingleFrameAnimSequence; // 0x408(0x08)
	float Time; // 0x410(0x04)
	bool bFP_T_LeanLeftAndLeanConditions; // 0x414(0x01)
	bool bFP_T_NotLeanLeftOrNotLeanConditions; // 0x415(0x01)
	bool bFP_T_LeanRightAndLeanConditions; // 0x416(0x01)
	bool bFP_T_NotLeanRightOrNotLeanConditions; // 0x417(0x01)
	bool bIsPullingTriggerAndMagazineHasAmmo; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)

	void UpdateVehicleAim(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier.UpdateVehicleAim // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bc20
	void UpdateVehicle(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier.UpdateVehicle // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bba0
	void UpdateSteeringWheelVariables(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier.UpdateSteeringWheelVariables // (Final|Native|Protected|BlueprintCallable) // @ game+0x82baa0
	void UpdateLean(); // Function Squad.SQAnimInstanceSoldier.UpdateLean // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b910
	void UpdateFastPathTransitionVariables(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier.UpdateFastPathTransitionVariables // (Native|Protected|BlueprintCallable) // @ game+0x82b810
	void UpdateDragging(); // Function Squad.SQAnimInstanceSoldier.UpdateDragging // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b7d0
	void OnVaultClimbStop(); // Function Squad.SQAnimInstanceSoldier.OnVaultClimbStop // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	struct FRotator AlignWithGround(struct FVector& FloorNormal); // Function Squad.SQAnimInstanceSoldier.AlignWithGround // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x82ae80
};

// Class Squad.SQAnimInstanceSoldier1P
// Size: 0xbe0 (Inherited: 0x420)
struct USQAnimInstanceSoldier1P : USQAnimInstanceSoldier {
	bool bRelevantAnimTimeRemaining__LTEPtTwo__WeaponBobbing1P__St2P; // 0x420(0x01)
	bool bRelevantAnimTimeRemaining__LTEPtTwo__WeaponBobbing1P__P2St; // 0x421(0x01)
	bool bRelevantAnimTimeRemaining__LTEPtTwo__WeaponBobbing1P__Sp2P; // 0x422(0x01)
	char pad_423[0xe1]; // 0x423(0xe1)
	bool bStateWeight__GTEOne__ProneStates__ProneMove; // 0x504(0x01)
	bool bRelevantAnimTimeRemaining__LTEPtTwo__ProneStates__OutProneMove; // 0x505(0x01)
	char pad_506[0x72]; // 0x506(0x72)
	bool bCurrentTime__GTEPtThree__Jump1P__JumpStart__rifle_1ptop_jumpstart; // 0x578(0x01)
	bool bTimeRemaining__LTEPtTwo__Jump1P__JumpEnd__rifle_1ptop_jumpend; // 0x579(0x01)
	bool bTimeRemaining__LTEPtTwo__Jump1P__JumpStart__rifle_1ptop_jumpstart; // 0x57a(0x01)
	char pad_57B[0x79]; // 0x57b(0x79)
	struct FRotator Zeroing; // 0x5f4(0x0c)
	struct UBlendSpaceBase* ProneMoveType; // 0x600(0x08)
	struct UAnimSequence* ProneMoveTypeAdditiveReference; // 0x608(0x08)
	struct UAnimSequence* OutProneMoveType; // 0x610(0x08)
	struct UAnimSequence* OutProneMoveTypeNonadditive; // 0x618(0x08)
	struct UAnimSequence* AdjustableAdsSightItemAnim; // 0x620(0x08)
	float HasAdjustableSightAlpha; // 0x628(0x04)
	struct FVector StandLoc; // 0x62c(0x0c)
	struct FVector CrouchLoc; // 0x638(0x0c)
	struct FVector ProneLoc; // 0x644(0x0c)
	struct FVector BipodLoc; // 0x650(0x0c)
	float StandLocBlendTime; // 0x65c(0x04)
	struct FVector NegFpvTorsoCameraOffset; // 0x660(0x0c)
	struct FVector DeviationVisuFb; // 0x66c(0x0c)
	struct FRotator Sway; // 0x678(0x0c)
	struct FVector StrafeVector; // 0x684(0x0c)
	struct FRotator StrafeRotator; // 0x690(0x0c)
	struct FRotator AdsStrafeRotator; // 0x69c(0x0c)
	float BaseAimPitchPct; // 0x6a8(0x04)
	struct FVector WeapRecoilRelLoc; // 0x6ac(0x0c)
	struct FRotator GlobalDeltaRotDeltaSpring; // 0x6b8(0x0c)
	struct FRotator GlobalDeltaRotDeltaSpringRoll; // 0x6c4(0x0c)
	struct FVector GlobalDeltaLocDeltaSpringWeaponMesh; // 0x6d0(0x0c)
	float LeftHandIKSpringAlpha; // 0x6dc(0x04)
	struct FVector Aim1pWeaponMeshPosition; // 0x6e0(0x0c)
	struct FVector Aim1pWeaponMeshRescale; // 0x6ec(0x0c)
	struct FVector StandLeanLeftRootOffset; // 0x6f8(0x0c)
	struct FRotator StandLeanLeftWeaponRotation; // 0x704(0x0c)
	struct FRotator StandLeanLeftCameraRotation; // 0x710(0x0c)
	struct FVector StandLeanRightRootOffset; // 0x71c(0x0c)
	struct FRotator StandLeanRightWeaponRotation; // 0x728(0x0c)
	struct FRotator StandLeanRightCameraRotation; // 0x734(0x0c)
	struct FVector CrouchLeanLeftRootOffset; // 0x740(0x0c)
	struct FRotator CrouchLeanLeftWeaponRotation; // 0x74c(0x0c)
	struct FRotator CrouchLeanLeftCameraRotation; // 0x758(0x0c)
	struct FVector CrouchLeanRightRootOffset; // 0x764(0x0c)
	struct FRotator CrouchLeanRightWeaponRotation; // 0x770(0x0c)
	struct FRotator CrouchLeanRightCameraRotation; // 0x77c(0x0c)
	struct FVector ProneLeanLeftRootOffset; // 0x788(0x0c)
	struct FRotator ProneLeanLeftWeaponRotation; // 0x794(0x0c)
	struct FRotator ProneLeanLeftCameraRotation; // 0x7a0(0x0c)
	struct FVector ProneLeanRightRootOffset; // 0x7ac(0x0c)
	struct FRotator ProneLeanRightWeaponRotation; // 0x7b8(0x0c)
	struct FRotator ProneLeanRightCameraRotation; // 0x7c4(0x0c)
	float FP_HasSway; // 0x7d0(0x04)
	float FP_JumpStartLoopAlpha; // 0x7d4(0x04)
	float FP_JumpEndBobbingBlendAlpha; // 0x7d8(0x04)
	float FP_JumpEndBobbingAdditiveAlpha; // 0x7dc(0x04)
	float FP_JumpEndCameraRootMotionAlphaBlend; // 0x7e0(0x04)
	bool bFP_IsFallingAndNotJumping; // 0x7e4(0x01)
	char pad_7E5[0x3]; // 0x7e5(0x03)
	float FP_St2P_RootMotionBlendAlpha; // 0x7e8(0x04)
	float FP_P2St_RootMotionBlendAlpha; // 0x7ec(0x04)
	bool bFP_IsProneAndIsSprintingAndCanSprintToProne; // 0x7f0(0x01)
	bool bFP_SwitchedProneAndNotIsProne; // 0x7f1(0x01)
	bool bFP_SwitchedProneAndIsProne; // 0x7f2(0x01)
	char pad_7F3[0x1]; // 0x7f3(0x01)
	struct FRotator FP_ProneMoveIkWeaponHandRootRotFromGroundAngle; // 0x7f4(0x0c)
	struct FRotator FP_ProneMoveIkWeaponHandRootRotFromActorPitch; // 0x800(0x0c)
	bool bFP_ProneMoveWeaponAligningConditions; // 0x80c(0x01)
	char pad_80D[0x3]; // 0x80d(0x03)
	struct FRotator FP_ProneMoveIkWeaponRightClavicleRot; // 0x810(0x0c)
	float FP_ProneMoveBobPlayRate; // 0x81c(0x04)
	bool bFP_SpeedHigherThanZeroAndNotIsProneTransition; // 0x820(0x01)
	bool bFP_SpeedHigherThanZero; // 0x821(0x01)
	bool bFP_HvdXorClAndClOrHvdXorVaAndVaOrBipod; // 0x822(0x01)
	bool bFP_ClimbAnimNotEqual1; // 0x823(0x01)
	bool bFP_ClimbAndClimbAnim1; // 0x824(0x01)
	char pad_825[0x3]; // 0x825(0x03)
	struct FRotator FP_ClimbAndClimbAnim1_AimRotator; // 0x828(0x0c)
	bool bFP_1pLeftHandIkConditions; // 0x834(0x01)
	char pad_835[0x3]; // 0x835(0x03)
	float FP_1pLeftHandIKConditionsAlpha; // 0x838(0x04)
	float FP_IsUsingItemAlpha; // 0x83c(0x04)
	float FP_IsProneAlpha; // 0x840(0x04)
	bool bFP_T_ProneStatesProneMoveToOutProneMove; // 0x844(0x01)
	bool bFP_T_Jump1pJumpStartToJumpEnd; // 0x845(0x01)
	bool bFP_T_ToADS_Hipfire; // 0x846(0x01)
	bool bCachedIsPullingTriggerAndMagazineHasAmmo; // 0x847(0x01)
	float ToADS_Hipfire_RemainingTIme; // 0x848(0x04)
	float Steady1pHipFireDuration; // 0x84c(0x04)
	bool bFP_T_StandToADS_Grenade; // 0x850(0x01)
	bool bFP_T_WeaponBobbing1P_ADSToStand; // 0x851(0x01)
	bool bFP_T_WeaponBobbing1P_ADSToProne; // 0x852(0x01)
	bool bFP_T_WeaponBobbing1P_ProneToADS; // 0x853(0x01)
	float FP_CustomIsCrouchedAlpha; // 0x854(0x04)
	float FP_HasAdjustableSightAlphaTimesIsAdsAlpha; // 0x858(0x04)
	bool bProneMoveBobbing; // 0x85c(0x01)
	bool bLeftHandIkOut1P; // 0x85d(0x01)
	bool bSwitchedProne; // 0x85e(0x01)
	bool bLastProneStance; // 0x85f(0x01)
	float MoveDeviationFactor; // 0x860(0x04)
	float ShotDeviationFactor; // 0x864(0x04)
	char pad_868[0x8]; // 0x868(0x08)
	struct FVector4 FinalDeviation; // 0x870(0x10)
	struct FVector2D DeviationVisuFbZY; // 0x880(0x08)
	struct FRotator AddRotGoingShot; // 0x888(0x0c)
	float RecoilReleaseInterpSpeed; // 0x894(0x04)
	float RecoilWeaponLimit; // 0x898(0x04)
	float MoveRecoilFactor; // 0x89c(0x04)
	float RecoilCanRelease; // 0x8a0(0x04)
	struct FVector FinalRecoilSigma; // 0x8a4(0x0c)
	struct FVector FinalRecoilMean; // 0x8b0(0x0c)
	float MoveSwayFactor; // 0x8bc(0x04)
	float CustomSwayMin; // 0x8c0(0x04)
	struct FVector2D SwayZY; // 0x8c4(0x08)
	float StrafeSpringFactor; // 0x8cc(0x04)
	struct FRotator LastKnownRot1; // 0x8d0(0x0c)
	struct FVector CtrlRotVectorDeltaSpring; // 0x8dc(0x0c)
	struct FRotator LastKnownRot2; // 0x8e8(0x0c)
	float CtrlRotDeltaSpringLerpAlpha; // 0x8f4(0x04)
	float WeaponSpringTurnSpeedToFullIntensity; // 0x8f8(0x04)
	struct FRotator StrafeSpringRotator; // 0x8fc(0x0c)
	struct FVector StrafeSpringVector; // 0x908(0x0c)
	struct FRotator AdsStrafeSpringRotator; // 0x914(0x0c)
	float CustomNotIsAds; // 0x920(0x04)
	char pad_924[0x4]; // 0x924(0x04)
	struct UCameraShake* FireShake; // 0x928(0x08)
	int WeaponSpringSide; // 0x930(0x04)
	float WeaponSpringStiffness; // 0x934(0x04)
	float WeaponSpringCriticalDampingFactor; // 0x938(0x04)
	float WeaponSpringMass; // 0x93c(0x04)
	float WeaponSpringFactor; // 0x940(0x04)
	float WeaponMeshSpringLocDelayFactor; // 0x944(0x04)
	float WeaponSpringClamp; // 0x948(0x04)
	float WeaponMeshSpringRotDelayFactor; // 0x94c(0x04)
	float AddMoveDeviation; // 0x950(0x04)
	float MoveDeviationFactorRelease; // 0x954(0x04)
	float MaxMoveDeviationFactor; // 0x958(0x04)
	float MinMoveDeviationFactor; // 0x95c(0x04)
	float FullStaminaDeviationFactor; // 0x960(0x04)
	float LowStaminaDeviationFactor; // 0x964(0x04)
	float AddShotDeviationFactor; // 0x968(0x04)
	float AddShotDeviationFactorAds; // 0x96c(0x04)
	float ShotDeviationFactorRelease; // 0x970(0x04)
	float MinShotDeviationFactor; // 0x974(0x04)
	float MaxShotDeviationFactor; // 0x978(0x04)
	float DeviationVisuFbInterpSpeed_YZ; // 0x97c(0x04)
	float DeviationVisuFbMax; // 0x980(0x04)
	float DeviationVisuFbInterpSpeed_Final; // 0x984(0x04)
	float MinBipodAdsDeviation; // 0x988(0x04)
	float MinBipodDeviation; // 0x98c(0x04)
	float MinProneAdsDeviation; // 0x990(0x04)
	float MinProneDeviation; // 0x994(0x04)
	float MinCrouchAdsDeviation; // 0x998(0x04)
	float MinCrouchDeviation; // 0x99c(0x04)
	float MinStandAdsDeviation; // 0x9a0(0x04)
	float MinStandDeviation; // 0x9a4(0x04)
	float MinProneTransitionDeviation; // 0x9a8(0x04)
	float MaxMoveRecoilFactor; // 0x9ac(0x04)
	float AddMoveRecoil; // 0x9b0(0x04)
	float MinMoveRecoilFactor; // 0x9b4(0x04)
	float MoveRecoilFactorRelease; // 0x9b8(0x04)
	float FullStaminaRecoilFactor; // 0x9bc(0x04)
	float LowStaminaRecoilFactor; // 0x9c0(0x04)
	float RecoilCameraOffsetFactor; // 0x9c4(0x04)
	float RecoilLofCameraOffsetLimit; // 0x9c8(0x04)
	float RecoilLofAttackInterpSpeed; // 0x9cc(0x04)
	float RecoilCanReleaseInterpSpeed; // 0x9d0(0x04)
	float RecoilCameraOffsetInterpSpeed; // 0x9d4(0x04)
	float RecoilLofReleaseInterpSpeed; // 0x9d8(0x04)
	float WeapRecoilRelLocFactor; // 0x9dc(0x04)
	float RecoilCameraShotInterpSpeed; // 0x9e0(0x04)
	float RecoilAdsCameraShotInterpSpeed; // 0x9e4(0x04)
	struct FVector ProneAdsRecoilMean; // 0x9e8(0x0c)
	struct FVector ProneAdsRecoilSigma; // 0x9f4(0x0c)
	struct FVector ProneRecoilMean; // 0xa00(0x0c)
	struct FVector ProneRecoilSigma; // 0xa0c(0x0c)
	struct FVector CrouchAdsRecoilMean; // 0xa18(0x0c)
	struct FVector CrouchAdsRecoilSigma; // 0xa24(0x0c)
	struct FVector CrouchRecoilMean; // 0xa30(0x0c)
	struct FVector CrouchRecoilSigma; // 0xa3c(0x0c)
	struct FVector StandAdsRecoilMean; // 0xa48(0x0c)
	struct FVector StandAdsRecoilSigma; // 0xa54(0x0c)
	struct FVector StandRecoilMean; // 0xa60(0x0c)
	struct FVector StandRecoilSigma; // 0xa6c(0x0c)
	struct FVector ProneTransitionRecoilMean; // 0xa78(0x0c)
	struct FVector ProneTransitionRecoilSigma; // 0xa84(0x0c)
	struct FVector BipodAdsRecoilMean; // 0xa90(0x0c)
	struct FVector BipodAdsRecoilSigma; // 0xa9c(0x0c)
	struct FVector BipodRecoilMean; // 0xaa8(0x0c)
	struct FVector BipodRecoilSigma; // 0xab4(0x0c)
	float FullStaminaSwayFactor; // 0xac0(0x04)
	float LowStaminaSwayFactor; // 0xac4(0x04)
	float AddMoveSway; // 0xac8(0x04)
	float MaxMoveSwayFactor; // 0xacc(0x04)
	float MinMoveSwayFactor; // 0xad0(0x04)
	float MoveSwayFactorRelease; // 0xad4(0x04)
	float SwayInterpSpeed_YZ; // 0xad8(0x04)
	float SwayInterpSpeed_Final; // 0xadc(0x04)
	float ProneAdsSwayMin; // 0xae0(0x04)
	float ProneSwayMin; // 0xae4(0x04)
	float CrouchAdsSwayMin; // 0xae8(0x04)
	float CrouchSwayMin; // 0xaec(0x04)
	float StandAdsSwayMin; // 0xaf0(0x04)
	float StandSwayMin; // 0xaf4(0x04)
	float ProneTransitionSwayMin; // 0xaf8(0x04)
	float HoldingBreathSwayFactor; // 0xafc(0x04)
	float CustomSpeed; // 0xb00(0x04)
	char pad_B04[0x4]; // 0xb04(0x04)
	struct USQSuppressionInfo* LastSuppressionInfoClass; // 0xb08(0x08)
	char pad_B10[0x3c]; // 0xb10(0x3c)
	struct FRotator SmoothFinalLofSuppressRotation; // 0xb4c(0x0c)
	char pad_B58[0x4]; // 0xb58(0x04)
	float LofSuppressRotationAlpha; // 0xb5c(0x04)
	char pad_B60[0x10]; // 0xb60(0x10)
	bool bWasCrouchedBeforeProne; // 0xb70(0x01)
	char pad_B71[0x3]; // 0xb71(0x03)
	struct FVector CustomCurrentFloorNormal1; // 0xb74(0x0c)
	float FP_SprintBlendAlpha; // 0xb80(0x04)
	bool bIsSprint1pLoopSection; // 0xb84(0x01)
	char pad_B85[0x3]; // 0xb85(0x03)
	struct UAnimSequence* SprintStaticPose; // 0xb88(0x08)
	char pad_B90[0x20]; // 0xb90(0x20)
	struct UAnimMontage* BobbingMove1pMontage; // 0xbb0(0x08)
	struct UAnimMontage* BobbingSprint1pMontage; // 0xbb8(0x08)
	char pad_BC0[0x20]; // 0xbc0(0x20)

	void UpdateWasCrouchedBeforeProne(); // Function Squad.SQAnimInstanceSoldier1P.UpdateWasCrouchedBeforeProne // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bca0
	void UpdateTurnSpring(); // Function Squad.SQAnimInstanceSoldier1P.UpdateTurnSpring // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bb80
	void UpdateSwitchedProne(); // Function Squad.SQAnimInstanceSoldier1P.UpdateSwitchedProne // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bb60
	void UpdateSway(); // Function Squad.SQAnimInstanceSoldier1P.UpdateSway // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bb40
	void UpdateStrafeSpring(); // Function Squad.SQAnimInstanceSoldier1P.UpdateStrafeSpring // (Final|Native|Protected|BlueprintCallable) // @ game+0x82bb20
	void UpdateSprintSpeedBlend(); // Function Squad.SQAnimInstanceSoldier1P.UpdateSprintSpeedBlend // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b9f0
	void UpdateRecoilAndFire(); // Function Squad.SQAnimInstanceSoldier1P.UpdateRecoilAndFire // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b9d0
	void UpdatePitch(); // Function Squad.SQAnimInstanceSoldier1P.UpdatePitch // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b9b0
	void UpdateLofSuppression(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier1P.UpdateLofSuppression // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b930
	void UpdateIsFallingPlayRate(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier1P.UpdateIsFallingPlayRate // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b890
	void UpdateFastPath(); // Function Squad.SQAnimInstanceSoldier1P.UpdateFastPath // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b7f0
	void UpdateDeviationVisuFb(); // Function Squad.SQAnimInstanceSoldier1P.UpdateDeviationVisuFb // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b7b0
	void UpdateDeviation(); // Function Squad.SQAnimInstanceSoldier1P.UpdateDeviation // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b790
	void UpdateBobbingsPlayrate(float DeltaSeconds); // Function Squad.SQAnimInstanceSoldier1P.UpdateBobbingsPlayrate // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b6f0
	void UpdateAccuracyParameters(); // Function Squad.SQAnimInstanceSoldier1P.UpdateAccuracyParameters // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b6d0
	void Update1pCurrentFloor(); // Function Squad.SQAnimInstanceSoldier1P.Update1pCurrentFloor // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b6b0
	void LineOfFire(); // Function Squad.SQAnimInstanceSoldier1P.LineOfFire // (Final|Native|Protected|BlueprintCallable) // @ game+0x82b0c0
};

// Class Squad.SQAnimInstanceSoldier3P
// Size: 0xce0 (Inherited: 0x420)
struct USQAnimInstanceSoldier3P : USQAnimInstanceSoldier {
	bool bVaulting; // 0x420(0x01)
	bool bClimbing; // 0x421(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtOne__Jump_3P__JumpEnd__rifle_stand_jumpendOrIsProne; // 0x422(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtOne__Jump_3P__JumpStart__rifle_stand_jumpstart; // 0x423(0x01)
	bool bAssetPlayerTime__GTEPtOne__Jump_3P__JumpStart__rifle_stand_jumpstart; // 0x424(0x01)
	char pad_425[0x7b]; // 0x425(0x7b)
	bool bStateWeight__GTEOne__Stand3P__Jog; // 0x4a0(0x01)
	char pad_4A1[0x3]; // 0x4a1(0x03)
	float StateWeight__Stand3P__Jog; // 0x4a4(0x04)
	bool bStateWeight__GTEOne__Stand3P__Sprint; // 0x4a8(0x01)
	char pad_4A9[0x3]; // 0x4a9(0x03)
	float StateWeight__Stand3P__Sprint; // 0x4ac(0x04)
	float StateWeight__Stand3P__SprintStop; // 0x4b0(0x04)
	bool bRelevantAnimTimeRemaining__LTEOne__Stand3P__SprintStop; // 0x4b4(0x01)
	char pad_4B5[0x77]; // 0x4b5(0x77)
	bool bStateWeight__GTEOne__Stand_NeutralStates__Neutral; // 0x52c(0x01)
	bool bStateWeight__GTEOne__Stand_NeutralStates__TurnLeft_91; // 0x52d(0x01)
	bool bStateWeight__GTEOne__Stand_NeutralStates__TurnRight_91; // 0x52e(0x01)
	bool bRelevantAnimTimeRemaining__LTEZero__Stand_NeutralStates__TurnLeft_91; // 0x52f(0x01)
	bool bRelevantAnimTimeRemaining__LTEZero__Stand_NeutralStates__TurnRight_91; // 0x530(0x01)
	char pad_531[0x93]; // 0x531(0x93)
	float StateWeight__Crouch3P__Sprint; // 0x5c4(0x04)
	float StateWeight__Crouch3P__Walk; // 0x5c8(0x04)
	char pad_5CC[0x3a]; // 0x5cc(0x3a)
	bool bStateWeight__GTEOne__Crouch_NeutralStates__Neutral; // 0x606(0x01)
	bool bStateWeight__GTEOne__Crouch_NeutralStates__TurnLeft_91; // 0x607(0x01)
	bool bStateWeight__GTEOne__Crouch_NeutralStates__TurnRight_91; // 0x608(0x01)
	char pad_609[0x77]; // 0x609(0x77)
	float StateWeight__Prone3P__ProneMove; // 0x680(0x04)
	char pad_684[0x1d]; // 0x684(0x1d)
	bool bStateWeight__GTEOne__Prone_NeutralStates__Neutral; // 0x6a1(0x01)
	bool bStateWeight__GTEOne__Prone_NeutralStates__TurnLeft_46; // 0x6a2(0x01)
	bool bStateWeight__GTEOne__Prone_NeutralStates__TurnRight_46; // 0x6a3(0x01)
	char pad_6A4[0x57]; // 0x6a4(0x57)
	bool bStateWeight__GTEOne__SoldierMovements__Stand; // 0x6fb(0x01)
	bool bStateWeight__GTEOne__SoldierMovements__Crouch; // 0x6fc(0x01)
	bool bStateWeight__GTEOne__SoldierMovements__Stand2Crouch; // 0x6fd(0x01)
	char pad_6FE[0x2]; // 0x6fe(0x02)
	float StateWeight__SoldierMovements__Stand2Prone; // 0x700(0x04)
	float StateWeight__SoldierMovements__Sprint2Prone; // 0x704(0x04)
	float StateWeight__SoldierMovements__Prone2Stand; // 0x708(0x04)
	float StateWeight__SoldierMovements__Crouch2Prone; // 0x70c(0x04)
	float StateWeight__SoldierMovements__Prone2Crouch; // 0x710(0x04)
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Stand2Prone__rifle_stand2prone; // 0x714(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtTwo__SoldierMovements__Sprint2Prone__rifle_sprint2prone; // 0x715(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Prone2Stand__rifle_prone2stand; // 0x716(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Crouch2Prone__rifle_crouch2prone; // 0x717(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Prone2Crouch__rifle_prone2crouch; // 0x718(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtOne__SoldierMovements__Stand2Crouch__Stand2Crouch; // 0x719(0x01)
	bool bAssetPlayerTimeFromEnd__LTEPtOne__SoldierMovements__Crouch2Stand__Crouch2Stand; // 0x71a(0x01)
	char pad_71B[0x1e2]; // 0x71b(0x1e2)
	bool bIsSprinting; // 0x8fd(0x01)
	char pad_8FE[0x2]; // 0x8fe(0x02)
	float CustomNotIsFallingAlpha; // 0x900(0x04)
	char pad_904[0x4]; // 0x904(0x04)
	struct UBlendSpace1D* BS1D_3pStandSprintType; // 0x908(0x08)
	struct UAnimSequence* SprintStop3p; // 0x910(0x08)
	struct UBlendSpace1D* BS1D_3pCrouchSprintType; // 0x918(0x08)
	struct UBlendSpace* BS_3pStandJogType; // 0x920(0x08)
	struct UBlendSpace* BS_3pStandWalkType; // 0x928(0x08)
	struct UBlendSpace* BS_3pCrouchWalkType; // 0x930(0x08)
	struct UBlendSpace1D* BS1D_3pProneCrawlType; // 0x938(0x08)
	struct UAnimSequence* StandStopMove; // 0x940(0x08)
	struct UAnimSequence* CrouchStopMove; // 0x948(0x08)
	struct UAnimSequence* StandLeanLeftShuffle; // 0x950(0x08)
	struct UAnimSequence* StandLeanRightShuffle; // 0x958(0x08)
	struct UAnimSequence* CrouchLeanLeftShuffle; // 0x960(0x08)
	struct UAnimSequence* CrouchLeanRightShuffle; // 0x968(0x08)
	struct UBlendSpace1D* AO1D_StandPitch; // 0x970(0x08)
	struct UBlendSpace1D* AO1D_CrouchPitch; // 0x978(0x08)
	struct UBlendSpace1D* AO1D_PronePitch; // 0x980(0x08)
	struct UBlendSpace* AO_BipodStandCrouchPitch; // 0x988(0x08)
	struct UAnimSequence* AO1D_StandYawSF; // 0x990(0x08)
	struct UAnimSequence* AO1D_CrouchYawSF; // 0x998(0x08)
	struct UAnimSequence* AO1D_ProneYawSF; // 0x9a0(0x08)
	struct UAnimSequence* StandTurnRight; // 0x9a8(0x08)
	struct UAnimSequence* StandTurnLeft; // 0x9b0(0x08)
	struct UAnimSequence* CrouchTurnLeft; // 0x9b8(0x08)
	struct UAnimSequence* CrouchTurnRight; // 0x9c0(0x08)
	struct UAnimSequence* ProneTurnRight; // 0x9c8(0x08)
	struct UAnimSequence* ProneTurnLeft; // 0x9d0(0x08)
	struct UAnimSequence* SprintToProne3p; // 0x9d8(0x08)
	struct UAnimSequence* StandToProne3p; // 0x9e0(0x08)
	struct UAnimSequence* ProneToStand3p; // 0x9e8(0x08)
	struct UAnimSequence* CrouchToProne3p; // 0x9f0(0x08)
	struct UAnimSequence* ProneToCrouch3p; // 0x9f8(0x08)
	struct FVector FpvLowerRootBoneOffset; // 0xa00(0x0c)
	float CustomSpeedMin40; // 0xa0c(0x04)
	float ProneStopMoveAlpha; // 0xa10(0x04)
	float CrouchStopMoveAlpha; // 0xa14(0x04)
	bool bFP_HighestClimbAnim; // 0xa18(0x01)
	bool bFP_T_Jump_3PJumpStartToJumpEnd; // 0xa19(0x01)
	bool bFP_T_Stand3PSprintStopToJog; // 0xa1a(0x01)
	bool bFP_T_Stand3PSprintToSprintStop; // 0xa1b(0x01)
	bool bFP_T_Stand3PJogToSprint; // 0xa1c(0x01)
	bool bFP_T_Stand_NeutralStatesTurnRight_90ToTurnLeft_91; // 0xa1d(0x01)
	bool bFP_T_Stand_NeutralStatesTurnLeft_90ToTurnRight_91; // 0xa1e(0x01)
	bool bFP_T_Stand_NeutralStatesNeutralToTurnLeft_91; // 0xa1f(0x01)
	bool bFP_T_Stand_NeutralStatesNeutralToTurnRight_91; // 0xa20(0x01)
	bool bFP_T_Crouch_NeutralStatesTurnRight_90ToNeutral; // 0xa21(0x01)
	bool bFP_T_Crouch_NeutralStatesTurnRight_90ToTurnLeft_91; // 0xa22(0x01)
	bool bFP_T_Crouch_NeutralStatesTurnLeft_90ToNeutral; // 0xa23(0x01)
	bool bFP_T_Crouch_NeutralStatesTurnLeft_90ToTurnRight_91; // 0xa24(0x01)
	bool bFP_T_Crouch_NeutralStatesNeutralToTurnLeft_91; // 0xa25(0x01)
	bool bFP_T_Crouch_NeutralStatesNeutralToTurnRight_91; // 0xa26(0x01)
	bool bFP_T_Prone_NeutralStatesTurnLeft_45ToNeutral; // 0xa27(0x01)
	bool bFP_T_Prone_NeutralStatesTurnLeft_45ToTurnRight_46; // 0xa28(0x01)
	bool bFP_T_Prone_NeutralStatesTurnRight_45ToNeutral; // 0xa29(0x01)
	bool bFP_T_Prone_NeutralStatesTurnRight_45ToTurnLeft_46; // 0xa2a(0x01)
	bool bFP_T_Prone_NeutralStatesNeutralToTurnLeft_46; // 0xa2b(0x01)
	bool bFP_T_Prone_NeutralStatesNeutralToTurnRight_46; // 0xa2c(0x01)
	bool bFP_T_SoldierMovementsCrouch2StandToStand; // 0xa2d(0x01)
	bool bFP_T_SoldierMovementsStand2CrouchToCrouch2Prone; // 0xa2e(0x01)
	bool bFP_T_SoldierMovementsStand2CrouchToCrouch; // 0xa2f(0x01)
	bool bFP_T_SoldierMovementsCrouchToCrouch2Prone; // 0xa30(0x01)
	bool bFP_T_SoldierMovements_StandToCrouch; // 0xa31(0x01)
	bool bFP_T_SoldierMovementsStandToStand2Prone; // 0xa32(0x01)
	bool bFP_T_SoldierMovementsStandToStand2Crouch; // 0xa33(0x01)
	bool bFP_T_SoldierMovementsStandToSprint2Prone; // 0xa34(0x01)
	char pad_A35[0x3]; // 0xa35(0x03)
	struct FRotator FP_FloorAlignedRotationRightFoot; // 0xa38(0x0c)
	struct FRotator FP_FloorAlignedRotationLeftFoot; // 0xa44(0x0c)
	struct FRotator FP_FloorAlignedRotationFeetRoot; // 0xa50(0x0c)
	struct FRotator FP_FloorAlignedRotationFeetRootReverse; // 0xa5c(0x0c)
	struct FVector FP_IKFeetRootTranslation; // 0xa68(0x0c)
	float FP_IsNotFirstPersonVisibilityAlpha; // 0xa74(0x04)
	float FP_StandIdleAlpha; // 0xa78(0x04)
	float FP_CrouchProneIdleAlpha; // 0xa7c(0x04)
	bool bFP_IsStanding; // 0xa80(0x01)
	bool bFP_IsStandingStill; // 0xa81(0x01)
	bool bFP_CanCrouchToStandingStill; // 0xa82(0x01)
	bool bFP_CanCrouchToStandMoving; // 0xa83(0x01)
	bool bFP_IsCrouchedInPlace; // 0xa84(0x01)
	char pad_A85[0x3]; // 0xa85(0x03)
	float FP_AimOffsetProneYawFrameTime; // 0xa88(0x04)
	float FP_AimOffsetYawNegative; // 0xa8c(0x04)
	float FP_AimOffsetProneTurnRightYawFrameTime; // 0xa90(0x04)
	float FP_AimOffsetTurnRightYawNegative; // 0xa94(0x04)
	float FP_AimOffsetProneTurnLeftYawFrameTime; // 0xa98(0x04)
	float FP_AimOffsetTurnLeftYawNegative; // 0xa9c(0x04)
	float FP_ProneWalkPlayRate; // 0xaa0(0x04)
	bool bFP_IsMoving; // 0xaa4(0x01)
	bool bFP_IsNotMoving; // 0xaa5(0x01)
	char pad_AA6[0x2]; // 0xaa6(0x02)
	struct FRotator FP_FloorAlignedRotationBody; // 0xaa8(0x0c)
	struct FRotator FP_FloorAlignedRotationBodyReverse; // 0xab4(0x0c)
	float FP_CustomSpeedMin40NormalizedToRange; // 0xac0(0x04)
	bool bFP_IsProneAndNotDeployBipod; // 0xac4(0x01)
	bool bFP_IsClimbingOrVaulting; // 0xac5(0x01)
	char pad_AC6[0x2]; // 0xac6(0x02)
	struct FRotator FP_FreeLook3PHeadRotation; // 0xac8(0x0c)
	float FP_BipodCrouchStanceAlpha; // 0xad4(0x04)
	float FP_BipodStandCrouchAimPitchAlpha; // 0xad8(0x04)
	char pad_ADC[0x4]; // 0xadc(0x04)
	float FP_BipodProneStanceAlpha; // 0xae0(0x04)
	float FP_BipodAimOffsetAlpha; // 0xae4(0x04)
	float FP_BipodWeaponPosCoveredPoseAlphaDependingOnSkelMeshOffset; // 0xae8(0x04)
	float FP_BipodCoveredPoseBlendAlpha; // 0xaec(0x04)
	struct FVector FP_BipodHighPitchCoveredPoseWeaponPositionOffset; // 0xaf0(0x0c)
	struct FVector FP_BipodDynamicBodyOffset; // 0xafc(0x0c)
	float FP_AimOffsetCrouchYawFrameTime; // 0xb08(0x04)
	float FP_AimOffsetTurnLeftYawPlayRate; // 0xb0c(0x04)
	float FP_AimOffsetTurnLeftProneYawPlayRate; // 0xb10(0x04)
	float FP_AimOffsetTurnLeftYawFrameTime; // 0xb14(0x04)
	float FP_AimOffsetTurnRightYawPlayRate; // 0xb18(0x04)
	float FP_AimOffsetTurnRightProneYawPlayRate; // 0xb1c(0x04)
	float FP_AimOffsetTurnRightYawFrameTime; // 0xb20(0x04)
	float FP_StandStopMoveAlpha; // 0xb24(0x04)
	float FP_AimYawFrameTime2; // 0xb28(0x04)
	float FP_CrouchWalkPlayRate; // 0xb2c(0x04)
	float FP_AimYawJogFrameTime; // 0xb30(0x04)
	float FP_AimPitchJogAlpha; // 0xb34(0x04)
	float FP_JogPlayRate; // 0xb38(0x04)
	float FP_SprintStopAlpha; // 0xb3c(0x04)
	bool bFP_Stand3PNeutralToJogRule; // 0xb40(0x01)
	bool bFP_Stand3PJogToNeutralRule; // 0xb41(0x01)
	bool bFP_Stand3PSprintToNeutralRule; // 0xb42(0x01)
	char pad_B43[0x1]; // 0xb43(0x01)
	float FP_AimOffsetStandYawFrameTime; // 0xb44(0x04)
	float FP_JumpEndAlpha; // 0xb48(0x04)
	bool bFP_IsFallingAndNotJumping; // 0xb4c(0x01)
	char pad_B4D[0x3]; // 0xb4d(0x03)
	float FP_Final3PLeftHandIKOutAlpha; // 0xb50(0x04)
	bool bFP_AOStandToConduit; // 0xb54(0x01)
	bool bFP_AOStandSprintJog; // 0xb55(0x01)
	bool bFP_AOCrouchToConduit; // 0xb56(0x01)
	bool bFP_AOProneToConduit; // 0xb57(0x01)
	bool bFP_AOConduitToCrouch; // 0xb58(0x01)
	char pad_B59[0x3]; // 0xb59(0x03)
	float FP_BS_StandSprintSpeed; // 0xb5c(0x04)
	struct FRotator FP_SprintHeadDirection; // 0xb60(0x0c)
	float FP_SprintRootDirection; // 0xb6c(0x04)
	float FP_BS_CrouchSprintSpeed; // 0xb70(0x04)
	bool bFP_LeanHeadWhenADSAndADS; // 0xb74(0x01)
	bool bFinal3pLeftHandIkOut; // 0xb75(0x01)
	char pad_B76[0x2]; // 0xb76(0x02)
	float CustomWeapActionsAndIsAds; // 0xb78(0x04)
	float FP_WalkPlayRate; // 0xb7c(0x04)
	float FP_IsNotMovingAlpha; // 0xb80(0x04)
	float FP_LeanYawOffsetFrameTime; // 0xb84(0x04)
	float FP_AlphaAbsIkFeetRootPitch; // 0xb88(0x04)
	struct FRotator RawActorRotation; // 0xb8c(0x0c)
	struct FRotator SmoothedControlRotation; // 0xb98(0x0c)
	bool bTurnNeutAoDisabled; // 0xba4(0x01)
	char pad_BA5[0x3]; // 0xba5(0x03)
	struct FRotator CachedActorYaw; // 0xba8(0x0c)
	bool bLeftHandIkOut; // 0xbb4(0x01)
	bool bJumpEndBobbing3P; // 0xbb5(0x01)
	char pad_BB6[0x2]; // 0xbb6(0x02)
	float CustomIsSprinting; // 0xbb8(0x04)
	float CustomIsAdsOrBipod; // 0xbbc(0x04)
	struct FVector SmoothVelocity; // 0xbc0(0x0c)
	float AccelRateClamp; // 0xbcc(0x04)
	struct FRotator SmoothWorldDirection; // 0xbd0(0x0c)
	struct FRotator AimRotation_3P; // 0xbdc(0x0c)
	struct FRotator AimRotation2_3P; // 0xbe8(0x0c)
	bool bTurnLeftAnim; // 0xbf4(0x01)
	bool bFullMoveAnim; // 0xbf5(0x01)
	bool bTurnRightAnim; // 0xbf6(0x01)
	bool bTurnLeft; // 0xbf7(0x01)
	bool bTurnRight; // 0xbf8(0x01)
	bool bTurnLeftProne; // 0xbf9(0x01)
	bool bTurnRightProne; // 0xbfa(0x01)
	char pad_BFB[0x1]; // 0xbfb(0x01)
	struct FRotator YawOffset; // 0xbfc(0x0c)
	struct FRotator YawOffsetDuringTurnLeft; // 0xc08(0x0c)
	struct FRotator YawOffsetDuringTurnRight; // 0xc14(0x0c)
	bool bFullSprintAnim; // 0xc20(0x01)
	char pad_C21[0x3]; // 0xc21(0x03)
	float LastSpeed; // 0xc24(0x04)
	float SprintStopCachedSpeed; // 0xc28(0x04)
	bool bCachedIsProne; // 0xc2c(0x01)
	char pad_C2D[0x3]; // 0xc2d(0x03)
	float StandStopMoveAlpha; // 0xc30(0x04)
	bool bCachedIsCrouched; // 0xc34(0x01)
	bool bCachedIsStand; // 0xc35(0x01)
	bool bProneTransAnim; // 0xc36(0x01)
	char pad_C37[0x1]; // 0xc37(0x01)
	struct FVector PmCachedCapsuleWorldLoc1; // 0xc38(0x0c)
	struct FVector EndSprintToProneCapsuleLoc; // 0xc44(0x0c)
	float Alpha; // 0xc50(0x04)
	float LastKnownHeight; // 0xc54(0x04)
	float HeightVelocity; // 0xc58(0x04)
	float LastKnownHeightVelocity; // 0xc5c(0x04)
	float BipodAimUpLimit3P; // 0xc60(0x04)
	float BipodAimDownLimit3P; // 0xc64(0x04)
	float CustomNotVaultingAlpha; // 0xc68(0x04)
	float CustomNotClimbingAlpha; // 0xc6c(0x04)
	struct FVector CurrentFloorNormalBody; // 0xc70(0x0c)
	struct FVector CurrentFloorNormalFeet; // 0xc7c(0x0c)
	struct FRotator IkFeetRootRelRot; // 0xc88(0x0c)
	struct FVector LeftFootFloorNormal; // 0xc94(0x0c)
	struct FVector RightFootFloorNormal; // 0xca0(0x0c)
	float CustomIsLoweredAndNotProne; // 0xcac(0x04)
	struct FRotator MeshRotationOffset; // 0xcb0(0x0c)
	struct FRotator CachedActorRotationNoLean; // 0xcbc(0x0c)
	float CachedLeanYawOffset; // 0xcc8(0x04)
	char pad_CCC[0x4]; // 0xccc(0x04)
	bool bLeanHeadWhenAds; // 0xcd0(0x01)
	char pad_CD1[0xf]; // 0xcd1(0x0f)

	void UpdateTurnChar(); // Function Squad.SQAnimInstanceSoldier3P.UpdateTurnChar // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c7b0
	void UpdateStopMoveAlpha(); // Function Squad.SQAnimInstanceSoldier3P.UpdateStopMoveAlpha // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c790
	void UpdateSprintStopCachedSpeed(); // Function Squad.SQAnimInstanceSoldier3P.UpdateSprintStopCachedSpeed // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c770
	void UpdateSmoothVelocity(); // Function Squad.SQAnimInstanceSoldier3P.UpdateSmoothVelocity // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c750
	void UpdateLeanYawOffset(); // Function Squad.SQAnimInstanceSoldier3P.UpdateLeanYawOffset // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c730
	void UpdateLandingVel(); // Function Squad.SQAnimInstanceSoldier3P.UpdateLandingVel // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c710
	void UpdateIkFootOrientation(); // Function Squad.SQAnimInstanceSoldier3P.UpdateIkFootOrientation // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c6f0
	void UpdateIkFeetRootRelRot(); // Function Squad.SQAnimInstanceSoldier3P.UpdateIkFeetRootRelRot // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c6d0
	void UpdateFastPathVariables(); // Function Squad.SQAnimInstanceSoldier3P.UpdateFastPathVariables // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c6b0
	void UpdateDirection(); // Function Squad.SQAnimInstanceSoldier3P.UpdateDirection // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c690
	void UpdateAimRotation(); // Function Squad.SQAnimInstanceSoldier3P.UpdateAimRotation // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c670
	void UpdateAimOffset(); // Function Squad.SQAnimInstanceSoldier3P.UpdateAimOffset // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c650
	void Update3pCurrentFloor(); // Function Squad.SQAnimInstanceSoldier3P.Update3pCurrentFloor // (Final|Native|Protected|BlueprintCallable) // @ game+0x82c630
};

// Class Squad.SQAnimNotify_EnterSeatState
// Size: 0x40 (Inherited: 0x38)
struct USQAnimNotify_EnterSeatState : UAnimNotify {
	int SeatIndex; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Squad.SQAnimNotify_MontagePause
// Size: 0x38 (Inherited: 0x38)
struct USQAnimNotify_MontagePause : UAnimNotify {
};

// Class Squad.SQAnnouncementNotifier
// Size: 0x240 (Inherited: 0x230)
struct USQAnnouncementNotifier : UUserWidget {
	struct FScriptMulticastDelegate OnAnnouncementChangedDelegate; // 0x230(0x10)

	void AnnouncementChangedHandler(); // Function Squad.SQAnnouncementNotifier.AnnouncementChangedHandler // (Final|Native|Public) // @ game+0x830ce0
};

// Class Squad.SQApprovalEntryWidget
// Size: 0x248 (Inherited: 0x230)
struct USQApprovalEntryWidget : USQUserWidget {
	struct UTextBlock* TextBlockCPP; // 0x230(0x08)
	struct UImage* IconImageCPP; // 0x238(0x08)
	struct UTextBlock* DescriptionTextCPP; // 0x240(0x08)
};

// Class Squad.SQApprovalQueueWidget
// Size: 0x2a0 (Inherited: 0x230)
struct USQApprovalQueueWidget : USQUserWidget {
	struct USQApprovalEntryWidget* ApprovalEntry; // 0x230(0x08)
	struct UScrollBox* ScrollBoxCPP; // 0x238(0x08)
	struct TMap<uint32, struct USQApprovalEntryWidget*> EntryWidgets; // 0x240(0x50)
	struct UTextBlock* ApprovalKeyTextCPP; // 0x290(0x08)
	struct UTextBlock* DisapprovalKeyTextCPP; // 0x298(0x08)

	void Init(); // Function Squad.SQApprovalQueueWidget.Init // (Final|Native|Protected|BlueprintCallable) // @ game+0x831c70
};

// Class Squad.SQArmorMeshComponent
// Size: 0x4c0 (Inherited: 0x4b0)
struct USQArmorMeshComponent : UStaticMeshComponent {
	struct TArray<struct FSQArmorInfo> ArmorInfo; // 0x4a8(0x10)
};

// Class Squad.SQAssetManager
// Size: 0x440 (Inherited: 0x438)
struct USQAssetManager : UAssetManager {
	char pad_438[0x8]; // 0x438(0x08)
};

// Class Squad.SQAudioVolume
// Size: 0x2e0 (Inherited: 0x2d8)
struct ASQAudioVolume : AAudioVolume {
	enum class ESQAudioVolumeType SquadAudioVolumeType; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
};

// Class Squad.SQAvailability
// Size: 0x50 (Inherited: 0x28)
struct USQAvailability : UObject {
	struct USQRestriction_Delay_Base* Delay; // 0x28(0x08)
	struct USQRestriction_Cost* Cost; // 0x30(0x08)
	struct USQRestriction_Count* LimitedCount; // 0x38(0x08)
	struct TArray<struct USQRestriction_Boolean*> OtherRestrictions; // 0x40(0x10)

	void UpdateTeamAvailability(struct ASQTeam* InTeam, struct FSQAvailabilityState& OutTeamStatus); // Function Squad.SQAvailability.UpdateTeamAvailability // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8337c0
	void OnTeamRemoveUsage(struct ASQTeam* InTeam, struct FSQAvailabilityState& Status); // Function Squad.SQAvailability.OnTeamRemoveUsage // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8329a0
	void OnTeamAddUsage(struct ASQTeam* InTeam, struct FSQAvailabilityState& Status); // Function Squad.SQAvailability.OnTeamAddUsage // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8328a0
	void OnPlayerRemoveUsage(struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& Status); // Function Squad.SQAvailability.OnPlayerRemoveUsage // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8327a0
	void OnPlayerAddUsage(struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& Status); // Function Squad.SQAvailability.OnPlayerAddUsage // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8326a0
	bool IsRestrictedForTeam(struct ASQTeam* InTeam, struct FDataTableRowHandle& OutRestrictionReason); // Function Squad.SQAvailability.IsRestrictedForTeam // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x832360
	bool IsRestrictedForPlayer(struct ASQPlayerController* InPlayer, struct FDataTableRowHandle& OutRestrictionReason); // Function Squad.SQAvailability.IsRestrictedForPlayer // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x832270
	void InitializeTeamAvailability(struct ASQTeam* InTeam, struct USQLayer* InActiveLayer, struct FSQAvailabilityState& OutTeamStatus); // Function Squad.SQAvailability.InitializeTeamAvailability // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x831c90
	bool HasTeamBasedCost(); // Function Squad.SQAvailability.HasTeamBasedCost // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x831c40
	bool HasPlayerBasedCost(); // Function Squad.SQAvailability.HasPlayerBasedCost // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x831ac0
	bool HasLimitedCount(); // Function Squad.SQAvailability.HasLimitedCount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x831a90
	bool HasDelay(); // Function Squad.SQAvailability.HasDelay // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x831a60
	bool HasCost(); // Function Squad.SQAvailability.HasCost // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x831a30
	void GetAvailabilityForPlayer(struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& InTeamStatus, struct FSQAvailabilityState& OutPlayerStatus); // Function Squad.SQAvailability.GetAvailabilityForPlayer // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x831340
};

// Class Squad.SQAvailability_Action
// Size: 0x58 (Inherited: 0x50)
struct USQAvailability_Action : USQAvailability {
	struct USQActionSettings* Setting; // 0x50(0x08)
};

// Class Squad.SQAvailability_Deployable
// Size: 0x58 (Inherited: 0x50)
struct USQAvailability_Deployable : USQAvailability {
	struct USQDeployableSettings* Setting; // 0x50(0x08)

	bool ShouldRefund(struct ASQPlayerController* InPlayer, struct ASQTeam* InTeam, struct ASQDeployable* InDeployable); // Function Squad.SQAvailability_Deployable.ShouldRefund // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x833590
	void ProcessRefund(struct ASQPlayerController* InPlayer, struct ASQTeam* InTeam, struct ASQDeployable* InDeployable); // Function Squad.SQAvailability_Deployable.ProcessRefund // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x832b80
	int GetRefundPercentage(); // Function Squad.SQAvailability_Deployable.GetRefundPercentage // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x12b8b50
};

// Class Squad.SQAvailability_Role
// Size: 0x58 (Inherited: 0x50)
struct USQAvailability_Role : USQAvailability {
	struct USQRoleSettings* Setting; // 0x50(0x08)

	void ProcessRearmCost(struct ASQPlayerController* InPlayer, struct TScriptInterface<Class>& InRearmSource); // Function Squad.SQAvailability_Role.ProcessRearmCost // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x832aa0
	bool HasSameCountLimit(struct USQAvailability_Role* Other); // Function Squad.SQAvailability_Role.HasSameCountLimit // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x831bb0
	int GetRearmRefundPercentage(); // Function Squad.SQAvailability_Role.GetRearmRefundPercentage // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x12b8b50
	float GetRearmOperationCost(struct ASQPlayerController* InPlayer, struct TScriptInterface<Class>& InRearmSource); // Function Squad.SQAvailability_Role.GetRearmOperationCost // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x8317c0
	struct FDataTableRowHandle GetInsufficientAmmoReamFailureReason(); // Function Squad.SQAvailability_Role.GetInsufficientAmmoReamFailureReason // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x12b8b50
	void GetAvailabilityForPlayerRearm(struct ASQPlayerController* InPlayer, struct TScriptInterface<Class>& InRearmSource, struct FSQAvailabilityState_Role& InOutRearmStatus, float& OutCost); // Function Squad.SQAvailability_Role.GetAvailabilityForPlayerRearm // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x8314d0
	bool CanRearm(struct ASQPlayerController* InPlayer, struct TScriptInterface<Class>& InRearmSource, float& OutCost, struct FDataTableRowHandle& OutRestrictionReason); // Function Squad.SQAvailability_Role.CanRearm // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x830d00
};

// Class Squad.SQAvailability_Vehicle
// Size: 0x58 (Inherited: 0x50)
struct USQAvailability_Vehicle : USQAvailability {
	struct USQVehicleSettings* Setting; // 0x50(0x08)
};

// Class Squad.SQAvailabilityHelper
// Size: 0x28 (Inherited: 0x28)
struct USQAvailabilityHelper : UBlueprintFunctionLibrary {

	void UpdateNextAvailabilityTime(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState); // Function Squad.SQAvailabilityHelper.UpdateNextAvailabilityTime // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x833690
	void SetUsage(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, int Usage); // Function Squad.SQAvailabilityHelper.SetUsage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x833410
	void SetUnavailable(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, struct FDataTableRowHandle& InUnavailabilityReason); // Function Squad.SQAvailabilityHelper.SetUnavailable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x833280
	void SetModifierPct(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, int ModifierPercentage); // Function Squad.SQAvailabilityHelper.SetModifierPct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x833100
	void SetForceAvailable(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, bool Force); // Function Squad.SQAvailabilityHelper.SetForceAvailable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x832f80
	void SetAvailable(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, int InAvailable); // Function Squad.SQAvailabilityHelper.SetAvailable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x832e00
	void RemoveUsage(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, int RemovedUsage); // Function Squad.SQAvailabilityHelper.RemoveUsage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x832c80
	bool IsVehicleAvailableForTeam(struct FSQAvailabilityState_Vehicle& InTeamState); // Function Squad.SQAvailabilityHelper.IsVehicleAvailableForTeam // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831f70
	bool IsVehicleAvailableForPlayer(struct FSQAvailabilityState_Vehicle& InTeamState, struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& OutPlayerState); // Function Squad.SQAvailabilityHelper.IsVehicleAvailableForPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831de0
	bool IsRoleAvailableForTeam(struct FSQAvailabilityState_Role& InTeamState); // Function Squad.SQAvailabilityHelper.IsRoleAvailableForTeam // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8325e0
	bool IsRoleAvailableForPlayer(struct FSQAvailabilityState_Role& InTeamState, struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& OutPlayerState); // Function Squad.SQAvailabilityHelper.IsRoleAvailableForPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x832450
	bool IsOverCapacity(struct FSQAvailabilityState& InState); // Function Squad.SQAvailabilityHelper.IsOverCapacity // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8321b0
	bool IsInfiniteAvailability(struct FSQAvailabilityState& InState); // Function Squad.SQAvailabilityHelper.IsInfiniteAvailability // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8320f0
	bool IsDeployableAvailableForTeam(struct FSQAvailabilityState_Deployable& InTeamState); // Function Squad.SQAvailabilityHelper.IsDeployableAvailableForTeam // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831f70
	bool IsDeployableAvailableForPlayer(struct FSQAvailabilityState_Deployable& InTeamState, struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& OutPlayerState); // Function Squad.SQAvailabilityHelper.IsDeployableAvailableForPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831de0
	bool IsAvailable(struct FSQAvailabilityState& InState); // Function Squad.SQAvailabilityHelper.IsAvailable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x832030
	bool IsActionAvailableForTeam(struct FSQAvailabilityState_Action& InTeamState); // Function Squad.SQAvailabilityHelper.IsActionAvailableForTeam // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831f70
	bool IsActionAvailableForPlayer(struct FSQAvailabilityState_Action& InTeamState, struct ASQPlayerController* InPlayer, struct FSQAvailabilityState& OutPlayerState); // Function Squad.SQAvailabilityHelper.IsActionAvailableForPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831de0
	bool HasVehicleActiveTimer(struct FSQAvailabilityState_Vehicle& InState); // Function Squad.SQAvailabilityHelper.HasVehicleActiveTimer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8318b0
	bool HasRoleActiveTimer(struct FSQAvailabilityState_Role& InState); // Function Squad.SQAvailabilityHelper.HasRoleActiveTimer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831af0
	bool HasDeployableActiveTimer(struct FSQAvailabilityState_Deployable& InState); // Function Squad.SQAvailabilityHelper.HasDeployableActiveTimer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8318b0
	bool HasActiveTimer(struct FSQAvailabilityState& InState); // Function Squad.SQAvailabilityHelper.HasActiveTimer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x831970
	bool HasActionActiveTimer(struct FSQAvailabilityState_Action& InState); // Function Squad.SQAvailabilityHelper.HasActionActiveTimer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8318b0
	float GetAvailabilityPercentDelay(struct FSQAvailabilityState& InState, float TotalDelay); // Function Squad.SQAvailabilityHelper.GetAvailabilityPercentDelay // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8316a0
	struct FTimespan GetAvailabilityDelay(struct FSQAvailabilityState& InState); // Function Squad.SQAvailabilityHelper.GetAvailabilityDelay // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x831280
	int GetAvailabilityCount(struct FSQAvailabilityState& InState); // Function Squad.SQAvailabilityHelper.GetAvailabilityCount // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8311c0
	void EnQueueNextAvailabilityTime(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, struct FDateTime& InNextAvailabilityTime, struct FDataTableRowHandle& InUnavailabilityReason); // Function Squad.SQAvailabilityHelper.EnQueueNextAvailabilityTime // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x830fe0
	void ClearNextAvailabilityTime(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState); // Function Squad.SQAvailabilityHelper.ClearNextAvailabilityTime // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x830eb0
	void AddUsage(struct FSQAvailabilityState& InState, struct FSQAvailabilityState& OutState, int AddedUsage); // Function Squad.SQAvailabilityHelper.AddUsage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x830b60
};

// Class Squad.SQBaseButton
// Size: 0x2e8 (Inherited: 0x230)
struct USQBaseButton : USQUserWidget {
	bool bIsHovering; // 0x230(0x01)
	bool bIsActive; // 0x231(0x01)
	char pad_232[0x2]; // 0x232(0x02)
	float HoveringColorBlend; // 0x234(0x04)
	float HoverColorBlendSpeed; // 0x238(0x04)
	bool bIsPressing; // 0x23c(0x01)
	char pad_23D[0x3]; // 0x23d(0x03)
	float PressColorBlend; // 0x240(0x04)
	float PressColorBlendSpeed; // 0x244(0x04)
	struct UImage* ButtonImage; // 0x248(0x08)
	struct UBorder* ButtonBorder; // 0x250(0x08)
	struct UTextBlock* ButtonTextBlock; // 0x258(0x08)
	struct FSQButtonStyle SQButtonStyle; // 0x260(0x80)
	float Alpha; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)

	void UpdateActiveState(); // Function Squad.SQBaseButton.UpdateActiveState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829fd0
	void InitWidget(); // Function Squad.SQBaseButton.InitWidget // (Native|Public|BlueprintCallable) // @ game+0x829740
};

// Class Squad.SQBaseGameSubsystem
// Size: 0x40 (Inherited: 0x28)
struct USQBaseGameSubsystem : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct USQGameInstance* SQGameInstance; // 0x38(0x08)

	void TickSubsystem(float DeltaTime); // Function Squad.SQBaseGameSubsystem.TickSubsystem // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQBaseHudWidget
// Size: 0x290 (Inherited: 0x230)
struct USQBaseHudWidget : USQUserWidget {
	struct UUserWidget* StateIndicators; // 0x230(0x08)
	struct USQAmmoWidget* AmmoWidget; // 0x238(0x08)
	struct UUserWidget* SightRangeWidget; // 0x240(0x08)
	struct USQCompassMK2* CompassWidget; // 0x248(0x08)
	struct UUserWidget* CaptureZoneWidget; // 0x250(0x08)
	struct UUserWidget* FOBStatusWidget; // 0x258(0x08)
	struct UUserWidget* StaminaWidget; // 0x260(0x08)
	struct UUserWidget* VehicleHealthWidget; // 0x268(0x08)
	struct USQApprovalQueueWidget* ApprovalQueueWidget; // 0x270(0x08)
	struct USQSeatProgressWidget* SeatProgressWidget; // 0x278(0x08)
	struct USQStagingTimerText* StagingTimerText; // 0x280(0x08)
	struct UUserWidget* CenterDotWidget; // 0x288(0x08)

	void UpdateActiveState(); // Function Squad.SQBaseHudWidget.UpdateActiveState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x829fd0
	void InitWidget(); // Function Squad.SQBaseHudWidget.InitWidget // (Native|Public|BlueprintCallable) // @ game+0x829740
};

// Class Squad.SQPawnMovementComponent
// Size: 0x1f0 (Inherited: 0x160)
struct USQPawnMovementComponent : UPawnMovementComponent {
	struct FSQMovePostPhysicsTickFunction PostPhysicsTickFunction; // 0x160(0x58)
	char pad_1B8[0x28]; // 0x1b8(0x28)
	char bJustTeleported : 1; // 0x1e0(0x01)
	char bIgnoreBaseRotation : 1; // 0x1e0(0x01)
	char bUseControllerDesiredRotation : 1; // 0x1e0(0x01)
	char bOrientRotationToMovement : 1; // 0x1e0(0x01)
	char bFastAttachedMove : 1; // 0x1e0(0x01)
	char bRunPhysicsWithNoController : 1; // 0x1e0(0x01)
	char pad_1E0_6 : 2; // 0x1e0(0x01)
	char pad_1E1[0xf]; // 0x1e1(0x0f)

	struct UPrimitiveComponent* GetMovementBase(); // Function Squad.SQPawnMovementComponent.GetMovementBase // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8b8a60
};

// Class Squad.SQNetMoveComponent
// Size: 0x250 (Inherited: 0x1f0)
struct USQNetMoveComponent : USQPawnMovementComponent {
	bool bPerformMoveOnServer; // 0x1f0(0x01)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	float MaxPendingMoveDelay; // 0x1f4(0x04)
	float MaxStartLocationDifference; // 0x1f8(0x04)
	float MoveTimestampQuantum; // 0x1fc(0x04)
	bool bShouldInterpolate; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	float MinTimeBetweenTimeStampResets; // 0x204(0x04)
	float MaxSmoothNetUpdateDist; // 0x208(0x04)
	float NoSmoothNetUpdateDist; // 0x20c(0x04)
	char pad_210[0x8]; // 0x210(0x08)
	struct TArray<char> LatestPackedMove; // 0x218(0x10)
	char pad_228[0x28]; // 0x228(0x28)

	void SendPackedMoveRPC(struct TArray<char> PackedMove); // Function Squad.SQNetMoveComponent.SendPackedMoveRPC // (Net|Native|Event|Protected|NetServer|NetValidate) // @ game+0x8a3cb0
	void SendClientCorrection(struct TArray<char> PackedMove); // Function Squad.SQNetMoveComponent.SendClientCorrection // (Net|NetReliableNative|Event|Protected|NetClient|NetValidate) // @ game+0x8a3bf0
	void OnRep_LatestPackedMove(); // Function Squad.SQNetMoveComponent.OnRep_LatestPackedMove // (Native|Public) // @ game+0x8a3b20
};

// Class Squad.SQBasicMoveComponent
// Size: 0x260 (Inherited: 0x250)
struct USQBasicMoveComponent : USQNetMoveComponent {
	float MovementSpeed; // 0x250(0x04)
	char pad_254[0xc]; // 0x254(0x0c)
};

// Class Squad.SQBlastComponent
// Size: 0x250 (Inherited: 0x220)
struct USQBlastComponent : USceneComponent {
	float ConeLength; // 0x218(0x04)
	float ConeAngle; // 0x21c(0x04)
	float BlockBlastTraceOriginOffset; // 0x220(0x04)
	float MaxDamage; // 0x224(0x04)
	bool bIsDrawDebugEnabled; // 0x228(0x01)
	struct UDamageType* DamageType; // 0x230(0x08)
	float EffectsConeLength; // 0x238(0x04)
	float EffectsConeHalfAngle; // 0x23c(0x04)
	struct USQShockwave* BlastShockwave; // 0x240(0x08)
	char pad_249[0x7]; // 0x249(0x07)

	void ServerFireBlast(struct FVector BlastLocationZeroBased, struct FVector BlastAimVector); // Function Squad.SQBlastComponent.ServerFireBlast // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x83f6b0
	void FireBlast(); // Function Squad.SQBlastComponent.FireBlast // (Final|Native|Public|BlueprintCallable) // @ game+0x83aa70
};

// Class Squad.SQBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct USQBlueprintLibrary : UBlueprintFunctionLibrary {

	void UpdateTextureOnImage(struct UImage* Image, struct UTexture2DDynamic* Texture); // Function Squad.SQBlueprintLibrary.UpdateTextureOnImage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x840880
	void UpdateSpring3D(struct FSQSpringInterpStruct3D& Spring, float DeltaTime); // Function Squad.SQBlueprintLibrary.UpdateSpring3D // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x840770
	void UpdateDynamicEasing(struct FSQDynamicEasingStruct& Easing, float DeltaTime); // Function Squad.SQBlueprintLibrary.UpdateDynamicEasing // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x840680
	bool TryGetDefaultObjectFor(struct UObject* Class, struct UObject*& OutDefaultObject); // Function Squad.SQBlueprintLibrary.TryGetDefaultObjectFor // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x8405b0
	struct UAudioComponent* SpawnSoundAttachedWithParameters(struct USoundBase* Sound, struct USceneComponent* AttachToComponent, struct TArray<struct FAudioComponentParam>& AudioParameters, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, enum class EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings); // Function Squad.SQBlueprintLibrary.SpawnSoundAttachedWithParameters // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x8401c0
	struct TArray<struct FName> SortNameArray(struct TArray<struct FName>& Array); // Function Squad.SQBlueprintLibrary.SortNameArray // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8400d0
	void SetTextureRenderTarget2DSize(struct UTextureRenderTarget2D* Texture, int SizeX, int SizeY); // Function Squad.SQBlueprintLibrary.SetTextureRenderTarget2DSize // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83ffe0
	void SetSkeletalPhysMaterialOverride(struct USkeletalMeshComponent* Component, struct UPhysicalMaterial* NewPhysMaterial); // Function Squad.SQBlueprintLibrary.SetSkeletalPhysMaterialOverride // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83ff30
	void SetMousePosition(struct UObject* WorldContextObject, int X, int Y); // Function Squad.SQBlueprintLibrary.SetMousePosition // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83fe40
	void SetMobility(struct USceneComponent* Target, enum class EComponentMobility NewMobility); // Function Squad.SQBlueprintLibrary.SetMobility // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83fd90
	void SetMasterPoseComponent(struct USkeletalMeshComponent* Target, struct USkeletalMeshComponent* Master); // Function Squad.SQBlueprintLibrary.SetMasterPoseComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83fce0
	void SetDynamicEasingTarget(struct FSQDynamicEasingStruct& Easing, float NewTarget); // Function Squad.SQBlueprintLibrary.SetDynamicEasingTarget // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83fbf0
	void SetComponentTickGroup(struct UActorComponent* Target, enum class ETickingGroup NewTickGroup); // Function Squad.SQBlueprintLibrary.SetComponentTickGroup // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83fb40
	void SetActorTickGroup(struct AActor* Target, enum class ETickingGroup NewTickGroup); // Function Squad.SQBlueprintLibrary.SetActorTickGroup // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83fa90
	void SetActorHiddenInGame(struct AActor* ActorToAffect, bool bNewHidden, bool bPropagateToAttachedChildren); // Function Squad.SQBlueprintLibrary.SetActorHiddenInGame // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83f980
	void SetActorComponentStablyNamed(struct UActorComponent* ActorComponent); // Function Squad.SQBlueprintLibrary.SetActorComponentStablyNamed // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83f910
	void SetActorCollisionInGame(struct AActor* ActorToAffect, bool bNewCollisionEnabled, bool bPropagateToAttachedChildren); // Function Squad.SQBlueprintLibrary.SetActorCollisionInGame // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83f800
	bool ServerLicensingNoticeNeeded(); // Function Squad.SQBlueprintLibrary.ServerLicensingNoticeNeeded // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83f7d0
	bool ServerHealthEnabled(); // Function Squad.SQBlueprintLibrary.ServerHealthEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83f7a0
	void SaveAndForceRebuildingKeyMaps(bool bRestoreDefaults); // Function Squad.SQBlueprintLibrary.SaveAndForceRebuildingKeyMaps // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83f630
	void RebindKey(struct FName& ActionName, struct FKey& newKey, int OccuranceIndex); // Function Squad.SQBlueprintLibrary.RebindKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83f4d0
	void RebindAxisKey(struct FInputAxisKeyMapping& Mapping, struct FKey newKey); // Function Squad.SQBlueprintLibrary.RebindAxisKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83f2e0
	void PrintShotInfo(struct FSQShotInfo& Shot); // Function Squad.SQBlueprintLibrary.PrintShotInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83f130
	void PrintHitResult(struct FHitResult& Hit); // Function Squad.SQBlueprintLibrary.PrintHitResult // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83f080
	void PlaySoundAtLocationWithParameters(struct UObject* WorldContextObject, struct USoundBase* Sound, struct FVector& Location, struct TArray<struct FAudioComponentParam>& AudioParameters, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings); // Function Squad.SQBlueprintLibrary.PlaySoundAtLocationWithParameters // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x83ed60
	void PlaySound2DWithParameters(struct UObject* WorldContextObject, struct USoundBase* Sound, struct TArray<struct FAudioComponentParam>& AudioParameters, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundConcurrency* ConcurrencySettings); // Function Squad.SQBlueprintLibrary.PlaySound2DWithParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83eb20
	void PlaySoldierMovementFoleySound(struct ASQSoldier* Soldier, struct USoundBase* Sound, bool bSetSpeedParameter, bool bSetPhysMatParameter, bool bSetWaterDepthParameter, struct FVector LocationOffset, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings, enum class EAttachLocation LocationType); // Function Squad.SQBlueprintLibrary.PlaySoldierMovementFoleySound // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x83e7c0
	bool OWICoreStateVisibleDefined(); // Function Squad.SQBlueprintLibrary.OWICoreStateVisibleDefined // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e360
	bool OWICoreStateEnabledDefined(); // Function Squad.SQBlueprintLibrary.OWICoreStateEnabledDefined // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e360
	void OffsetSpring3D(struct FSQSpringInterpStruct3D& Spring, struct FVector& PosOffset); // Function Squad.SQBlueprintLibrary.OffsetSpring3D // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x83e6b0
	float NormalizeAngle(float InAngle); // Function Squad.SQBlueprintLibrary.NormalizeAngle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e630
	bool NameLexicalLess(struct FName& A, struct FName& B); // Function Squad.SQBlueprintLibrary.NameLexicalLess // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83e550
	bool ModdedServersOnTop(); // Function Squad.SQBlueprintLibrary.ModdedServersOnTop // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e520
	bool MatchWaitingToStart(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.MatchWaitingToStart // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e4a0
	bool MatchWaitingAfterCompletion(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.MatchWaitingAfterCompletion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e420
	bool MatchInProgress(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.MatchInProgress // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e3a0
	bool MapMarkersEnabledDefined(); // Function Squad.SQBlueprintLibrary.MapMarkersEnabledDefined // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e360
	bool MapIconVisibleDefined(); // Function Squad.SQBlueprintLibrary.MapIconVisibleDefined // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e380
	bool MapIconEnabledDefined(); // Function Squad.SQBlueprintLibrary.MapIconEnabledDefined // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83e360
	void LogUnusedProperties(struct UObject* Object); // Function Squad.SQBlueprintLibrary.LogUnusedProperties // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83e2f0
	void LogError(struct FString Contents); // Function Squad.SQBlueprintLibrary.LogError // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83e260
	void LoadCredits(struct TArray<struct FSQCreditsList>& OutCreditsList); // Function Squad.SQBlueprintLibrary.LoadCredits // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83e140
	bool IsValidKey(struct FKey& Key); // Function Squad.SQBlueprintLibrary.IsValidKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83e070
	bool IsUnderTerrain(struct UObject* WorldContextObject, struct FVector& StartTrace, struct AActor* InIgnoreActor, float TraceDistance, bool bTraceMustImpactAboveToBeUnderTerrain); // Function Squad.SQBlueprintLibrary.IsUnderTerrain // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x83dec0
	bool IsStandaloneOrListenServer(); // Function Squad.SQBlueprintLibrary.IsStandaloneOrListenServer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83de90
	bool IsStandalone(); // Function Squad.SQBlueprintLibrary.IsStandalone // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83de60
	bool IsSimulatingInEditor(); // Function Squad.SQBlueprintLibrary.IsSimulatingInEditor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83de30
	bool IsShippingBuild(); // Function Squad.SQBlueprintLibrary.IsShippingBuild // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83de00
	bool IsQueueEnabled(); // Function Squad.SQBlueprintLibrary.IsQueueEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83ddd0
	bool IsNearlyEqualOrLess(float A, float B, float Tolerance); // Function Squad.SQBlueprintLibrary.IsNearlyEqualOrLess // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83dcb0
	bool IsLocationWithinDistanceToLocalPlayer(enum class ESQReturnBool& Branches, struct FVector& OtherLocation, float DistanceInMeters); // Function Squad.SQBlueprintLibrary.IsLocationWithinDistanceToLocalPlayer // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x83db80
	bool IsGamepadKey(struct FKey& Key); // Function Squad.SQBlueprintLibrary.IsGamepadKey // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83dab0
	bool IsDataTableRowOfStruct(struct UDataTable* table, struct FName RowStructName); // Function Squad.SQBlueprintLibrary.IsDataTableRowOfStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d9f0
	bool IsActorWithinDistanceToLocalPlayer(enum class ESQReturnBool& Branches, struct AActor* OtherActor, float DistanceInMeters); // Function Squad.SQBlueprintLibrary.IsActorWithinDistanceToLocalPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83d8d0
	bool InMainMenu(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.InMainMenu // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d850
	float GetZoomedFOV(float MagnificationDesired, float DefaultFOV); // Function Squad.SQBlueprintLibrary.GetZoomedFOV // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d790
	struct AWorldSettings* GetWorldSettings(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.GetWorldSettings // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83d710
	struct FSQTextureMemoryStats GetTextureMemoryStats(); // Function Squad.SQBlueprintLibrary.GetTextureMemoryStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d6c0
	struct FVector2D GetTextSize(struct FSlateFontInfo& FontInfo, struct FText& Text, float ScaleUI); // Function Squad.SQBlueprintLibrary.GetTextSize // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x83d4f0
	void GetSquadPhysMat(struct UPhysicalMaterial* PhysMat, struct USQPhysicalMaterial*& SquadPhysMat); // Function Squad.SQBlueprintLibrary.GetSquadPhysMat // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83d430
	struct USQGameUserSettings* GetSquadGameUserSettings(); // Function Squad.SQBlueprintLibrary.GetSquadGameUserSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d400
	struct ASQGameSession* GetSquadGameSession(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.GetSquadGameSession // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d380
	struct USQGameInstance* GetSquadGameInstance(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.GetSquadGameInstance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d300
	struct FVector GetSpringPos3D(struct FSQSpringInterpStruct3D& Spring); // Function Squad.SQBlueprintLibrary.GetSpringPos3D // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x83d220
	void GetServerHealthValues(float& ServerHealthLow, float& ServerHealthHigh); // Function Squad.SQBlueprintLibrary.GetServerHealthValues // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83d140
	struct FSlateColor GetServerHealthSlateColor(struct UObject* WorldContextObject, int ServerHealth); // Function Squad.SQBlueprintLibrary.GetServerHealthSlateColor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83d030
	void GetPrimaryDisplaySize(int& Width, int& Height); // Function Squad.SQBlueprintLibrary.GetPrimaryDisplaySize // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83cf50
	int GetPreviousLODLevel(struct UStaticMeshComponent* Component); // Function Squad.SQBlueprintLibrary.GetPreviousLODLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83ced0
	struct TArray<struct FHitResult> GetOverlapHitInfos(struct UPrimitiveComponent* Target); // Function Squad.SQBlueprintLibrary.GetOverlapHitInfos // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83ce00
	int GetNumVertices(struct UStaticMesh* StaticMesh, int LOD); // Function Squad.SQBlueprintLibrary.GetNumVertices // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83cd40
	int GetNumTriangles(struct UStaticMesh* StaticMesh, int LOD); // Function Squad.SQBlueprintLibrary.GetNumTriangles // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83cc80
	int GetNumTexCoords(struct UStaticMesh* StaticMesh, int LOD); // Function Squad.SQBlueprintLibrary.GetNumTexCoords // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83cbc0
	int GetNumSections(struct UStaticMesh* StaticMesh, int LOD); // Function Squad.SQBlueprintLibrary.GetNumSections // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83cb00
	struct FString GetNetMode(); // Function Squad.SQBlueprintLibrary.GetNetMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83ca70
	struct FString GetNatoPhoneticString(int Index); // Function Squad.SQBlueprintLibrary.GetNatoPhoneticString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83c9a0
	struct FString GetMajorMinorVersion(struct FString RawVersion); // Function Squad.SQBlueprintLibrary.GetMajorMinorVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83c870
	float GetLastRenderTime(struct UPrimitiveComponent* Component); // Function Squad.SQBlueprintLibrary.GetLastRenderTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83c7e0
	struct FText GetKeysMappedToActionText(struct FName& ActionName); // Function Squad.SQBlueprintLibrary.GetKeysMappedToActionText // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83c6e0
	void GetKeysMappedToAction(struct FName& ActionName, struct TArray<struct FKey>& Keys); // Function Squad.SQBlueprintLibrary.GetKeysMappedToAction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83c590
	void GetKeysMapedToAxis(struct FName& AxisName, bool negative, struct TArray<struct FInputAxisKeyMapping>& Keys); // Function Squad.SQBlueprintLibrary.GetKeysMapedToAxis // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83c400
	void GetKeyName(struct FKey& Key, struct FName& OutName); // Function Squad.SQBlueprintLibrary.GetKeyName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83c2e0
	int GetKeyFromValue(struct TMap<int, int> Map, int Value); // Function Squad.SQBlueprintLibrary.GetKeyFromValue // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83c160
	void GetKeyDisplayName(struct FKey& Key, struct FText& OutDisplayName); // Function Squad.SQBlueprintLibrary.GetKeyDisplayName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83c000
	int GetIntFromPhysMat(struct UPhysicalMaterial* PhysMat); // Function Squad.SQBlueprintLibrary.GetIntFromPhysMat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83bf80
	int GetIntFromFName(struct FName& Name); // Function Squad.SQBlueprintLibrary.GetIntFromFName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83bef0
	void GetGameVersionInfo(struct FString& Variant, int& Major, int& Minor, int& Build, int& Revision); // Function Squad.SQBlueprintLibrary.GetGameVersionInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83bd00
	struct FString GetGameVersion(); // Function Squad.SQBlueprintLibrary.GetGameVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83bc70
	float GetDynamicEasingPosition(struct FSQDynamicEasingStruct& Easing); // Function Squad.SQBlueprintLibrary.GetDynamicEasingPosition // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83bbc0
	struct UObject* GetDefaultObjectFor(struct UObject* Class); // Function Squad.SQBlueprintLibrary.GetDefaultObjectFor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83bb40
	int GetCustomServerSettingAsInt(struct FString PropertyName, int DefaultValue); // Function Squad.SQBlueprintLibrary.GetCustomServerSettingAsInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83ba60
	float GetCustomServerSettingAsFloat(struct FString PropertyName, float DefaultValue); // Function Squad.SQBlueprintLibrary.GetCustomServerSettingAsFloat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b970
	bool GetCustomServerSettingAsBool(struct FString PropertyName, bool DefaultValue); // Function Squad.SQBlueprintLibrary.GetCustomServerSettingAsBool // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b890
	void GetCustomServerSetting(struct FString PropertyName, struct FString DefaultValue, struct FString& OutResult); // Function Squad.SQBlueprintLibrary.GetCustomServerSetting // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83b740
	struct FString GetCurrentMapName(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.GetCurrentMapName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b670
	void GetComponentTransform(struct USceneComponent* Component, struct FTransform& OutTransform); // Function Squad.SQBlueprintLibrary.GetComponentTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x83b560
	void GetCanvasSize(struct UCanvas* Canvas, int& SizeX, int& SizeY); // Function Squad.SQBlueprintLibrary.GetCanvasSize // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83b440
	struct TArray<struct FAudioComponentParam> GetAudioComponentParamsArrayFromPhysMat(struct UPhysicalMaterial* PhysMat); // Function Squad.SQBlueprintLibrary.GetAudioComponentParamsArrayFromPhysMat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b370
	struct FAudioComponentParam GetAudioComponentParamFromPhysMat(struct UPhysicalMaterial* PhysMat); // Function Squad.SQBlueprintLibrary.GetAudioComponentParamFromPhysMat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b2e0
	struct FSQAnnouncement GetAnnouncement(); // Function Squad.SQBlueprintLibrary.GetAnnouncement // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b170
	struct FString GetAlphabetLetterString(int Index); // Function Squad.SQBlueprintLibrary.GetAlphabetLetterString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83b0a0
	void GetAllKeyMappings(struct TArray<struct FInputActionKeyMapping>& KeyMappings); // Function Squad.SQBlueprintLibrary.GetAllKeyMappings // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83aed0
	void GetAllKeybindsBackups(struct TArray<struct FString>& Backups); // Function Squad.SQBlueprintLibrary.GetAllKeybindsBackups // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83afd0
	void GetAllComponentsOfClass(struct AActor* WorldContextObject, struct UActorComponent* Class, struct TArray<struct UObject*>& Components); // Function Squad.SQBlueprintLibrary.GetAllComponentsOfClass // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83adb0
	float GetActorHalfHeight(struct AActor* TestActor); // Function Squad.SQBlueprintLibrary.GetActorHalfHeight // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83ad20
	void GetActionKeyName(struct FName& ActionName, struct FName& Name); // Function Squad.SQBlueprintLibrary.GetActionKeyName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83ac40
	struct FText FormatTextActionKeys(struct FText& FormatText, struct TArray<struct FName>& ActionKeys); // Function Squad.SQBlueprintLibrary.FormatTextActionKeys // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83aa90
	struct ASQPlayerController* FindPlayerByPlayerId(struct UWorld* World, int PlayerId); // Function Squad.SQBlueprintLibrary.FindPlayerByPlayerId // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83a9b0
	struct ASQPlayerController* FindPlayerByNameOrId(struct UWorld* World, struct FString NameOrId); // Function Squad.SQBlueprintLibrary.FindPlayerByNameOrId // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83a8d0
	bool FileSaveString(struct FString Filename, struct FString InText); // Function Squad.SQBlueprintLibrary.FileSaveString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83a7d0
	bool FileLoadString(struct FString Filename, struct FString& OutText); // Function Squad.SQBlueprintLibrary.FileLoadString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83a6c0
	void DumpStaticMeshDrawListStats(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.DumpStaticMeshDrawListStats // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83a650
	bool DoesCustomServerSettingExist(struct FString PropertyName); // Function Squad.SQBlueprintLibrary.DoesCustomServerSettingExist // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x83a5b0
	struct UTextureRenderTargetCube* CreateRenderTargetCube(struct UObject* WorldContextObject, int Size, enum class EPixelFormat Format, struct FLinearColor ClearColor, bool bHDR, bool bForceLinearGamma); // Function Squad.SQBlueprintLibrary.CreateRenderTargetCube // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x83a400
	void ConvertNumberToGridLetter(struct FString& OutResult, int Value); // Function Squad.SQBlueprintLibrary.ConvertNumberToGridLetter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x83a310
	int64 ConvertByteTo_I64(int64 A, enum class ESQByteUnit From, enum class ESQByteUnit To, int64& Remaining); // Function Squad.SQBlueprintLibrary.ConvertByteTo_I64 // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83a1d0
	int ConvertByteTo(int A, enum class ESQByteUnit From, enum class ESQByteUnit To, int& Remaining); // Function Squad.SQBlueprintLibrary.ConvertByteTo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x83a090
	bool ComponentIsDamageableFrom(struct UPrimitiveComponent* VictimComp, struct FVector& Origin, struct AActor* IgnoredActor, struct TArray<struct AActor*>& IgnoreActors, struct FHitResult& OutHitResult); // Function Squad.SQBlueprintLibrary.ComponentIsDamageableFrom // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x839e80
	struct FVector ClosestPointOnLine(struct FVector& LineStart, struct FVector& LineEnd, struct FVector& Point); // Function Squad.SQBlueprintLibrary.ClosestPointOnLine // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x839d30
	void ClampVector(struct FVector& Vector, struct FVector& Min, struct FVector& Max); // Function Squad.SQBlueprintLibrary.ClampVector // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x839c00
	float ClampDeltaAngle(float InDeltaAngle, float CurrentAngle, float MinAngle, float MaxAngle); // Function Squad.SQBlueprintLibrary.ClampDeltaAngle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x839ab0
	float ClampDelta(float InDelta, float Current, float Min, float Max); // Function Squad.SQBlueprintLibrary.ClampDelta // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x839960
	void CenterMousePosition(struct UObject* WorldContextObject); // Function Squad.SQBlueprintLibrary.CenterMousePosition // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x8398f0
	float CalculateAmmoCostToSwapRole(struct USQRoleSettings* NewRole); // Function Squad.SQBlueprintLibrary.CalculateAmmoCostToSwapRole // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x839860
	void CalcTimeToMid(float Midpoint, float Position, float Velocity, float Acceleration, float& TimeToMid); // Function Squad.SQBlueprintLibrary.CalcTimeToMid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8396c0
	void CalcMidpoint(float Target, float Position, float Velocity, float Acceleration, float& Midpoint); // Function Squad.SQBlueprintLibrary.CalcMidpoint // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x839520
	void BreakInputAxisKeyMapping(struct FInputAxisKeyMapping& KeyMapping, struct FName& ActionName, struct FKey& Key, float& Scale); // Function Squad.SQBlueprintLibrary.BreakInputAxisKeyMapping // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x839290
	void BreakInputActionKeyMapping(struct FInputActionKeyMapping& KeyMapping, struct FName& ActionName, struct FKey& Key, bool& bShift, bool& bCtrl, bool& bAlt, bool& bCmd); // Function Squad.SQBlueprintLibrary.BreakInputActionKeyMapping // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x838f10
	void BreakFullHitResult(struct FHitResult& Hit, struct FVector& Location, struct FVector& Normal, struct FVector& ImpactPoint, struct FVector& ImpactNormal, struct FVector& TraceStart, struct FVector& TraceEnd, bool& bBlockingHit, bool& bStartPenetrating, float& PenetrationDepth, float& Time, struct UPhysicalMaterial*& PhysMat, struct AActor*& HitActor, struct UPrimitiveComponent*& HitComponent, struct FName& HitBoneName, int& HitItem, int& HitFaceIndex); // Function Squad.SQBlueprintLibrary.BreakFullHitResult // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x838910
	struct TArray<struct FAudioComponentParam> AssembleSoldierAudioParameters(struct ASQSoldier* Soldier, bool bSetSpeedParameter, bool bSetFloorPhysMatParameter, bool bSetWaterDepthParameter); // Function Squad.SQBlueprintLibrary.AssembleSoldierAudioParameters // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x838750
	struct FTimespan ApplyTimeDilationFactorOnTimeSpan(struct FTimespan& InDelay, float InTimeDilationFactor); // Function Squad.SQBlueprintLibrary.ApplyTimeDilationFactorOnTimeSpan // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x838670
	struct FDateTime ApplyTimeDilationFactorOnDateTime(struct FDateTime& InTime, float InTimeDilationFactor); // Function Squad.SQBlueprintLibrary.ApplyTimeDilationFactorOnDateTime // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x838590
	bool ApplyRadialDamageWithFalloff(struct UObject* WorldContextObject, float BaseDamage, float MinimumDamage, struct FVector& Origin, float KillZoneRadius, float DamageInnerRadius, float DamageOuterRadius, float DamageFalloff, struct UDamageType* DamageTypeClass, struct TArray<struct AActor*>& IgnoreActors, struct AActor* DamageCauser, struct AController* InstigatedByController, bool bOnlyDamageMeshes, enum class ECollisionChannel DamagePreventionChannel); // Function Squad.SQBlueprintLibrary.ApplyRadialDamageWithFalloff // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x838190
	void ApplyOppositeAcceleration(float Target, float Position, float Velocity, float OppositeAcceleration, float DeltaTime, float& NewPosition, float& NewVelocity, float& TimeLeft); // Function Squad.SQBlueprintLibrary.ApplyOppositeAcceleration // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x837f10
	bool ApplyHitResultRadialDamageWithFalloff(struct UObject* WorldContextObject, struct FHitResult& HitResult, float BaseDamage, float MinimumDamage, struct FVector& Origin, float KillZoneRadius, float DamageInnerRadius, float DamageOuterRadius, float DamageFalloff, struct UDamageType* DamageTypeClass, struct TArray<struct AActor*>& IgnoreActors, struct AActor* DamageCauser, struct AController* InstigatedByController, bool bOnlyDamageMeshes, enum class ECollisionChannel DamagePreventionChannel); // Function Squad.SQBlueprintLibrary.ApplyHitResultRadialDamageWithFalloff // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x837a70
	struct FTimespan ApplyGlobalTimeDilationOnTimeSpan(struct UObject* WorldContextObject, struct FTimespan& InDelay); // Function Squad.SQBlueprintLibrary.ApplyGlobalTimeDilationOnTimeSpan // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x8379a0
	struct FDateTime ApplyGlobalTimeDilationOnDateTime(struct UObject* WorldContextObject, struct FDateTime& InTime); // Function Squad.SQBlueprintLibrary.ApplyGlobalTimeDilationOnDateTime // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x8378d0
	void ApplyDeceleration(float Position, float Velocity, float Acceleration, float TimeLeft, float& NewPosition, float& NewVelocity); // Function Squad.SQBlueprintLibrary.ApplyDeceleration // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8376f0
	void ApplyAcceleration(float TimeToMid, float Midpoint, float Position, float Velocity, float Acceleration, float DeltaTime, float& NewPosition, float& NewVelocity, float& TimeLeft); // Function Squad.SQBlueprintLibrary.ApplyAcceleration // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x837430
	struct FVector2D AdjustPositionForTextAlignment(struct FVector2D& OriginalRenderPosition, struct FVector2D& TextSize, enum class ESQTextHorizontalAlignment HorizontalAlignment, enum class ESQTextVerticalAlignment VerticalAlignment); // Function Squad.SQBlueprintLibrary.AdjustPositionForTextAlignment // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x8372b0
	void ActivateReverbEffectFixed(struct UObject* WorldContextObject, struct UReverbEffect* ReverbEffect, struct FName& TagName, float Priority, float Volume, float FadeTime); // Function Squad.SQBlueprintLibrary.ActivateReverbEffectFixed // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x8370f0
};

// Class Squad.SQMultithreadObject
// Size: 0x30 (Inherited: 0x28)
struct USQMultithreadObject : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	void DoMultiThreadedWork(); // Function Squad.SQMultithreadObject.DoMultiThreadedWork // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQMultiThreadBPSubsystem
// Size: 0x48 (Inherited: 0x30)
struct USQMultiThreadBPSubsystem : UEngineSubsystem {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct FMultithreadObjectPair> MultithreadObjects; // 0x38(0x10)
};

// Class Squad.SQMultiThreadedFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct USQMultiThreadedFunctionLibrary : UBlueprintFunctionLibrary {

	void QueueBlueprintMultithreadTask(struct USQMultithreadObject* MultithreadObject, DelegateProperty OnCompleted); // Function Squad.SQMultiThreadedFunctionLibrary.QueueBlueprintMultithreadTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x83f200
};

// Class Squad.SQSoldier
// Size: 0x1ee0 (Inherited: 0x660)
struct ASQSoldier : ACharacter {
	char pad_660[0x14]; // 0x660(0x14)
	float BuddyBoosterMaximumVelocitySquared; // 0x674(0x04)
	struct FSQUsableData UsableData; // 0x678(0x40)
	struct USkeletalMeshComponent* Mesh1P; // 0x6b8(0x08)
	struct USkeletalMeshComponent* Mesh1PShadow; // 0x6c0(0x08)
	char bEnableTickUpdateShiftMesh : 1; // 0x6c8(0x01)
	char pad_6C8_1 : 7; // 0x6c8(0x01)
	char pad_6C9[0x3]; // 0x6c9(0x03)
	struct FVector ShiftMeshOffset; // 0x6cc(0x0c)
	float Prone2SprintMovementRecovery; // 0x6d8(0x04)
	float Prone2SprintAlpha; // 0x6dc(0x04)
	struct USQConsoleVariablesComponent* ConsoleVariablesComponent; // 0x6e0(0x08)
	struct TArray<struct USkeletalMesh*> SoldierMeshSkins; // 0x6e8(0x10)
	struct UMaterialInterface* BasePatchMaterial; // 0x6f8(0x08)
	struct UCameraComponent* FirstPersonCameraComponent; // 0x700(0x08)
	float WeaponBasedFOV; // 0x708(0x04)
	char pad_70C[0x4]; // 0x70c(0x04)
	struct USQSoldierMovement* SoldierMovement; // 0x710(0x08)
	struct USphereComponent* SnapZone; // 0x718(0x08)
	struct FPostProcessSettings LowHealthPostProcessSettings; // 0x720(0x530)
	struct FPostProcessSettings BleedingPostProcessSettings; // 0xc50(0x530)
	struct FPostProcessSettings SuppressionPostProcessSettings; // 0x1180(0x530)
	char bAllowEffectsForProjectilesFiredWithinSuppressionRange : 1; // 0x16b0(0x01)
	char pad_16B0_1 : 7; // 0x16b0(0x01)
	char pad_16B1[0x3]; // 0x16b1(0x03)
	float UnderSuppressionPercentage; // 0x16b4(0x04)
	float SuppressionEffectsDecayRate; // 0x16b8(0x04)
	float BaseTurnRate; // 0x16bc(0x04)
	float BaseLookUpRate; // 0x16c0(0x04)
	float NoADSToSprintDot; // 0x16c4(0x04)
	float ADSToSprintDot; // 0x16c8(0x04)
	char bIsDoubleTapWalking : 1; // 0x16cc(0x01)
	char pad_16CC_1 : 7; // 0x16cc(0x01)
	char pad_16CD[0x3]; // 0x16cd(0x03)
	struct FVector GunOffset; // 0x16d0(0x0c)
	float ProneEyeHeight; // 0x16dc(0x04)
	char bIsProne : 1; // 0x16e0(0x01)
	char pad_16E0_1 : 7; // 0x16e0(0x01)
	char pad_16E1[0xf]; // 0x16e1(0x0f)
	char bInThirdPersonView : 1; // 0x16f0(0x01)
	char bCachedInThirdPerson : 1; // 0x16f0(0x01)
	char pad_16F0_2 : 6; // 0x16f0(0x01)
	char pad_16F1[0x3]; // 0x16f1(0x03)
	struct FName AttachSocket1PName; // 0x16f4(0x08)
	struct FName AttachSocket3PName; // 0x16fc(0x08)
	char pad_1704[0x4]; // 0x1704(0x04)
	struct USQCoreStateComponent* StateObject; // 0x1708(0x08)
	struct USQMapIconComponent* MapIcon; // 0x1710(0x08)
	float SecondsUntilIgnoreDistanceForAliveTeamMates; // 0x1718(0x04)
	float SecondsOfSpawnProtection; // 0x171c(0x04)
	float InvulnerableDelay; // 0x1720(0x04)
	float RagdollLifeSpan; // 0x1724(0x04)
	float UnpossessionDelayAfterDeath; // 0x1728(0x04)
	char pad_172C[0x4]; // 0x172c(0x04)
	struct TArray<struct FSQBoneDamageMod> BoneDamageModifiers; // 0x1730(0x10)
	char pad_1740[0x30]; // 0x1740(0x30)
	char LeaningDirection; // 0x1770(0x01)
	char pad_1771[0x3]; // 0x1771(0x03)
	float BlockLeanTraceDistance; // 0x1774(0x04)
	float PitchAngleAdjust; // 0x1778(0x04)
	float BlockLeanTraceRotation; // 0x177c(0x04)
	float ProneBlockLeanTraceDistance; // 0x1780(0x04)
	float PronePitchAngleAdjust; // 0x1784(0x04)
	float ProneBlockLeanTraceRotation; // 0x1788(0x04)
	float UseInteractDistance; // 0x178c(0x04)
	struct AActor* UseFocus; // 0x1790(0x08)
	char pad_1798[0x4]; // 0x1798(0x04)
	float SnapZoneRadius; // 0x179c(0x04)
	float MinDistanceToSuppressedTarget; // 0x17a0(0x04)
	float FullSuppressionRadius; // 0x17a4(0x04)
	float SuppressionRadius; // 0x17a8(0x04)
	char pad_17AC[0x4]; // 0x17ac(0x04)
	struct USQVehicleSeatComponent* CurrentSeat; // 0x17b0(0x08)
	char bTestingMove : 1; // 0x17b8(0x01)
	char pad_17B8_1 : 7; // 0x17b8(0x01)
	char pad_17B9[0x3]; // 0x17b9(0x03)
	float CachedMoveRotation; // 0x17bc(0x04)
	struct FVector CachedMoveRotationPoint; // 0x17c0(0x0c)
	struct FVector CachedForwardVector; // 0x17cc(0x0c)
	struct FScriptMulticastDelegate OnChangedSeat; // 0x17d8(0x10)
	char bStopADSWhenSprintPressed : 1; // 0x17e8(0x01)
	char bStopADSWhenPronePressed : 1; // 0x17e8(0x01)
	char bStopADSWhenUnpronePressed : 1; // 0x17e8(0x01)
	char bStopSprintWhenADSPressed : 1; // 0x17e8(0x01)
	char bStopUsingPrimaryItemWhenPronePressed : 1; // 0x17e8(0x01)
	char bStopUsingAltItemWhenPronePressed : 1; // 0x17e8(0x01)
	char bStopUsingPrimaryItemWhenUnpronePressed : 1; // 0x17e8(0x01)
	char bStopUsingAltItemWhenUnpronePressed : 1; // 0x17e8(0x01)
	char bItemLoweredDueToCollision : 1; // 0x17e9(0x01)
	char bCachedADSDuringItemCollision : 1; // 0x17e9(0x01)
	char pad_17E9_2 : 6; // 0x17e9(0x01)
	char pad_17EA[0x6]; // 0x17ea(0x06)
	struct AActor* UsingObject; // 0x17f0(0x08)
	int VehicleSeatEntryWeaponSlot; // 0x17f8(0x04)
	int VehicleSeatEntryWeaponOffset; // 0x17fc(0x04)
	char pad_1800[0x2d8]; // 0x1800(0x2d8)
	struct FSQTakeHitInfo LastTakeHitInfo; // 0x1ad8(0x138)
	char SoldierSkinIndex; // 0x1c10(0x01)
	char pad_1C11[0x3]; // 0x1c11(0x03)
	char bIsDying : 1; // 0x1c14(0x01)
	char pad_1C14_1 : 1; // 0x1c14(0x01)
	char bIsBleeding : 1; // 0x1c14(0x01)
	char bIsWounded : 1; // 0x1c14(0x01)
	char pad_1C14_4 : 1; // 0x1c14(0x01)
	char bAllowWoundedState : 1; // 0x1c14(0x01)
	char pad_1C14_6 : 2; // 0x1c14(0x01)
	char pad_1C15[0x3]; // 0x1c15(0x03)
	float Health; // 0x1c18(0x04)
	float LastHealedTime; // 0x1c1c(0x04)
	float WoundedThreshold; // 0x1c20(0x04)
	float HealthBleedableThreshold; // 0x1c24(0x04)
	float HealthHurtMovementThreshold; // 0x1c28(0x04)
	float DamageBleedableThreshold; // 0x1c2c(0x04)
	float WoundedHealthLossRate; // 0x1c30(0x04)
	float WoundedBandagedHealthLossRate; // 0x1c34(0x04)
	float BleedingHealthLossRate; // 0x1c38(0x04)
	float KillDamageThreshold; // 0x1c3c(0x04)
	float HealthUponRevival; // 0x1c40(0x04)
	float TimeBecameWounded; // 0x1c44(0x04)
	float TimeBecameRevived; // 0x1c48(0x04)
	float PostRecoveryUpdateRate; // 0x1c4c(0x04)
	struct FTimerHandle PostRecoveryTimerHandle; // 0x1c50(0x08)
	float PostRecoveryTimeLeft; // 0x1c58(0x04)
	char pad_1C5C[0x4]; // 0x1c5c(0x04)
	struct UCurveFloat* PostRecoveryRateByHealthCurve; // 0x1c60(0x08)
	float CumulativeRevivePenalty; // 0x1c68(0x04)
	char bIsHoldingBreath : 1; // 0x1c6c(0x01)
	char pad_1C6C_1 : 7; // 0x1c6c(0x01)
	char pad_1C6D[0x3]; // 0x1c6d(0x03)
	float BreathHoldStamina; // 0x1c70(0x04)
	float BreathHoldStaminaMax; // 0x1c74(0x04)
	float BreathHoldRecoveryDuration; // 0x1c78(0x04)
	float BreathHoldConsumptionDuration; // 0x1c7c(0x04)
	float BreathHoldFadeDuration; // 0x1c80(0x04)
	float BreathHoldPct; // 0x1c84(0x04)
	float FocusZoomAlpha; // 0x1c88(0x04)
	char pad_1C8C[0x4]; // 0x1c8c(0x04)
	struct UCurveFloat* FallSpeedToFallDamageCurve; // 0x1c90(0x08)
	float FallingDamageMultiplier; // 0x1c98(0x04)
	float MaximumSafeFallingSpeed; // 0x1c9c(0x04)
	float BonkOnHeadFallDamageMultiplier; // 0x1ca0(0x04)
	char pad_1CA4[0x4]; // 0x1ca4(0x04)
	struct FScriptMulticastDelegate OnRevivedEvent; // 0x1ca8(0x10)
	char bIsLeavingServer : 1; // 0x1cb8(0x01)
	char pad_1CB8_1 : 7; // 0x1cb8(0x01)
	char pad_1CB9[0x7]; // 0x1cb9(0x07)
	struct USoundMix* WoundedSoundMix; // 0x1cc0(0x08)
	struct USoundMix* BleedingSoundMix; // 0x1cc8(0x08)
	struct USoundBase* WaterFeetBottomEnterSound; // 0x1cd0(0x08)
	struct USoundBase* WaterAboveHipEnterSound; // 0x1cd8(0x08)
	struct USoundBase* WaterJumpSound; // 0x1ce0(0x08)
	struct UAudioComponent* WaterAC; // 0x1ce8(0x08)
	struct UAudioComponent* DeepWaterAC; // 0x1cf0(0x08)
	enum class ESQListenerType ListenerType; // 0x1cf8(0x01)
	char pad_1CF9[0x7]; // 0x1cf9(0x07)
	struct UCurveLinearColor* HealthBasedFilterGainCurve; // 0x1d00(0x08)
	char bUseHealthBasedFilterGainCurveForWoundedSoundMix : 1; // 0x1d08(0x01)
	char bUseHealthBasedFilterGainCurveForBleedingSoundMix : 1; // 0x1d08(0x01)
	char pad_1D08_2 : 6; // 0x1d08(0x01)
	char pad_1D09[0x7]; // 0x1d09(0x07)
	struct UCurveFloat* HeartbeatVolumeCurve; // 0x1d10(0x08)
	struct USoundBase* HeartbeatSound; // 0x1d18(0x08)
	struct USoundBase* HeartbeatIncapSound; // 0x1d20(0x08)
	struct USoundBase* DefaultLandedSound; // 0x1d28(0x08)
	struct USoundBase* HitSound; // 0x1d30(0x08)
	struct USoundBase* FirstPersonHitSound; // 0x1d38(0x08)
	struct USoundBase* IncapSound; // 0x1d40(0x08)
	struct TArray<struct FSQBoneHitSound> BoneHitSounds; // 0x1d48(0x10)
	float IncapSoundOccurrencePercentage; // 0x1d58(0x04)
	float WoundedSoundMixDelaySeconds; // 0x1d5c(0x04)
	char bPlayIncapSound : 1; // 0x1d60(0x01)
	char pad_1D60_1 : 7; // 0x1d60(0x01)
	char pad_1D61[0x7]; // 0x1d61(0x07)
	struct USoundBase* DeathSound; // 0x1d68(0x08)
	struct USoundBase* ClothingSound; // 0x1d70(0x08)
	struct USoundBase* EquipmentSound; // 0x1d78(0x08)
	struct USoundBase* ResupplyCrateSound; // 0x1d80(0x08)
	float DeathSoundOccurrencePercentage; // 0x1d88(0x04)
	char bPlayDeathSound : 1; // 0x1d8c(0x01)
	char pad_1D8C_1 : 7; // 0x1d8c(0x01)
	char pad_1D8D[0x3]; // 0x1d8d(0x03)
	struct UAudioComponent* FoleyAC; // 0x1d90(0x08)
	struct UAudioComponent* HeartbeatAC; // 0x1d98(0x08)
	struct UAudioComponent* HeartbeatIncapAC; // 0x1da0(0x08)
	struct USQPhysicalMaterialSoldiersEffects* PhysMatEffectsClass; // 0x1da8(0x08)
	char bPerfToggleMultiCastLean : 1; // 0x1db0(0x01)
	char pad_1DB0_1 : 7; // 0x1db0(0x01)
	char pad_1DB1[0x7]; // 0x1db1(0x07)
	struct FTimerHandle DelayedUnposessTimer; // 0x1db8(0x08)
	struct UPhysicsHandleComponent* DraggingHandle; // 0x1dc0(0x08)
	struct FSQDraggingData DraggingData; // 0x1dc8(0x10)
	float DraggingDistanceMultiplier; // 0x1dd8(0x04)
	char pad_1DDC[0x4]; // 0x1ddc(0x04)
	struct FTimerHandle StartDraggingTimerHandle; // 0x1de0(0x08)
	float StartDraggingDelay; // 0x1de8(0x04)
	char pad_1DEC[0x4]; // 0x1dec(0x04)
	struct TArray<struct FSQDraggableBone> DraggableBones; // 0x1df0(0x10)
	struct USQSoldierRagdollComponent* RagdollComponent; // 0x1e00(0x08)
	struct USQBuffManager* Buffs; // 0x1e08(0x08)
	struct FScriptMulticastDelegate OnWoundEvent; // 0x1e10(0x10)
	char pad_1E20[0x8]; // 0x1e20(0x08)
	struct FScriptMulticastDelegate OnDeathEvent; // 0x1e28(0x10)
	char bBodyDraggingActive : 1; // 0x1e38(0x01)
	char pad_1E38_1 : 7; // 0x1e38(0x01)
	char pad_1E39[0x7]; // 0x1e39(0x07)
	struct USQSoldierStaticInfo* SoldierStaticInfo; // 0x1e40(0x08)
	float DefaultDrowningHeight; // 0x1e48(0x04)
	float CrouchedDrowningHeight; // 0x1e4c(0x04)
	float ProneDrowningHeight; // 0x1e50(0x04)
	struct FSQUnderwaterBoneData UnderwaterBoneData; // 0x1e54(0x28)
	char pad_1E7C[0x4]; // 0x1e7c(0x04)
	struct UParticleSystem* WaterFeetEnterEffect; // 0x1e80(0x08)
	struct UParticleSystem* WaterDeepEnterEffect; // 0x1e88(0x08)
	struct USQBaseWaterComponent* BaseWaterComponent; // 0x1e90(0x08)
	struct USQSoldierWaterDamageComponent* WaterDamageComponent; // 0x1e98(0x08)
	struct USQWaterPointTestComponent* WaterPointTestComponent; // 0x1ea0(0x08)
	char pad_1EA8[0x10]; // 0x1ea8(0x10)
	struct USQPawnInventoryComponent* InventoryComponent; // 0x1eb8(0x08)
	char pad_1EC0[0x8]; // 0x1ec0(0x08)
	struct USoundMix* CurrentSoundMix; // 0x1ec8(0x08)
	struct TArray<struct FVector_NetQuantize> ZeroBasedBoneLocs; // 0x1ed0(0x10)

	bool Wound(float KillingDamage, struct FDamageEvent& DamageEvent, struct AController* Killer, struct AActor* DamageCauser); // Function Squad.SQSoldier.Wound // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8e3450
	void UserSettingsChanged(struct USQGameUserSettings* Settings); // Function Squad.SQSoldier.UserSettingsChanged // (Final|Native|Public) // @ game+0x8e33d0
	void UpdatePatches(); // Function Squad.SQSoldier.UpdatePatches // (Final|Native|Public) // @ game+0x8e33b0
	void UpdateFirstPersonVisibility(); // Function Squad.SQSoldier.UpdateFirstPersonVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x8e3390
	void UnProne(); // Function Squad.SQSoldier.UnProne // (Native|Public|BlueprintCallable) // @ game+0x864990
	bool SwitchWeapon(int NewWeaponSlotla); // Function Squad.SQSoldier.SwitchWeapon // (Native|Public|BlueprintCallable) // @ game+0x8e3220
	void SwitchedSeat(struct USQVehicleSeatComponent* PreviousSeat, struct USQVehicleSeatComponent* NewSeat); // Function Squad.SQSoldier.SwitchedSeat // (Native|Event|Public|BlueprintEvent) // @ game+0x8e32c0
	void Suicide(); // Function Squad.SQSoldier.Suicide // (Native|Public|BlueprintCallable) // @ game+0x8e3200
	void StopBodyDragging(); // Function Squad.SQSoldier.StopBodyDragging // (Native|Public|BlueprintCallable) // @ game+0x8e31e0
	void StopBleeding(); // Function Squad.SQSoldier.StopBleeding // (Final|Native|Public|BlueprintCallable) // @ game+0x8e31c0
	bool StartBodyDragging(); // Function Squad.SQSoldier.StartBodyDragging // (Native|Public|BlueprintCallable) // @ game+0x881b60
	void StartAimDownSights(); // Function Squad.SQSoldier.StartAimDownSights // (Native|Public) // @ game+0x8e31a0
	void SetSeatState(enum class ESQSoldierSeatState SoldierSeatState); // Function Squad.SQSoldier.SetSeatState // (Native|Public|BlueprintCallable) // @ game+0x8e3120
	void SetFirstPersonVisibility(bool bIsFirstPersonVisible); // Function Squad.SQSoldier.SetFirstPersonVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x8e3090
	void ServerVehicleCollision(struct ASQVehicle* Vehicle, bool bShouldKill); // Function Squad.SQSoldier.ServerVehicleCollision // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2f90
	void ServerPickupAmmoBag(struct ASQDeployableAmmoBag* ammobag); // Function Squad.SQSoldier.ServerPickupAmmoBag // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8e2ed0
	void ServerEndInteract(); // Function Squad.SQSoldier.ServerEndInteract // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2e80
	void ServerDragBody(bool bDrag, struct ASQSoldier* SoldierToDrag, struct FName BoneName); // Function Squad.SQSoldier.ServerDragBody // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2d40
	void ServerDisableSpawnProtection(); // Function Squad.SQSoldier.ServerDisableSpawnProtection // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2cf0
	void ServerDeployableInteractable(struct ASQDeployableInteractable* Deployable); // Function Squad.SQSoldier.ServerDeployableInteractable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable|NetValidate) // @ game+0x8e2c30
	void ServerDebugTogglePostRecovery(bool Value); // Function Squad.SQSoldier.ServerDebugTogglePostRecovery // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2b70
	void ServerDebugToggleGodMode(); // Function Squad.SQSoldier.ServerDebugToggleGodMode // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2b20
	void ServerDebugStopBleeding(); // Function Squad.SQSoldier.ServerDebugStopBleeding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2ad0
	void ServerDebugSetHealth(float Value); // Function Squad.SQSoldier.ServerDebugSetHealth // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2a20
	void ServerDebugRevive(); // Function Squad.SQSoldier.ServerDebugRevive // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e29d0
	void ServerDebugRearm(); // Function Squad.SQSoldier.ServerDebugRearm // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2980
	void ServerDebugRagdoll(); // Function Squad.SQSoldier.ServerDebugRagdoll // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2930
	void ServerDebugFullHealth(); // Function Squad.SQSoldier.ServerDebugFullHealth // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e28e0
	void ServerDebugAddBuildSupply(int Amount); // Function Squad.SQSoldier.ServerDebugAddBuildSupply // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e2820
	void ServerBeginInteract(); // Function Squad.SQSoldier.ServerBeginInteract // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8e27d0
	void ReviveServerOnly(); // Function Squad.SQSoldier.ReviveServerOnly // (Native|Public|BlueprintCallable) // @ game+0x8e27b0
	void Prone(); // Function Squad.SQSoldier.Prone // (Native|Public|BlueprintCallable) // @ game+0x8e2790
	void PlayFootStep(struct FName SocketName, struct FName OpposingKneeSocketName, float MaxDistanceInMeters); // Function Squad.SQSoldier.PlayFootStep // (Final|Native|Public|BlueprintCallable) // @ game+0x8e2680
	void PlayEquipmentSound(float MaxDistanceInMeters); // Function Squad.SQSoldier.PlayEquipmentSound // (Final|Native|Public|BlueprintCallable) // @ game+0x8e2600
	void PlayClothingSound(float MaxDistanceInMeters); // Function Squad.SQSoldier.PlayClothingSound // (Final|Native|Public|BlueprintCallable) // @ game+0x8e2580
	void OnSnapZoneOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int OtherBodyIndex); // Function Squad.SQSoldier.OnSnapZoneOverlapEnd // (Native|Public) // @ game+0x8e2440
	void OnSnapZoneOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Squad.SQSoldier.OnSnapZoneOverlapBegin // (Native|Public|HasOutParms) // @ game+0x8e2250
	void OnRep_SoldierSkinIndex(); // Function Squad.SQSoldier.OnRep_SoldierSkinIndex // (Final|Native|Public) // @ game+0x8e2230
	void OnRep_LastTakeHitInfo(); // Function Squad.SQSoldier.OnRep_LastTakeHitInfo // (Native|Protected) // @ game+0x8e2210
	void OnRep_IsWounded(); // Function Squad.SQSoldier.OnRep_IsWounded // (Native|Public) // @ game+0x8e21f0
	void OnRep_IsDying(); // Function Squad.SQSoldier.OnRep_IsDying // (Native|Public) // @ game+0x8e21d0
	void OnRep_IsBleeding(); // Function Squad.SQSoldier.OnRep_IsBleeding // (Native|Public) // @ game+0x8e21b0
	void OnRep_Health(float OldHealth); // Function Squad.SQSoldier.OnRep_Health // (Native|Public) // @ game+0x8e2130
	void OnRep_CurrentSeat(struct USQVehicleSeatComponent* PreviousSeat); // Function Squad.SQSoldier.OnRep_CurrentSeat // (Native|Public) // @ game+0x8e20a0
	void OnRagdollHit(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Squad.SQSoldier.OnRagdollHit // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x8e1ef0
	void OnPrevItem(); // Function Squad.SQSoldier.OnPrevItem // (Native|Public|BlueprintCallable) // @ game+0x8e1ed0
	void OnNextItem(); // Function Squad.SQSoldier.OnNextItem // (Native|Public|BlueprintCallable) // @ game+0x8e1eb0
	void OnHipHeightCollideWithWaterLevel(float ImmersionDepth); // Function Squad.SQSoldier.OnHipHeightCollideWithWaterLevel // (Final|Native|Public) // @ game+0x8e1e30
	void OnFeetBottomCollideWithWaterLevel(float ImmersionDepth); // Function Squad.SQSoldier.OnFeetBottomCollideWithWaterLevel // (Final|Native|Public) // @ game+0x8e1db0
	void MulticastToggleGodMode(); // Function Squad.SQSoldier.MulticastToggleGodMode // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x8e1d90
	void MulticastSetDragging(bool bDrag, struct ASQSoldier* SoldierToDrag, struct FName BoneName); // Function Squad.SQSoldier.MulticastSetDragging // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x8e1c80
	void MulticastLean(char NewLeanDirection); // Function Squad.SQSoldier.MulticastLean // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x8e1c00
	void MulticastChangeRootComponent(bool bSetMeshAsRoot); // Function Squad.SQSoldier.MulticastChangeRootComponent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x8e1b70
	void LeftVehicle(struct USQVehicleSeatComponent* PreviousSeat); // Function Squad.SQSoldier.LeftVehicle // (Native|Event|Public|BlueprintEvent) // @ game+0x8e1ae0
	void LeftSeat(struct USQVehicleSeatComponent* PreviousSeat, bool bSwitchedSeats, bool bLeftVehicle); // Function Squad.SQSoldier.LeftSeat // (Native|Event|Public|BlueprintEvent) // @ game+0x8e19d0
	bool IsSprinting(); // Function Squad.SQSoldier.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e19a0
	bool IsInVehicle(); // Function Squad.SQSoldier.IsInVehicle // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1940
	bool IsInteracting(); // Function Squad.SQSoldier.IsInteracting // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1970
	bool IsImmersedPastKneeHeight(); // Function Squad.SQSoldier.IsImmersedPastKneeHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1910
	bool IsImmersedPastHipHeight(); // Function Squad.SQSoldier.IsImmersedPastHipHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e18e0
	bool IsImmersedPastHeadHeight(); // Function Squad.SQSoldier.IsImmersedPastHeadHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e18b0
	bool IsImmersedPastFootHeight(); // Function Squad.SQSoldier.IsImmersedPastFootHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1880
	bool IsImmersedPastChestHeight(); // Function Squad.SQSoldier.IsImmersedPastChestHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1850
	bool IsFirstPersonViewTarget(); // Function Squad.SQSoldier.IsFirstPersonViewTarget // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1810
	bool IsDragging(); // Function Squad.SQSoldier.IsDragging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e17e0
	bool IsAlive(); // Function Squad.SQSoldier.IsAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e17a0
	void InitiateDragging(struct ASQSoldier* SoldierToDrag, int BoneIndex); // Function Squad.SQSoldier.InitiateDragging // (Final|Native|Public|BlueprintCallable) // @ game+0x8e16e0
	void Heal(float AmountHealed); // Function Squad.SQSoldier.Heal // (Native|Public|BlueprintCallable) // @ game+0x8e1660
	struct ASQTeamState* GetTeamState(); // Function Squad.SQSoldier.GetTeamState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1630
	int GetTeam(); // Function Squad.SQSoldier.GetTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1600
	enum class ESQSoldierSeatState GetSeatState(); // Function Squad.SQSoldier.GetSeatState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x8e15e0
	struct ASQEquipableItem* GetPendingWeapon(); // Function Squad.SQSoldier.GetPendingWeapon // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e15a0
	struct ASQForwardBase* GetNearestFOB(bool bIsFriendly); // Function Squad.SQSoldier.GetNearestFOB // (Final|Native|Public|BlueprintCallable) // @ game+0x8e1500
	float GetMaxHealth(); // Function Squad.SQSoldier.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e14d0
	float GetKneeHeight(struct FVector TestLocation); // Function Squad.SQSoldier.GetKneeHeight // (Final|Native|Public|HasDefaults|Const) // @ game+0x8e1430
	struct USQPawnInventoryComponent* GetInventory(); // Function Squad.SQSoldier.GetInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e13f0
	float GetHipHeight(struct FVector TestLocation); // Function Squad.SQSoldier.GetHipHeight // (Final|Native|Public|HasDefaults|Const) // @ game+0x8e1350
	float GetHeadHeight(struct FVector TestLocation); // Function Squad.SQSoldier.GetHeadHeight // (Final|Native|Public|HasDefaults|Const) // @ game+0x8e12b0
	float GetFootHeight(struct FVector TestLocation); // Function Squad.SQSoldier.GetFootHeight // (Final|Native|Public|HasDefaults|Const) // @ game+0x8e1210
	bool GetFirstPersonVisibility(); // Function Squad.SQSoldier.GetFirstPersonVisibility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e11e0
	float GetDrowningHeight(); // Function Squad.SQSoldier.GetDrowningHeight // (Final|Native|Public|BlueprintCallable) // @ game+0x8e11b0
	float GetDamageForFallingAtSpeed(float InFallSpeed, float InBaseHealth); // Function Squad.SQSoldier.GetDamageForFallingAtSpeed // (Final|Native|Public|BlueprintCallable) // @ game+0x8e10e0
	struct ASQEquipableItem* GetCurrentWeapon(); // Function Squad.SQSoldier.GetCurrentWeapon // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e10a0
	struct ASQVehicle* GetCurrentVehicle(); // Function Squad.SQSoldier.GetCurrentVehicle // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1070
	struct FRotator GetCurrentSeatWeaponRotation(); // Function Squad.SQSoldier.GetCurrentSeatWeaponRotation // (Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1030
	struct ASQVehicleSeat* GetCurrentSeatPawn(); // Function Squad.SQSoldier.GetCurrentSeatPawn // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e1000
	struct USQVehicleSeatComponent* GetCurrentSeat(); // Function Squad.SQSoldier.GetCurrentSeat // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e0fd0
	float GetCurrentHealthPercentage(); // Function Squad.SQSoldier.GetCurrentHealthPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e0f80
	float GetChestHeight(struct FVector TestLocation); // Function Squad.SQSoldier.GetChestHeight // (Final|Native|Public|HasDefaults|Const) // @ game+0x8e0ee0
	void EnteredVehicle(struct USQVehicleSeatComponent* NewSeat); // Function Squad.SQSoldier.EnteredVehicle // (Native|Event|Public|BlueprintEvent) // @ game+0x8e0e50
	void EnteredSeat(struct USQVehicleSeatComponent* PreviousSeat, struct USQVehicleSeatComponent* NewSeat, bool bSwitchedSeats, bool bEnteredVehicle); // Function Squad.SQSoldier.EnteredSeat // (Native|Event|Public|BlueprintEvent) // @ game+0x8e0d00
	void EndInteract(); // Function Squad.SQSoldier.EndInteract // (Native|Public|BlueprintCallable) // @ game+0x8e0ce0
	void EndFireWeapon(); // Function Squad.SQSoldier.EndFireWeapon // (Native|Public|BlueprintCallable) // @ game+0x8e0cc0
	void EndAltFireWeapon(); // Function Squad.SQSoldier.EndAltFireWeapon // (Native|Public|BlueprintCallable) // @ game+0x8e0ca0
	void EndAimDownSights(); // Function Squad.SQSoldier.EndAimDownSights // (Native|Public) // @ game+0x8e0c80
	void DisableSpawnProtection(); // Function Squad.SQSoldier.DisableSpawnProtection // (Native|Public|BlueprintCallable) // @ game+0x8e0c60
	bool Die(float KillingDamage, struct FDamageEvent& DamageEvent, struct AController* Killer, struct AActor* DamageCauser); // Function Squad.SQSoldier.Die // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8e0ac0
	void DebugTogglePostRecovery(bool Value); // Function Squad.SQSoldier.DebugTogglePostRecovery // (Final|Exec|Native|Public) // @ game+0x8e0a30
	void DebugToggleOriginRebaseTest(bool Value); // Function Squad.SQSoldier.DebugToggleOriginRebaseTest // (Final|Exec|Native|Public) // @ game+0x8e09a0
	void DebugToggleGodMode(); // Function Squad.SQSoldier.DebugToggleGodMode // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8e0980
	void DebugStopBleeding(); // Function Squad.SQSoldier.DebugStopBleeding // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8e0960
	void DebugSetHealth(float Value); // Function Squad.SQSoldier.DebugSetHealth // (Final|Exec|Native|Public) // @ game+0x8e08e0
	void DebugRevive(); // Function Squad.SQSoldier.DebugRevive // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8e08c0
	void DebugRearm(); // Function Squad.SQSoldier.DebugRearm // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8e08a0
	void DebugRagdoll(); // Function Squad.SQSoldier.DebugRagdoll // (Final|Exec|Native|Public) // @ game+0x8e0880
	void DebugFullHealth(); // Function Squad.SQSoldier.DebugFullHealth // (Final|Exec|Native|Public) // @ game+0x8e0860
	void DebugAddBuildSupply(int Amount); // Function Squad.SQSoldier.DebugAddBuildSupply // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x8e07e0
	void ClearSeatState(); // Function Squad.SQSoldier.ClearSeatState // (Native|Public|BlueprintCallable) // @ game+0x8e07c0
	void ChangeSoundMix(struct USoundMix* NewSoundMix); // Function Squad.SQSoldier.ChangeSoundMix // (Final|Native|Public|BlueprintCallable) // @ game+0x8e0740
	bool CanStartWithMaxAmmo(); // Function Squad.SQSoldier.CanStartWithMaxAmmo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8e0710
	void BPWoundedDamageTaken(float damage); // Function Squad.SQSoldier.BPWoundedDamageTaken // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BPWound(float KillingDamage, struct FDamageEvent& DamageEvent, struct AController* Killer, struct AActor* DamageCauser); // Function Squad.SQSoldier.BPWound // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x12b8b50
	void BPOnSuppression(struct FVector& ClosestPoint, float ClosenessRatio, bool bAppliedSuppression); // Function Squad.SQSoldier.BPOnSuppression // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x12b8b50
	void BPOnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Squad.SQSoldier.BPOnStartProne // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BPOnSnapZoneOverlapEnd(struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int OtherBodyIndex); // Function Squad.SQSoldier.BPOnSnapZoneOverlapEnd // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BPOnSnapZoneOverlapBegin(struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Squad.SQSoldier.BPOnSnapZoneOverlapBegin // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x12b8b50
	void BPOnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Squad.SQSoldier.BPOnEndProne // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	struct FVector2D BPGetYawViewLimits(struct FVector2D& YawViewLimits); // Function Squad.SQSoldier.BPGetYawViewLimits // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent|Const) // @ game+0x8e05f0
	void BPDie(float KillingDamage, struct FDamageEvent& DamageEvent, struct AController* Killer, struct AActor* DamageCauser); // Function Squad.SQSoldier.BPDie // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x12b8b50
	void BPBleedingDamageTaken(float damage); // Function Squad.SQSoldier.BPBleedingDamageTaken // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BlueprintUpdateSkin(); // Function Squad.SQSoldier.BlueprintUpdateSkin // (Native|Event|Public|BlueprintEvent) // @ game+0x8e06f0
	void BlueprintUpdateFirstPersonVisibility(bool bIsFirstPersonVisible); // Function Squad.SQSoldier.BlueprintUpdateFirstPersonVisibility // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BlueprintCalcCamera(float DeltaTime, struct FVector InLocation, struct FRotator InRotation, float InFOV, struct FVector& OutLocation, struct FRotator& OutRotation, float& OutFOV); // Function Squad.SQSoldier.BlueprintCalcCamera // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x12b8b50
	void BeginInteract(); // Function Squad.SQSoldier.BeginInteract // (Native|Public|BlueprintCallable) // @ game+0x8e06d0
	void BeginFireWeapon(); // Function Squad.SQSoldier.BeginFireWeapon // (Native|Public|BlueprintCallable) // @ game+0x8e06b0
	void BeginAltFireWeapon(); // Function Squad.SQSoldier.BeginAltFireWeapon // (Native|Public|BlueprintCallable) // @ game+0x8e0690
	bool AttemptToRearmWeapons(struct TScriptInterface<Class> RearmSource, struct TArray<struct FSQRearmWeaponRequest>& RearmRequest); // Function Squad.SQSoldier.AttemptToRearmWeapons // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8e04d0
	bool AttemptSuppression(struct FVector& SuppressionStart, struct FVector& SuppressionEnd, struct AActor* ProjectileInstigator, struct USQSuppressionInfo* SuppressionInfoClass, struct FVector& OutClosestPoint, bool& bOutApplySuppression); // Function Squad.SQSoldier.AttemptSuppression // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x8e02a0
};

// Class Squad.SQBot
// Size: 0x1ef0 (Inherited: 0x1ee0)
struct ASQBot : ASQSoldier {
	struct UBehaviorTree* BotBehavior; // 0x1ee0(0x08)
	char pad_1EE8[0x8]; // 0x1ee8(0x08)
};

// Class Squad.SQBotComponent
// Size: 0x100 (Inherited: 0xd8)
struct USQBotComponent : UActorComponent {
	struct ASQSoldierNew* TargetEnemy; // 0xd8(0x08)
	struct ASQSoldierNew* OwnerSoldier; // 0xe0(0x08)
	char pad_E8[0x4]; // 0xe8(0x04)
	float TargetingRange; // 0xec(0x04)
	float CheckAtFloorDistance; // 0xf0(0x04)
	float RandomHeadingYawRange; // 0xf4(0x04)
	float RandomHeadingPitchRange; // 0xf8(0x04)
	float TargetingMaxPitchDelta; // 0xfc(0x04)
};

// Class Squad.SQBoundaryListener
// Size: 0x140 (Inherited: 0xd8)
struct USQBoundaryListener : UActorComponent {
	bool bRegisterToAllBoundaries; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
	struct TArray<struct ASQBoundary*> TargetBoundaryClasses; // 0xe0(0x10)
	struct FScriptMulticastDelegate OnEnterBoundarySignal; // 0xf0(0x10)
	struct FScriptMulticastDelegate OnExitBoundarySignal; // 0x100(0x10)
	struct AActor* OverrideTargetActor; // 0x110(0x08)
	struct TArray<struct ASQBoundary*> Boundaries; // 0x118(0x10)
	char pad_128[0x18]; // 0x128(0x18)

	void UnregisterAllBoundaries(); // Function Squad.SQBoundaryListener.UnregisterAllBoundaries // (Final|Native|Public|BlueprintCallable) // @ game+0x845110
	bool ShouldRegisterToBoundary(struct ASQBoundary* Boundary); // Function Squad.SQBoundaryListener.ShouldRegisterToBoundary // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x844fb0
	void OnExitBoundary(struct ASQBoundary* Boundary); // Function Squad.SQBoundaryListener.OnExitBoundary // (Native|Event|Public|BlueprintEvent) // @ game+0x844880
	void OnEnterBoundary(struct ASQBoundary* Boundary); // Function Squad.SQBoundaryListener.OnEnterBoundary // (Native|Event|Public|BlueprintEvent) // @ game+0x8447f0
	struct AActor* GetActor(); // Function Squad.SQBoundaryListener.GetActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x844200
};

// Class Squad.SQBoundary
// Size: 0x308 (Inherited: 0x248)
struct ASQBoundary : AActor {
	struct USplineComponent* XYBoundary; // 0x248(0x08)
	bool bXYBoundaryTangetsInwards; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	int BoundaryMaskSizeX; // 0x254(0x04)
	int BoundaryMaskSizeY; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct UTexture2D* BoundaryMask; // 0x260(0x08)
	float CeilingHeight; // 0x268(0x04)
	float FloorHeight; // 0x26c(0x04)
	float CheckDelaySeconds; // 0x270(0x04)
	bool bDefaultToInside; // 0x274(0x01)
	bool bComplexCheck; // 0x275(0x01)
	char pad_276[0x2]; // 0x276(0x02)
	struct TMap<struct USQBoundaryListener*, struct FSQBoundaryListenerData> ListenerDatas; // 0x278(0x50)
	char pad_2C8[0x28]; // 0x2c8(0x28)
	struct TArray<char> BoundaryMaskData; // 0x2f0(0x10)
	char pad_300[0x8]; // 0x300(0x08)

	bool UnregisterListener(struct USQBoundaryListener* Listener); // Function Squad.SQBoundary.UnregisterListener // (Final|Native|Public|BlueprintCallable) // @ game+0x845130
	bool RegisterListener(struct USQBoundaryListener* Listener, bool bForce); // Function Squad.SQBoundary.RegisterListener // (Final|Native|Public|BlueprintCallable) // @ game+0x844b70
	void OnListenerExitBoundary(struct USQBoundaryListener* Listener); // Function Squad.SQBoundary.OnListenerExitBoundary // (Native|Event|Public|BlueprintEvent) // @ game+0x8449c0
	void OnListenerEnterBoundary(struct USQBoundaryListener* Listener); // Function Squad.SQBoundary.OnListenerEnterBoundary // (Native|Event|Public|BlueprintEvent) // @ game+0x844930
	bool IsInside(struct FVector& Location); // Function Squad.SQBoundary.IsInside // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x844710
	void GenerateBoundaryMask(); // Function Squad.SQBoundary.GenerateBoundaryMask // (Final|Native|Public) // @ game+0x8441e0
	struct FSQBoundaryListenerData FindListenerData(struct USQBoundaryListener* Listener, bool& bOutFound); // Function Squad.SQBoundary.FindListenerData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x843f80
};

// Class Squad.SQBTDecorator_HasLoSTo
// Size: 0x90 (Inherited: 0x68)
struct USQBTDecorator_HasLoSTo : UBTDecorator {
	struct FBlackboardKeySelector EnemyKey; // 0x68(0x28)
};

// Class Squad.SQBTTask_FindPointNearEnemy
// Size: 0x98 (Inherited: 0x98)
struct USQBTTask_FindPointNearEnemy : UBTTask_BlackboardBase {
};

// Class Squad.SQBuffManager
// Size: 0x128 (Inherited: 0xd8)
struct USQBuffManager : UActorComponent {
	struct FSQBuffDesc Buffs[0x4]; // 0xd8(0x20)
	struct FScriptMulticastDelegate BuffAppliedEvent; // 0xf8(0x10)
	struct FScriptMulticastDelegate BuffRemovedEvent; // 0x108(0x10)
	struct FScriptMulticastDelegate BuffEndedEvent; // 0x118(0x10)

	void RemoveBuff(enum class ESQBuffTypes BuffTypeToRemove); // Function Squad.SQBuffManager.RemoveBuff // (Final|Native|Public|BlueprintCallable) // @ game+0x844c30
	void PulseBuff(enum class ESQBuffTypes BuffTypeToApply, float Duration); // Function Squad.SQBuffManager.PulseBuff // (Final|Native|Public|BlueprintCallable) // @ game+0x844ab0
	bool HasBuff(enum class ESQBuffTypes BuffTypeToCheck); // Function Squad.SQBuffManager.HasBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x844680
	void ApplyBuff(enum class ESQBuffTypes BuffTypeToApply, float Duration); // Function Squad.SQBuffManager.ApplyBuff // (Final|Native|Public|BlueprintCallable) // @ game+0x843db0
};

// Class Squad.SQDamageType
// Size: 0x48 (Inherited: 0x40)
struct USQDamageType : UDamageType {
	bool bCanCauseBleeding; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Squad.SQBurningDamage
// Size: 0x48 (Inherited: 0x48)
struct USQBurningDamage : USQDamageType {
};

// Class Squad.SQCameraMan
// Size: 0x6b0 (Inherited: 0x660)
struct ASQCameraMan : ACharacter {
	enum class ESQListenerType ListenerType; // 0x660(0x01)
	char pad_661[0x3]; // 0x661(0x03)
	float BaseTurnRate; // 0x664(0x04)
	float BaseLookUpRate; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct USpringArmComponent* SpringArm; // 0x670(0x08)
	struct UCameraComponent* FirstPersonCameraComponent; // 0x678(0x08)
	struct UTexture* CameraManHUDIconTexture; // 0x680(0x08)
	bool bIsTryingToGainAltitude; // 0x688(0x01)
	bool bIsTryingToLoseAltitude; // 0x689(0x01)
	char pad_68A[0x16]; // 0x68a(0x16)
	struct USQCoreStateComponent* StateObject; // 0x6a0(0x08)
	char pad_6A8[0x8]; // 0x6a8(0x08)

	void ServerSetFlySpeedTarget(float InFlySpeedTarget); // Function Squad.SQCameraMan.ServerSetFlySpeedTarget // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x844d60
	void ServerSetDecelerationTarget(float InDecelerationTarget); // Function Squad.SQCameraMan.ServerSetDecelerationTarget // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x844cb0
	void DrawHUD(struct ASQHUD* SquadHUD, struct UCanvas* Canvas); // Function Squad.SQCameraMan.DrawHUD // (Native|Event|Public|BlueprintEvent) // @ game+0x843eb0
};

// Class Squad.SQGraphNodeComponent
// Size: 0x150 (Inherited: 0xd8)
struct USQGraphNodeComponent : UActorComponent {
	struct URouteSelectorPredicate* RouteSelectorPredicate; // 0xd8(0x08)
	struct URouteSelectorPredicate* RouteSelectorVisualizerPredicate; // 0xe0(0x08)
	struct URouteCombinerPredicate* RouteCombinerPredicate; // 0xe8(0x08)
	struct TSet<struct USQGraphNodeComponent*> DesignOutgoingLinks; // 0xf0(0x50)
	struct TArray<struct USQGraphNodeComponent*> Neighbors; // 0x140(0x10)

	void RemoveNeighbor(struct USQGraphNodeComponent* Neighbor); // Function Squad.SQGraphNodeComponent.RemoveNeighbor // (Final|Native|Public|BlueprintCallable) // @ game+0x881fb0
	void OnNeighborRemoved(struct USQGraphNodeComponent* Neighbor); // Function Squad.SQGraphNodeComponent.OnNeighborRemoved // (Native|Event|Protected|BlueprintEvent) // @ game+0x844880
	void OnNeighborAdded(struct USQGraphNodeComponent* Neighbor); // Function Squad.SQGraphNodeComponent.OnNeighborAdded // (Native|Event|Protected|BlueprintEvent) // @ game+0x881bf0
	void GetNeighbors(struct TArray<struct USQGraphNodeComponent*>& InOutNodes); // Function Squad.SQGraphNodeComponent.GetNeighbors // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x881a60
	void AddNeighbor(struct USQGraphNodeComponent* Neighbor); // Function Squad.SQGraphNodeComponent.AddNeighbor // (Final|Native|Public|BlueprintCallable) // @ game+0x881080
};

// Class Squad.SQCaptureZoneComponent
// Size: 0x248 (Inherited: 0x150)
struct USQCaptureZoneComponent : USQGraphNodeComponent {
	char InitialTeam; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct FText FlagName; // 0x158(0x18)
	char CapturingTeam; // 0x170(0x01)
	char OwningTeam; // 0x171(0x01)
	char LastOwningTeam; // 0x172(0x01)
	bool Uncappable; // 0x173(0x01)
	char pad_174[0x4]; // 0x174(0x04)
	struct TMap<struct ASQGameMode*, struct FCaptureZoneStats> CaptureZoneValues; // 0x178(0x50)
	struct FCaptureZoneStats DefaultCaptureZoneValues; // 0x1c8(0x18)
	float BonusCaptureMultiplier; // 0x1e0(0x04)
	float PlayerAdvantage; // 0x1e4(0x04)
	float CapturePercentDelta; // 0x1e8(0x04)
	float CapturePercent; // 0x1ec(0x04)
	int CapturePercentDirection; // 0x1f0(0x04)
	bool bIsLocked; // 0x1f4(0x01)
	char pad_1F5[0x3]; // 0x1f5(0x03)
	struct FScriptMulticastDelegate CaptureStateChangeEvent; // 0x1f8(0x10)
	struct USQCoreStateComponent* StateObject; // 0x208(0x08)
	char pad_210[0x28]; // 0x210(0x28)
	uint32 TeamCapturabilities; // 0x238(0x04)
	uint32 TeamKnowledge; // 0x23c(0x04)
	char pad_240[0x8]; // 0x240(0x08)

	void UpdateTeamKnowledge(struct TArray<struct USQCaptureZoneComponent*>& TeamOneDir, struct TArray<struct USQCaptureZoneComponent*>& TeamTwoDir); // Function Squad.SQCaptureZoneComponent.UpdateTeamKnowledge // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x8453e0
	void UpdateLockState(); // Function Squad.SQCaptureZoneComponent.UpdateLockState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x8453c0
	void UpdateCaptureState(struct USQCaptureZoneComponent* CaptureZone, char Team); // Function Squad.SQCaptureZoneComponent.UpdateCaptureState // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x8452f0
	void UpdateCanCaptureState(struct TArray<struct USQCaptureZoneComponent*>& TeamOneDir, struct TArray<struct USQCaptureZoneComponent*>& TeamTwoDir); // Function Squad.SQCaptureZoneComponent.UpdateCanCaptureState // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x8451c0
	void UnlockCaptureZone(); // Function Squad.SQCaptureZoneComponent.UnlockCaptureZone // (Final|Native|Public|BlueprintCallable) // @ game+0x8450f0
	bool SetTeamHaveKnowledge(char Team, bool bHaveKnowledge); // Function Squad.SQCaptureZoneComponent.SetTeamHaveKnowledge // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x844ee0
	bool SetTeamCanCapture(char Team, bool bCanCap); // Function Squad.SQCaptureZoneComponent.SetTeamCanCapture // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x844e10
	void OnRep_Uncappable(); // Function Squad.SQCaptureZoneComponent.OnRep_Uncappable // (Final|Native|Private) // @ game+0x844910
	void OnRep_TeamKnowledge(); // Function Squad.SQCaptureZoneComponent.OnRep_TeamKnowledge // (Final|Native|Private) // @ game+0x844a90
	void OnRep_TeamCapturabilities(); // Function Squad.SQCaptureZoneComponent.OnRep_TeamCapturabilities // (Final|Native|Private) // @ game+0x844a70
	void OnRep_OwningTeam(); // Function Squad.SQCaptureZoneComponent.OnRep_OwningTeam // (Final|Native|Private) // @ game+0x844a50
	void OnRep_CapturingTeam(); // Function Squad.SQCaptureZoneComponent.OnRep_CapturingTeam // (Final|Native|Private) // @ game+0x844910
	void OnRep_CapturePercent(); // Function Squad.SQCaptureZoneComponent.OnRep_CapturePercent // (Final|Native|Private) // @ game+0x844910
	void OnIndexedTeamStatesReplicated(); // Function Squad.SQCaptureZoneComponent.OnIndexedTeamStatesReplicated // (Final|Native|Private) // @ game+0x844910
	void Neutralize(); // Function Squad.SQCaptureZoneComponent.Neutralize // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x8447d0
	void LockCaptureZone(); // Function Squad.SQCaptureZoneComponent.LockCaptureZone // (Final|Native|Public|BlueprintCallable) // @ game+0x8447b0
	bool GetTeamHaveKnowledge(char Team); // Function Squad.SQCaptureZoneComponent.GetTeamHaveKnowledge // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8445f0
	void GetPlayersInCaptureZone(struct TArray<struct AActor*>& TeamOne, struct TArray<struct AActor*>& TeamTwo); // Function Squad.SQCaptureZoneComponent.GetPlayersInCaptureZone // (Native|Public|HasOutParms) // @ game+0x8444c0
	bool GetCurrentModeCaptureZoneStats(struct FCaptureZoneStats& OutputCaptureZoneStats); // Function Squad.SQCaptureZoneComponent.GetCurrentModeCaptureZoneStats // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x844420
	void GetCapturezoneDirections(struct TArray<struct USQCaptureZoneComponent*>& TeamOneDir, struct TArray<struct USQCaptureZoneComponent*>& TeamTwoDir); // Function Squad.SQCaptureZoneComponent.GetCapturezoneDirections // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x8442c0
	bool GetCanTeamCapture(char Team); // Function Squad.SQCaptureZoneComponent.GetCanTeamCapture // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x844230
	void FullyCap(char ForTeam); // Function Squad.SQCaptureZoneComponent.FullyCap // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x844160
	struct USQGraphNodeComponent* FindMainBase(char Team, struct TArray<struct USQGraphNodeComponent*>& VisitedNodes); // Function Squad.SQCaptureZoneComponent.FindMainBase // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x844060
	void CaptureTick(); // Function Squad.SQCaptureZoneComponent.CaptureTick // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x843e70
};

// Class Squad.SQCaptureZoneInvasionComponent
// Size: 0x250 (Inherited: 0x248)
struct USQCaptureZoneInvasionComponent : USQCaptureZoneComponent {
	int TeamToLockFor; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
};

// Class Squad.SQCaptureZoneResourceComponent
// Size: 0xd8 (Inherited: 0xd8)
struct USQCaptureZoneResourceComponent : UActorComponent {
};

// Class Squad.SQCaptureZoneTCComponent
// Size: 0x248 (Inherited: 0x248)
struct USQCaptureZoneTCComponent : USQCaptureZoneComponent {
};

// Class Squad.SQChatWidgetStyle
// Size: 0x930 (Inherited: 0x30)
struct USQChatWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSQChatStyle ChatStyle; // 0x30(0x900)
};

// Class Squad.SQCheatManager
// Size: 0x78 (Inherited: 0x78)
struct USQCheatManager : UCheatManager {

	void SqDumpPakContents(struct FString OutputFilename); // Function Squad.SQCheatManager.SqDumpPakContents // (Final|Exec|Native|Private) // @ game+0x845050
};

// Class Squad.SQChunkSettings
// Size: 0x88 (Inherited: 0x38)
struct USQChunkSettings : UDeveloperSettings {
	struct TArray<struct USQLevel*> LevelsToCook; // 0x38(0x10)
	struct TArray<struct USQLayer*> LayersToCook; // 0x48(0x10)
	struct TArray<struct USQFaction*> FactionsToCook; // 0x58(0x10)
	struct TArray<struct USQFactionSetup*> FactionSetupsToCook; // 0x68(0x10)
	struct TArray<struct FSQChunkRule> ChunkRules; // 0x78(0x10)

	struct USQChunkSettings* GetChunkSettings(); // Function Squad.SQChunkSettings.GetChunkSettings // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x8443f0
	void CollectLayersFromLevels(); // Function Squad.SQChunkSettings.CollectLayersFromLevels // (Final|Native|Public|BlueprintCallable) // @ game+0x843e90
	void CollectFactionSetupsFromFactions(); // Function Squad.SQChunkSettings.CollectFactionSetupsFromFactions // (Final|Native|Public|BlueprintCallable) // @ game+0x843e90
};

// Class Squad.SQClientsideWeaponSettings
// Size: 0x60 (Inherited: 0x38)
struct USQClientsideWeaponSettings : UDeveloperSettings {
	float MaxVerificationAngle; // 0x38(0x04)
	float ShotTimeout; // 0x3c(0x04)
	float SlowProjectileTimeout; // 0x40(0x04)
	bool bNotifyPlayerOnShotFail; // 0x44(0x01)
	bool bNotifyAdminOnShotFail; // 0x45(0x01)
	bool bNotifyPlayerOnHitFail; // 0x46(0x01)
	bool bNotifyAdminOnHitFail; // 0x47(0x01)
	struct TArray<enum class ESQHitDetectionFailReason> NotifyOnlyOnTheseFailureReasons; // 0x48(0x10)
	int ConsecutiveFailedShotKickAmount; // 0x58(0x04)
	int ConsecutiveFailedHitKickAmount; // 0x5c(0x04)
};

// Class Squad.SQCloudServicesSubsystemBase
// Size: 0x78 (Inherited: 0x30)
struct USQCloudServicesSubsystemBase : UGameInstanceSubsystem {
	char pad_30[0x48]; // 0x30(0x48)
};

// Class Squad.SQCloudServicesSubsystemClient
// Size: 0x78 (Inherited: 0x78)
struct USQCloudServicesSubsystemClient : USQCloudServicesSubsystemBase {
};

// Class Squad.SQCloudServicesSubsystemServer
// Size: 0x78 (Inherited: 0x78)
struct USQCloudServicesSubsystemServer : USQCloudServicesSubsystemBase {
};

// Class Squad.SQCollisionDamage
// Size: 0x110 (Inherited: 0xd8)
struct USQCollisionDamage : UActorComponent {
	float MinDamage; // 0xd8(0x04)
	float MaxDamage; // 0xdc(0x04)
	float MinImpactForce; // 0xe0(0x04)
	float MaxImpactForce; // 0xe4(0x04)
	struct UCurveFloat* InterpCurve; // 0xe8(0x08)
	struct USoundCue* CollisionSound; // 0xf0(0x08)
	struct UParticleSystem* ParticleEffect; // 0xf8(0x08)
	struct UCameraShake* CollisionCameraShake; // 0x100(0x08)
	float MinShakeForce; // 0x108(0x04)
	float MaxShakeForce; // 0x10c(0x04)

	void OnActorHit(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Squad.SQCollisionDamage.OnActorHit // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x852950
	float CalculateDamage(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Squad.SQCollisionDamage.CalculateDamage // (Native|Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8520e0
	void ApplyDamage(float damage); // Function Squad.SQCollisionDamage.ApplyDamage // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x851d60
};

// Class Squad.SQColorsDataAsset
// Size: 0xb0 (Inherited: 0x30)
struct USQColorsDataAsset : UDataAsset {
	struct FLinearColor TintColors[0x7]; // 0x30(0x70)
	struct TArray<struct FLinearColor> FireTeamColors; // 0xa0(0x10)

	struct FLinearColor GetColor(enum class ESQMapWidgetTint TintValue, int FireTeamIndex); // Function Squad.SQColorsDataAsset.GetColor // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x8527a0
};

// Class Squad.SQCommandActor
// Size: 0x268 (Inherited: 0x248)
struct ASQCommandActor : AActor {
	float distance; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct USQGridData_CommandOption* Action; // 0x250(0x08)
	int Team; // 0x258(0x04)
	struct TWeakObjectPtr<struct AController> DamageInstigatorController; // 0x25c(0x08)
	char pad_264[0x4]; // 0x264(0x04)

	void OnRep_Action(); // Function Squad.SQCommandActor.OnRep_Action // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQCommanderInputComponent
// Size: 0xe8 (Inherited: 0xd8)
struct USQCommanderInputComponent : UActorComponent {
	struct FScriptMulticastDelegate OnCommanderRevivedEvent; // 0xd8(0x10)

	void VotePlayer(struct ASQPlayerState* Player); // Function Squad.SQCommanderInputComponent.VotePlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x853370
	void ServerVoteForCommander(struct ASQPlayerState* Nominee); // Function Squad.SQCommanderInputComponent.ServerVoteForCommander // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x8532b0
	void ServerRequestSupportAtLocation(struct FVector WorldLocation); // Function Squad.SQCommanderInputComponent.ServerRequestSupportAtLocation // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x853200
	void ServerRequestCreateCommandActor(struct USQGridData_CommandOption* CommandOption, struct FTransform Transform, float distance); // Function Squad.SQCommanderInputComponent.ServerRequestCreateCommandActor // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0x853080
	void ServerRequestCommandActorDestroyed(struct USQGridData_CommandOption* CommandOption); // Function Squad.SQCommanderInputComponent.ServerRequestCommandActorDestroyed // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x852fc0
	void ServerMakePlayerCommander(struct ASQPlayerState* NewCommander); // Function Squad.SQCommanderInputComponent.ServerMakePlayerCommander // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x852f00
	void ServerDemoteCommander(); // Function Squad.SQCommanderInputComponent.ServerDemoteCommander // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x852eb0
	void ServerDebugDisableVoteRequirements(); // Function Squad.SQCommanderInputComponent.ServerDebugDisableVoteRequirements // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x852e60
	void ServerAttemptSetActionsUsableState(bool bNewActionsEnabled); // Function Squad.SQCommanderInputComponent.ServerAttemptSetActionsUsableState // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x852da0
	void RequestSupportAtLocation(struct FVector& WorldLocation); // Function Squad.SQCommanderInputComponent.RequestSupportAtLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x852d10
	void RequestPromoteCommander(); // Function Squad.SQCommanderInputComponent.RequestPromoteCommander // (Final|Native|Public|BlueprintCallable) // @ game+0x852cf0
	void RequestDemoteCommander(); // Function Squad.SQCommanderInputComponent.RequestDemoteCommander // (Final|Native|Public|BlueprintCallable) // @ game+0x852cd0
	void RequestCreateCommandActor(struct USQGridData_CommandOption* CommandOption, struct FTransform& Transform, float distance); // Function Squad.SQCommanderInputComponent.RequestCreateCommandActor // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x852b70
	void RequestCommandActorDestroyed(struct USQGridData_CommandOption* CommandOption); // Function Squad.SQCommanderInputComponent.RequestCommandActorDestroyed // (Final|Native|Public|BlueprintCallable) // @ game+0x852af0
	void DebugVoteForCommander(struct FString PlayerName); // Function Squad.SQCommanderInputComponent.DebugVoteForCommander // (Final|Exec|Native|Public) // @ game+0x852700
	void DebugDisableVoteRequirements(); // Function Squad.SQCommanderInputComponent.DebugDisableVoteRequirements // (Exec|Native|Public) // @ game+0x829fd0
	void DebugDemoteCommander(); // Function Squad.SQCommanderInputComponent.DebugDemoteCommander // (Exec|Native|Public) // @ game+0x829740
	void DebugBecomeCommander(); // Function Squad.SQCommanderInputComponent.DebugBecomeCommander // (Final|Exec|Native|Public) // @ game+0x8526e0
	void ClientActionAttemptFinished(); // Function Squad.SQCommanderInputComponent.ClientActionAttemptFinished // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x8526c0
	void AttemptSetActionsUsableState(bool bNewActionsEnabled); // Function Squad.SQCommanderInputComponent.AttemptSetActionsUsableState // (Final|Native|Public|BlueprintCallable) // @ game+0x851de0
};

// Class Squad.SQGridData_BaseOption
// Size: 0x60 (Inherited: 0x28)
struct USQGridData_BaseOption : UObject {
	struct FString DisplayName; // 0x28(0x10)
	struct FString Description; // 0x38(0x10)
	struct UTexture2D* Texture; // 0x48(0x08)
	struct FLinearColor Tint; // 0x50(0x10)
};

// Class Squad.SQGridData_CommandOption
// Size: 0x138 (Inherited: 0x60)
struct USQGridData_CommandOption : USQGridData_BaseOption {
	char CategoryId; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct ASQCommandActor* CommandActor; // 0x68(0x08)
	struct UUserWidget* ControlWidget; // 0x70(0x08)
	float EnrouteDuration; // 0x78(0x04)
	float ActiveDuration; // 0x7c(0x04)
	float CooldownDuration; // 0x80(0x04)
	float IconAngleOffset; // 0x84(0x04)
	float MaxAngleFromBase; // 0x88(0x04)
	bool CreateMapMarker; // 0x8c(0x01)
	bool bAllowedInVehicle; // 0x8d(0x01)
	bool bIgnoreActionEnabled; // 0x8e(0x01)
	char pad_8F[0x1]; // 0x8f(0x01)
	struct ASQMapMarker* MapMarkerClass; // 0x90(0x08)
	struct FSQCommanderActionSounds CommanderActionSoundsList; // 0x98(0xa0)
};

// Class Squad.SQGridData_CommandOption_Distance
// Size: 0x140 (Inherited: 0x138)
struct USQGridData_CommandOption_Distance : USQGridData_CommandOption {
	float MinimumDistance; // 0x138(0x04)
	float MaximumDistance; // 0x13c(0x04)
};

// Class Squad.SQTeam
// Size: 0x2c0 (Inherited: 0x248)
struct ASQTeam : AInfo {
	struct ASQTeamState* TeamStateClass; // 0x248(0x08)
	struct ASQTeamStatePrivate* PrivateTeamStateClass; // 0x250(0x08)
	struct ASQTeamState* TeamState; // 0x258(0x08)
	struct ASQTeamStatePrivate* PrivateTeamState; // 0x260(0x08)
	struct TArray<struct ASQSquad*> Squads; // 0x268(0x10)
	struct TArray<struct ASQSquad*> IndexedSquads; // 0x278(0x10)
	struct ASQPlayerController* Commander; // 0x288(0x08)
	struct ASQSquad* CommandSquad; // 0x290(0x08)
	struct USQCommanderManager* CommanderManager; // 0x298(0x08)
	struct USQLayerTeamConfig* TeamLayerConfig; // 0x2a0(0x08)
	char pad_2A8[0x18]; // 0x2a8(0x18)

	void UpdateAvailabilities(); // Function Squad.SQTeam.UpdateAvailabilities // (Final|Native|Private|BlueprintCallable) // @ game+0x8f67c0
	bool TryGetFactionSetupDisplayName(struct FText& OutDisplayName); // Function Squad.SQTeam.TryGetFactionSetupDisplayName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f66d0
	bool TryGetFactionDisplayName(struct FText& OutDisplayName); // Function Squad.SQTeam.TryGetFactionDisplayName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f65e0
	void SetTeamConfig(struct USQLayerTeamConfig* InLayerTeamConfig); // Function Squad.SQTeam.SetTeamConfig // (Final|Native|Public|BlueprintCallable) // @ game+0x8f6560
	void SetFactionSetup(struct USQFactionSetup* InFactionSetup); // Function Squad.SQTeam.SetFactionSetup // (Final|Native|Public|BlueprintCallable) // @ game+0x8f64e0
	bool Request_Team_Vehicle(struct FSQAvailabilityState_Vehicle& VehicleStatus); // Function Squad.SQTeam.Request_Team_Vehicle // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f6330
	bool Request_Team_Deployable(struct FSQAvailabilityState_Deployable& DeployableStatus); // Function Squad.SQTeam.Request_Team_Deployable // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f6260
	bool Request_Player_Vehicle(struct FName& VehicleId, struct ASQPlayerController* InPlayer, struct USQVehicleSettings*& OutSetting, struct FDataTableRowHandle& OutUnavailabilityReason); // Function Squad.SQTeam.Request_Player_Vehicle // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f60b0
	bool Request_Player_Role_Rearm(struct FName& RoleId, struct ASQPlayerController* InPlayer, struct TScriptInterface<Class>& InRearmSource, struct USQRoleSettings*& OutSetting, struct FDataTableRowHandle& OutUnavailabilityReason); // Function Squad.SQTeam.Request_Player_Role_Rearm // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5eb0
	bool Request_Player_Role(struct FName& RoleId, struct ASQPlayerController* InPlayer, struct USQRoleSettings*& OutSetting, struct FDataTableRowHandle& OutUnavailabilityReason); // Function Squad.SQTeam.Request_Player_Role // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5d00
	bool Request_Player_Deployable_Refund(struct ASQPlayerController* InPlayer, struct ASQDeployable* InDeployable); // Function Squad.SQTeam.Request_Player_Deployable_Refund // (Final|Native|Public|BlueprintCallable) // @ game+0x8f5c40
	bool Request_Player_Deployable(struct FName& DeployableId, struct ASQPlayerController* InPlayer, struct USQDeployableSettings*& OutSetting, struct FDataTableRowHandle& OutUnavailabilityReason); // Function Squad.SQTeam.Request_Player_Deployable // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5a90
	bool Request_Player_Action(struct FName& ActionId, struct ASQPlayerController* InPlayer, struct USQActionSettings* OutSetting, struct FDataTableRowHandle& OutUnavailabilityReason); // Function Squad.SQTeam.Request_Player_Action // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5900
	void Release_Vehicle(struct FName& SettingId, int Index); // Function Squad.SQTeam.Release_Vehicle // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5830
	void Release_Role(struct FName& SettingId); // Function Squad.SQTeam.Release_Role // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f57a0
	void Release_Deployable(struct FName& SettingId); // Function Squad.SQTeam.Release_Deployable // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5710
	void Release_Action(struct FName& SettingId); // Function Squad.SQTeam.Release_Action // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x8f5680
	bool IsConfigured(); // Function Squad.SQTeam.IsConfigured // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f5430
	void InitializeAvailabilities(); // Function Squad.SQTeam.InitializeAvailabilities // (Final|Native|Private|BlueprintCallable) // @ game+0x8f5380
	bool HasFactionSetup(); // Function Squad.SQTeam.HasFactionSetup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f5350
	int GetTeamId(); // Function Squad.SQTeam.GetTeamId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f5320
	int GetPlayerCount(); // Function Squad.SQTeam.GetPlayerCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f5270
	struct FString GetNatoStringOrSquadString(int Idx); // Function Squad.SQTeam.GetNatoStringOrSquadString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x8f51a0
	struct USQRoleSettings* GetLeaveSquadRole(); // Function Squad.SQTeam.GetLeaveSquadRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f5170
	struct FName GetFactionSetupId(); // Function Squad.SQTeam.GetFactionSetupId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4e70
	struct FString GetFactionSetupDisplayName(); // Function Squad.SQTeam.GetFactionSetupDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4de0
	struct USQFactionSetup* GetFactionSetup(); // Function Squad.SQTeam.GetFactionSetup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4db0
	struct FName GetFactionId(); // Function Squad.SQTeam.GetFactionId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4d70
	struct FString GetFactionDisplayName(); // Function Squad.SQTeam.GetFactionDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4ce0
	struct USQFaction* GetFaction(); // Function Squad.SQTeam.GetFaction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4cb0
	struct USQRoleSettings* GetDefaultSquadLeaderRole(); // Function Squad.SQTeam.GetDefaultSquadLeaderRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4c80
	struct USQRoleSettings* GetDefaultRole(); // Function Squad.SQTeam.GetDefaultRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8f4c50
	void ApplySlomoFactor(float TimeDilationFactor); // Function Squad.SQTeam.ApplySlomoFactor // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x8f4b20
};

// Class Squad.SQCommanderManager
// Size: 0x190 (Inherited: 0xd8)
struct USQCommanderManager : UActorComponent {
	struct ASQCommanderState* CommanderState; // 0xd8(0x08)
	struct UDataTable* TeamCommands; // 0xe0(0x08)
	struct TArray<struct FCommanderCategory> Categories; // 0xe8(0x10)
	int MinimumSquadSizeForVoting; // 0xf8(0x04)
	int MinimumSquadsRequiredForVoting; // 0xfc(0x04)
	int VotingTimeSeconds; // 0x100(0x04)
	bool bDoubleCaptureSpeed; // 0x104(0x01)
	char pad_105[0x3]; // 0x105(0x03)
	float ActionCooldownExtensionOnNewCommander; // 0x108(0x04)
	int VoteCooldownTimeSeconds; // 0x10c(0x04)
	char pad_110[0x20]; // 0x110(0x20)
	bool bCommanderActive; // 0x130(0x01)
	char pad_131[0x5f]; // 0x131(0x5f)

	struct FSQCommandActionData GetInterval(struct USQGridData_CommandOption* CommandOption, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.GetInterval // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x852870
	void CommanderChangedDelegate__DelegateSignature(struct ASQPlayerState* OldCommander); // DelegateFunction Squad.SQCommanderManager.CommanderChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x12b8b50
	bool CanUseAction(struct USQGridData_CommandOption* CommandOption, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.CanUseAction // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x852600
	float CalculateTotalTimeRemaining(struct USQGridData_CommandOption* CommandOption, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.CalculateTotalTimeRemaining // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x852540
	float CalculateStateTimeRemaining(struct USQGridData_CommandOption* CommandOption, struct ASQCommanderState* SQCommanderState, enum class ESQCommandOptionState& CommandOptionState); // Function Squad.SQCommanderManager.CalculateStateTimeRemaining // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x852440
	float CalculateStatePercentTimeRemaining(struct USQGridData_CommandOption* CommandOption, struct ASQCommanderState* SQCommanderState, enum class ESQCommandOptionState& CommandOptionState); // Function Squad.SQCommanderManager.CalculateStatePercentTimeRemaining // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x852340
	enum class ESQCommandOptionState CalculateState(struct USQGridData_CommandOption* CommandOption, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.CalculateState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x852280
	float CalculateCategoryPercentRemainingTime(char& CommandOptionType, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.CalculateCategoryPercentRemainingTime // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x852010
	bool CalculateCategoryLocked(char& CommandOptionType, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.CalculateCategoryLocked // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x851f40
	float CalculateCategoryCurrentRemainingTime(char& CommandOptionType, struct ASQCommanderState* SQCommanderState); // Function Squad.SQCommanderManager.CalculateCategoryCurrentRemainingTime // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x851e70
};

// Class Squad.SQCommanderState
// Size: 0x538 (Inherited: 0x248)
struct ASQCommanderState : AInfo {
	bool bVoteInProgress; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	int CommanderVoteTimestamp; // 0x24c(0x04)
	int CommanderVoteTimer; // 0x250(0x04)
	bool bVoteCooldownActive; // 0x254(0x01)
	char pad_255[0x3]; // 0x255(0x03)
	int VoteCooldownTimer; // 0x258(0x04)
	int VoteCooldownTimeSeconds; // 0x25c(0x04)
	int VoteCooldownTimestamp; // 0x260(0x04)
	bool bCommanderIsActive; // 0x264(0x01)
	bool bCommandActionAttempted; // 0x265(0x01)
	bool bDoubleCaptureSpeed; // 0x266(0x01)
	char pad_267[0x11]; // 0x267(0x11)
	struct TArray<struct FCommanderCategory> CommanderCategories; // 0x278(0x10)
	int MinimumSquadSizeForVoting; // 0x288(0x04)
	int MinimumSquadsRequiredForVoting; // 0x28c(0x04)
	int VotingTimeSeconds; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct FSQCommanderActionDataArray CommandIntervals; // 0x298(0x118)
	struct TArray<float> LastCategoryGameTime; // 0x3b0(0x10)
	struct UDataTable* TeamCommands; // 0x3c0(0x08)
	struct FCommanderNomineeArray NomineeStatus; // 0x3c8(0x118)
	char pad_4E0[0x8]; // 0x4e0(0x08)
	struct FScriptMulticastDelegate OnCommanderChangedEvent; // 0x4e8(0x10)
	struct FScriptMulticastDelegate OnNominationAvailableEvent; // 0x4f8(0x10)
	struct FScriptMulticastDelegate OnNominationEndedEvent; // 0x508(0x10)
	struct FScriptMulticastDelegate OnNominationStartedEvent; // 0x518(0x10)
	struct ASQPlayerState* CurrentCommander; // 0x528(0x08)
	bool bActionsEnabled; // 0x530(0x01)
	char pad_531[0x7]; // 0x531(0x07)

	void OnRep_VoteInProgressChanged(); // Function Squad.SQCommanderState.OnRep_VoteInProgressChanged // (Final|Native|Public) // @ game+0x856cd0
	void OnRep_CurrentCommander(struct ASQPlayerState* OldCommander); // Function Squad.SQCommanderState.OnRep_CurrentCommander // (Final|Native|Private) // @ game+0x856bd0
	bool IsCommanderActionAllowed(struct USQGridData_CommandOption* CommandOption); // Function Squad.SQCommanderState.IsCommanderActionAllowed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x856ac0
	struct ASQPlayerState* GetCurrentCommander(); // Function Squad.SQCommanderState.GetCurrentCommander // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x856940
	struct TArray<struct USQGridData_CommandOption*> GetCommandActionsById(char& ID); // Function Squad.SQCommanderState.GetCommandActionsById // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x856850
	struct TArray<struct USQGridData_CommandOption*> GetCommandActions(); // Function Squad.SQCommanderState.GetCommandActions // (Final|Native|Public|BlueprintCallable) // @ game+0x8567c0
	bool GetActionsEnabled(); // Function Squad.SQCommanderState.GetActionsEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x856790
};

// Class Squad.SQCommanderVotingPlayerItem
// Size: 0x250 (Inherited: 0x230)
struct USQCommanderVotingPlayerItem : USQUserWidget {
	bool bIsVotedByPlayer; // 0x230(0x01)
	char pad_231[0x3]; // 0x231(0x03)
	int VoteCount; // 0x234(0x04)
	struct FString NomineeName; // 0x238(0x10)
	struct ASQPlayerState* NomineePlayerState; // 0x248(0x08)

	void OnVoteCountChanged(); // Function Squad.SQCommanderVotingPlayerItem.OnVoteCountChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnNomineeNameChanged(); // Function Squad.SQCommanderVotingPlayerItem.OnNomineeNameChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnIsVotedByPlayerChanged(); // Function Squad.SQCommanderVotingPlayerItem.OnIsVotedByPlayerChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQCommanderVotingWidget
// Size: 0x250 (Inherited: 0x230)
struct USQCommanderVotingWidget : USQUserWidget {
	bool bIsVotingAvailable; // 0x230(0x01)
	bool bIsVotePending; // 0x231(0x01)
	bool bIsVoteInProgress; // 0x232(0x01)
	char pad_233[0x5]; // 0x233(0x05)
	struct USQCommanderVotingPlayerItem* VoteItemClass; // 0x238(0x08)
	struct UPanelWidget* VoteItemsParent; // 0x240(0x08)
	char pad_248[0x8]; // 0x248(0x08)

	void UpdateFromData(); // Function Squad.SQCommanderVotingWidget.UpdateFromData // (Final|Native|Public|BlueprintCallable) // @ game+0x857230
	void OnVotingTimeChanged(float Seconds); // Function Squad.SQCommanderVotingWidget.OnVotingTimeChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnIsVotingAvailableChanged(); // Function Squad.SQCommanderVotingWidget.OnIsVotingAvailableChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void OnIsVoteInProgressChanged(); // Function Squad.SQCommanderVotingWidget.OnIsVoteInProgressChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void Init(); // Function Squad.SQCommanderVotingWidget.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x856990
};

// Class Squad.SQCompass
// Size: 0x250 (Inherited: 0x230)
struct USQCompass : USQUserWidget {
	bool bIsOwnerMedic; // 0x230(0x01)
	char pad_231[0x3]; // 0x231(0x03)
	float RotationXFix; // 0x234(0x04)
	float XScale; // 0x238(0x04)
	float MaxVisibilityDistance; // 0x23c(0x04)
	float YPositionOffset; // 0x240(0x04)
	float TotalScale; // 0x244(0x04)
	float BearingLERP; // 0x248(0x04)
	bool bDoCompassLERP; // 0x24c(0x01)
	bool bShouldHide; // 0x24d(0x01)
	char pad_24E[0x2]; // 0x24e(0x02)
};

// Class Squad.SQCompassBaseUnit
// Size: 0x238 (Inherited: 0x230)
struct USQCompassBaseUnit : USQUserWidget {
	struct UImage* BaseImage; // 0x230(0x08)
};

// Class Squad.SQCompassMarker
// Size: 0x330 (Inherited: 0x238)
struct USQCompassMarker : USQCompassBaseUnit {
	struct FLinearColor MarkerColor; // 0x238(0x10)
	struct UCurveFloat* DistanceResolutionCurveInMeters; // 0x248(0x08)
	struct ASQMapMarker* MapMarker; // 0x250(0x08)
	struct FSQMapMarkerVisualData MapMarkerVisualData; // 0x258(0xc8)
	struct UTextBlock* DistanceTextBlock; // 0x320(0x08)
	struct UTextBlock* MeterTextBlock; // 0x328(0x08)

	void UpdateState(float InScale, bool bShowIcon); // Function Squad.SQCompassMarker.UpdateState // (Native|Public|BlueprintCallable) // @ game+0x8573d0
	void InitWidget(); // Function Squad.SQCompassMarker.InitWidget // (Native|Public|BlueprintCallable) // @ game+0x829fd0
};

// Class Squad.SQCompassMK2
// Size: 0x2e8 (Inherited: 0x250)
struct USQCompassMK2 : USQCompass {
	struct UCanvasPanel* MainP; // 0x250(0x08)
	struct UTextBlock* CompassBearingText; // 0x258(0x08)
	struct UImage* LeftArrow; // 0x260(0x08)
	struct UImage* RightArrow; // 0x268(0x08)
	struct UMaterialInstanceDynamic* CompassMID; // 0x270(0x08)
	struct FName BearingMatParamName; // 0x278(0x08)
	struct ASQPlayerState* InitialPlayerState; // 0x280(0x08)
	float MarkerYPositionOffset; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct TArray<struct USQCompassPlayer*> TrackedSquadMatesWidgets; // 0x290(0x10)
	struct UCurveFloat* DistanceCurve; // 0x2a0(0x08)
	bool bAlwaysShowSquadLeader; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct TArray<struct USQCompassMarker*> TrackedMarkerWidgets; // 0x2b0(0x10)
	struct TArray<enum class ESQMapMarkerType> MarkerTypesToTrack; // 0x2c0(0x10)
	float CompassEdgeFadePercentage; // 0x2d0(0x04)
	float CompassEdgeMinFade; // 0x2d4(0x04)
	struct USQCompassPlayer* CompassPlayerType; // 0x2d8(0x08)
	struct USQCompassMarker* CompassMarkerType; // 0x2e0(0x08)

	void UpdateVisibility(); // Function Squad.SQCompassMK2.UpdateVisibility // (Native|Public|BlueprintCallable) // @ game+0x829740
	void UpdateSquadMembers(); // Function Squad.SQCompassMK2.UpdateSquadMembers // (Native|Public|BlueprintCallable) // @ game+0x8573b0
	void UpdateSquadMarkers(); // Function Squad.SQCompassMK2.UpdateSquadMarkers // (Native|Public|BlueprintCallable) // @ game+0x857390
	float UpdatePlayerWidgetTransform(bool& bShowIcon, struct ASQSoldier* SoldierRef, struct USQCompassPlayer* WidgetRef); // Function Squad.SQCompassMK2.UpdatePlayerWidgetTransform // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x857270
	void UpdateMarkerArrows(); // Function Squad.SQCompassMK2.UpdateMarkerArrows // (Native|Public|BlueprintCallable) // @ game+0x857250
	void UpdateCompassBearing(); // Function Squad.SQCompassMK2.UpdateCompassBearing // (Native|Public|BlueprintCallable) // @ game+0x829fd0
	void SquadChangedHandler(struct ASQSquadState* NewSquad, struct ASQSquadState* OldSquad, struct ASQPlayerState* Player); // Function Squad.SQCompassMK2.SquadChangedHandler // (Final|Native|Public|BlueprintCallable) // @ game+0x857130
	void RemoveMarker(struct AActor* DestroyedActor); // Function Squad.SQCompassMK2.RemoveMarker // (Final|Native|Public|BlueprintCallable) // @ game+0x856ef0
	void RemoveCompassMarker(char ID); // Function Squad.SQCompassMK2.RemoveCompassMarker // (Final|Native|Public) // @ game+0x856e70
	void PlayerLeftSquad(struct ASQSquadState* Squad, struct ASQPlayerState* PlayerState); // Function Squad.SQCompassMK2.PlayerLeftSquad // (Final|Native|Public|BlueprintCallable) // @ game+0x856db0
	void PlayerJoinedSquad(struct ASQSquadState* Squad, struct ASQPlayerState* PlayerState); // Function Squad.SQCompassMK2.PlayerJoinedSquad // (Final|Native|Public|BlueprintCallable) // @ game+0x856cf0
	void InitWidget(); // Function Squad.SQCompassMK2.InitWidget // (Native|Public|BlueprintCallable) // @ game+0x856aa0
	void CreateSquadMateWidget(struct ASQPlayerState* SquadMate); // Function Squad.SQCompassMK2.CreateSquadMateWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x856710
	void CreateNewMarker(int SquadId, struct ASQMapMarker* Marker); // Function Squad.SQCompassMK2.CreateNewMarker // (Final|Native|Public|BlueprintCallable) // @ game+0x856650
	void CreateNewCompassMarker(struct FSQMapMarkerVisualData MapMarkerVisualData); // Function Squad.SQCompassMK2.CreateNewCompassMarker // (Final|Native|Public) // @ game+0x856540
};

// Class Squad.SQCompassPlayer
// Size: 0x2b0 (Inherited: 0x238)
struct USQCompassPlayer : USQCompassBaseUnit {
	struct UImage* MedicIcon; // 0x238(0x08)
	struct FLinearColor ColorHealthy; // 0x240(0x10)
	struct FLinearColor ColorWounded; // 0x250(0x10)
	struct FLinearColor ColorDown; // 0x260(0x10)
	struct FLinearColor ColorInvisible; // 0x270(0x10)
	struct UTexture2D* TexturePlayer; // 0x280(0x08)
	struct UTexture2D* TextureSL; // 0x288(0x08)
	struct UTexture2D* TextureMedic; // 0x290(0x08)
	float PlayerIconScale; // 0x298(0x04)
	float SLPlayerIconScale; // 0x29c(0x04)
	float MedicPlayerIconScale; // 0x2a0(0x04)
	float MedicIconScale; // 0x2a4(0x04)
	struct ASQPlayerState* PlayerState; // 0x2a8(0x08)

	void UpdateState(float InScale, bool bShowIcon, int HealthStateIndex, bool bIsMedic, bool bIsSL, bool bIsOwnderMedic); // Function Squad.SQCompassPlayer.UpdateState // (Native|Public|BlueprintCallable) // @ game+0x8574a0
	void InitWidget(); // Function Squad.SQCompassPlayer.InitWidget // (Native|Public|BlueprintCallable) // @ game+0x829fd0
};

// Class Squad.SQConfig
// Size: 0x470 (Inherited: 0x28)
struct USQConfig : UObject {
	bool ConfigLoaded; // 0x28(0x01)
	char pad_29[0x247]; // 0x29(0x247)
	struct FString AnnouncementURL; // 0x270(0x10)
	struct FString AnnouncementHeaderURL; // 0x280(0x10)
	char pad_290[0x1e0]; // 0x290(0x1e0)
};

// Class Squad.SQConnectionCheckBeaconClient
// Size: 0x2d8 (Inherited: 0x2c8)
struct ASQConnectionCheckBeaconClient : AOnlineBeaconClient {
	struct USQServerListItemWidget* ServerWidget; // 0x2c8(0x08)
	char pad_2D0[0x8]; // 0x2d0(0x08)

	void ServerPong(struct FSQConnectionCheckResponse response); // Function Squad.SQConnectionCheckBeaconClient.ServerPong // (Net|NetReliableNative|Event|NetMulticast|Public|NetValidate) // @ game+0x856fc0
	void InitConnection(struct FString ServerURL); // Function Squad.SQConnectionCheckBeaconClient.InitConnection // (Final|Native|Public|BlueprintCallable) // @ game+0x8569b0
};

// Class Squad.SQConnectionCheckBeaconHostObj
// Size: 0x270 (Inherited: 0x270)
struct ASQConnectionCheckBeaconHostObj : AOnlineBeaconHostObject {
};

// Class Squad.SQGameViewportClient
// Size: 0x300 (Inherited: 0x2e8)
struct USQGameViewportClient : UGameViewportClient {
	char pad_2E8[0x18]; // 0x2e8(0x18)
};

// Class Squad.SQConsole
// Size: 0x150 (Inherited: 0x130)
struct USQConsole : UConsole {
	enum class ESQConsoleMessageType MessageType; // 0x130(0x01)
	char pad_131[0x7]; // 0x131(0x07)
	struct FString CustomMessage; // 0x138(0x10)
	float LastMessageTime; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
};

// Class Squad.SQConsoleVariablesComponent
// Size: 0x128 (Inherited: 0xd8)
struct USQConsoleVariablesComponent : UActorComponent {
	char pad_D8[0x50]; // 0xd8(0x50)
};

// Class Squad.SQConstructionResource
// Size: 0x280 (Inherited: 0x280)
struct ASQConstructionResource : ASQVehicleResource {
};

// Class Squad.SQCoreStateComponent
// Size: 0x110 (Inherited: 0xd8)
struct USQCoreStateComponent : UActorComponent {
	struct USQCoreStateData* DataClass; // 0xd8(0x08)
	char pad_E0[0x8]; // 0xe0(0x08)
	struct USQCoreStateData* DataObject; // 0xe8(0x08)
	struct TArray<struct USQCoreStateConnection*> Connections; // 0xf0(0x10)
	char pad_100[0x10]; // 0x100(0x10)

	void ServerSetIsVisible(bool bValue); // Function Squad.SQCoreStateComponent.ServerSetIsVisible // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x857070
	void ServerConfigure(); // Function Squad.SQCoreStateComponent.ServerConfigure // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x856f70
	void OnRep_DataObject(struct USQCoreStateData* PrevDataObject); // Function Squad.SQCoreStateComponent.OnRep_DataObject // (Final|Native|Private) // @ game+0x856c50
	void OnConnectionCreate(struct USQCoreStateConnection* Connection); // Function Squad.SQCoreStateComponent.OnConnectionCreate // (Final|Native|Private) // @ game+0x856b50
	struct FSQCoreStateId GetId(); // Function Squad.SQCoreStateComponent.GetId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x856960
};

// Class Squad.SQCoreStateConnection
// Size: 0x148 (Inherited: 0xd8)
struct USQCoreStateConnection : UActorComponent {
	char pad_D8[0x10]; // 0xd8(0x10)
	struct TArray<struct USQCoreStateComponent*> ComponentList; // 0xe8(0x10)
	struct TMap<struct UActorChannel*, struct FSQCoreStateDataToIdMap> RemovedDataLists; // 0xf8(0x50)

	void OnComponentObtainedId(struct USQCoreStateComponent* Component); // Function Squad.SQCoreStateConnection.OnComponentObtainedId // (Final|Native|Private) // @ game+0x85ad70
};

// Class Squad.SQCoreStateConnectionActor
// Size: 0x250 (Inherited: 0x248)
struct ASQCoreStateConnectionActor : AInfo {
	struct USQCoreStateConnection* StateConnection; // 0x248(0x08)
};

// Class Squad.SQCoreStateConnectionChildActorComponent
// Size: 0x260 (Inherited: 0x250)
struct USQCoreStateConnectionChildActorComponent : UChildActorComponent {
	float NetPriority; // 0x248(0x04)
	float NetUpdateFrequency; // 0x24c(0x04)
	float MinNetUpdateFrequency; // 0x250(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
};

// Class Squad.SQCoreStateData
// Size: 0xd0 (Inherited: 0x28)
struct USQCoreStateData : UObject {
	bool bIsGlobalData; // 0x28(0x01)
	bool bAllowConfigureOnServer; // 0x29(0x01)
	bool bAllowConfigureOnClient; // 0x2a(0x01)
	bool bCanEverConfigureOnTick; // 0x2b(0x01)
	float TickConfigureServerFrequency; // 0x2c(0x04)
	float TickConfigureClientFrequency; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FCoreStateDataTickFunction TickFunction; // 0x38(0x58)
	char pad_90[0x8]; // 0x90(0x08)
	struct TArray<struct USQCoreStateListener*> ListenerList; // 0x98(0x10)
	char pad_A8[0x8]; // 0xa8(0x08)
	struct FSQCoreStateId RepComponentId; // 0xb0(0x02)
	char pad_B2_0 : 1; // 0xb2(0x01)
	char bIsVisible : 1; // 0xb2(0x01)
	char pad_B2_2 : 6; // 0xb2(0x01)
	char pad_B3[0x1d]; // 0xb3(0x1d)

	void OnWorldCleanup(struct UWorld* World, bool bSessionEnded, bool bCleanupResources); // Function Squad.SQCoreStateData.OnWorldCleanup // (Final|Native|Private) // @ game+0x85aef0
	void OnListenerCreate(struct USQCoreStateListener* Listener); // Function Squad.SQCoreStateData.OnListenerCreate // (Final|Native|Private) // @ game+0x85ae70
};

// Class Squad.SQCoreStateListener
// Size: 0x140 (Inherited: 0xd8)
struct USQCoreStateListener : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)
	struct TMap<struct FSQCoreStateId, struct FSQCoreStateDataList> DataMap; // 0xf0(0x50)

	void RefreshVisbility(struct APlayerController* PC); // Function Squad.SQCoreStateListener.RefreshVisbility // (Final|Native|Private) // @ game+0x85b000
	void OnDataCreate(struct USQCoreStateData* Data); // Function Squad.SQCoreStateListener.OnDataCreate // (Final|Native|Private) // @ game+0x85adf0
};

// Class Squad.SQCoreStateWidgetFactory
// Size: 0x340 (Inherited: 0x140)
struct USQCoreStateWidgetFactory : USQCoreStateListener {
	char pad_140[0x8]; // 0x140(0x08)
	struct TMap<struct FSQCoreStateId, struct USQCoreStateWidget*> Widgets; // 0x148(0x50)
	struct TMap<struct USQCoreStateWidget*, struct FWidgetGroup> UnusedWidgets; // 0x198(0x50)
	char pad_1E8[0xf0]; // 0x1e8(0xf0)
	struct TMap<struct USQCoreStateData*, int> SubDataPendingSuperKey; // 0x2d8(0x50)
	char pad_328[0x10]; // 0x328(0x10)
	struct USQCoreStateSelectionHUB* SelectionHUB; // 0x338(0x08)

	void UnselectAll(struct UObject* SelectionInstigator); // Function Squad.SQCoreStateWidgetFactory.UnselectAll // (Native|Protected|Const) // @ game+0x8606e0
	void ReceiveSelection(struct FSQCoreStateId& ComponentId, enum class ESQSelectionState SelectionState, struct UObject* SelectionInstigator); // Function Squad.SQCoreStateWidgetFactory.ReceiveSelection // (Native|Protected|HasOutParms|Const) // @ game+0x85fb50
};

// Class Squad.SQCoreStateMapComponent
// Size: 0x4b8 (Inherited: 0x340)
struct USQCoreStateMapComponent : USQCoreStateWidgetFactory {
	struct UPanelWidget* RootWidget; // 0x340(0x08)
	struct USQMapWidgetBase* MapWidgetBase; // 0x348(0x08)
	float WidgetScale; // 0x350(0x04)
	char pad_354[0x164]; // 0x354(0x164)

	void SetWidgetScale(float UniformScale); // Function Squad.SQCoreStateMapComponent.SetWidgetScale // (Final|Native|Public|BlueprintCallable) // @ game+0x85b320
	void SetRootWidget(struct UPanelWidget* Value); // Function Squad.SQCoreStateMapComponent.SetRootWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x85b0a0
	bool GetWidgetWorldLocation(struct FVector& OutWorldLocation, struct FSQCoreStateId& ID); // Function Squad.SQCoreStateMapComponent.GetWidgetWorldLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x85ac60
	bool GetWidgetScreenPosition(struct FVector2D& OutPosition, struct FSQCoreStateId& ID); // Function Squad.SQCoreStateMapComponent.GetWidgetScreenPosition // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x85ab70
	struct TMap<int, struct FSQCoreStateId> GetWaypointWidgets(); // Function Squad.SQCoreStateMapComponent.GetWaypointWidgets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x85ab40
	struct TMap<int, struct FSQCoreStateId> GetWaypointFTWidgets(); // Function Squad.SQCoreStateMapComponent.GetWaypointFTWidgets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x85ab10
	struct TMap<int, struct FSQCoreStateId> GetOrderTargetWidgets(); // Function Squad.SQCoreStateMapComponent.GetOrderTargetWidgets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x85aab0
};

// Class Squad.SQCoreStateMapDataInterface
// Size: 0x28 (Inherited: 0x28)
struct USQCoreStateMapDataInterface : UInterface {
};

// Class Squad.SQCoreStateWidget
// Size: 0x258 (Inherited: 0x230)
struct USQCoreStateWidget : UUserWidget {
	enum class ESlateVisibility UnconfiguredVisibility; // 0x230(0x01)
	char pad_231[0x7]; // 0x231(0x07)
	struct USQCoreStateWidgetFactory* SourceComponent; // 0x238(0x08)
	enum class ESQSelectionState SelectionState; // 0x240(0x01)
	char pad_241[0x7]; // 0x241(0x07)
	struct UObject* SelectionInstigator; // 0x248(0x08)
	char pad_250[0x8]; // 0x250(0x08)

	void OnSelectionStateChanged(); // Function Squad.SQCoreStateWidget.OnSelectionStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnScaleChanged(float UniformScale); // Function Squad.SQCoreStateWidget.OnScaleChanged // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void AnnounceSelectionState(enum class ESQSelectionState InSelectionState); // Function Squad.SQCoreStateWidget.AnnounceSelectionState // (Final|Native|Protected|BlueprintCallable) // @ game+0x85aa00
};

// Class Squad.SQCoreStateMapWidget
// Size: 0x270 (Inherited: 0x258)
struct USQCoreStateMapWidget : USQCoreStateWidget {
	float ZOrder; // 0x258(0x04)
	bool bAutoSize; // 0x25c(0x01)
	char pad_25D[0x3]; // 0x25d(0x03)
	struct FVector2D Alignment; // 0x260(0x08)
	struct USQCoreStateMapComponent* MapComponent; // 0x268(0x08)
};

// Class Squad.SQCoreStateSquadListComponent
// Size: 0x550 (Inherited: 0x340)
struct USQCoreStateSquadListComponent : USQCoreStateWidgetFactory {
	struct USQCoreStateSquadItemWidget* SquadWidgetClass; // 0x340(0x08)
	struct USQCoreStateSquadMemberWidget* PlayerWidgetClass; // 0x348(0x08)
	struct UPanelWidget* SquadRoot; // 0x350(0x08)
	struct UPanelWidget* UnassignedRoot; // 0x358(0x08)
	struct UPanelWidget* CommanderRoot; // 0x360(0x08)
	enum class EListLayout ListLayout; // 0x368(0x01)
	enum class EListLayout UnassignedLayout; // 0x369(0x01)
	char pad_36A[0x6]; // 0x36a(0x06)
	struct TMap<int, struct USQCoreStateSquadItemWidget*> ActiveSquadWidgets; // 0x370(0x50)
	char pad_3C0[0x190]; // 0x3c0(0x190)

	void SetRootWidgets(struct UPanelWidget* InSquadRoot, struct UPanelWidget* InUnassignedRoot, struct UPanelWidget* InCommanderRoot); // Function Squad.SQCoreStateSquadListComponent.SetRootWidgets // (Final|Native|Public|BlueprintCallable) // @ game+0x85b220
};

// Class Squad.SQCoreStateRolesSquadListComponent
// Size: 0x550 (Inherited: 0x550)
struct USQCoreStateRolesSquadListComponent : USQCoreStateSquadListComponent {
};

// Class Squad.SQCoreStateSelectionHUB
// Size: 0x108 (Inherited: 0xd8)
struct USQCoreStateSelectionHUB : UActorComponent {
	char pad_D8[0x30]; // 0xd8(0x30)

	void UnselectAll(struct UObject* SelectionInstigator); // Function Squad.SQCoreStateSelectionHUB.UnselectAll // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x85b3a0
};

// Class Squad.SQCoreStateSpawnPointsListComponent
// Size: 0x390 (Inherited: 0x340)
struct USQCoreStateSpawnPointsListComponent : USQCoreStateWidgetFactory {
	struct USQCoreStateSpawnPointsListWidget* WidgetClass; // 0x340(0x08)
	struct UGridPanel* BaseRoot; // 0x348(0x08)
	struct UGridPanel* HABRoot; // 0x350(0x08)
	struct UGridPanel* RallyRoot; // 0x358(0x08)
	char pad_360[0x30]; // 0x360(0x30)

	void SetRootWidgets(struct UGridPanel* InBaseRoot, struct UGridPanel* InHABRoot, struct UGridPanel* InRallyRoot); // Function Squad.SQCoreStateSpawnPointsListComponent.SetRootWidgets // (Final|Native|Public|BlueprintCallable) // @ game+0x85b120
};

// Class Squad.SQCoreStateSpawnPointsListWidget
// Size: 0x2a8 (Inherited: 0x258)
struct USQCoreStateSpawnPointsListWidget : USQCoreStateWidget {
	bool bSpawnOnSelection; // 0x258(0x01)
	char pad_259[0x3]; // 0x259(0x03)
	char bIsSelected : 1; // 0x25c(0x01)
	char bSieged : 1; // 0x25c(0x01)
	char bSpawningEnabled : 1; // 0x25c(0x01)
	char pad_25C_3 : 5; // 0x25c(0x01)
	char pad_25D[0x3]; // 0x25d(0x03)
	struct FVector SpawnPointLocation; // 0x260(0x0c)
	enum class ESQSpawnPointType SpawnPointType; // 0x26c(0x01)
	char pad_26D[0x3]; // 0x26d(0x03)
	float ActivatedTimeStamp; // 0x270(0x04)
	char pad_274[0x4]; // 0x274(0x04)
	struct UTexture2D* BaseTexture; // 0x278(0x08)
	struct UTexture2D* HABTexture; // 0x280(0x08)
	struct UTexture2D* RallyTexture; // 0x288(0x08)
	struct UTexture2D* CacheTexture; // 0x290(0x08)
	struct ASQGameSpawn* OwningGameSpawn; // 0x298(0x08)
	char pad_2A0[0x8]; // 0x2a0(0x08)

	void SelectSpawnPoint(); // Function Squad.SQCoreStateSpawnPointsListWidget.SelectSpawnPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x85b080
	void OnSpawnPointTypeChanged(); // Function Squad.SQCoreStateSpawnPointsListWidget.OnSpawnPointTypeChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnSpawnPointLocationChanged(); // Function Squad.SQCoreStateSpawnPointsListWidget.OnSpawnPointLocationChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnSpawningEnabledChanged(); // Function Squad.SQCoreStateSpawnPointsListWidget.OnSpawningEnabledChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnSiegedChanged(); // Function Squad.SQCoreStateSpawnPointsListWidget.OnSiegedChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsSelectedChanged(); // Function Squad.SQCoreStateSpawnPointsListWidget.OnIsSelectedChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnActivatedTimeStampChanged(); // Function Squad.SQCoreStateSpawnPointsListWidget.OnActivatedTimeStampChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	struct UTexture2D* GetSpawnIcon(); // Function Squad.SQCoreStateSpawnPointsListWidget.GetSpawnIcon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x85aae0
};

// Class Squad.SQCoreStateSquadListWidget
// Size: 0x260 (Inherited: 0x258)
struct USQCoreStateSquadListWidget : USQCoreStateWidget {
	enum class EListLayout ListLayout; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)

	void OnListLayoutChanged(); // Function Squad.SQCoreStateSquadListWidget.OnListLayoutChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQCoreStateSquadItemWidget
// Size: 0x2b0 (Inherited: 0x260)
struct USQCoreStateSquadItemWidget : USQCoreStateSquadListWidget {
	struct ASQSquadState* SquadState; // 0x260(0x08)
	int SquadId; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct FString SquadName; // 0x270(0x10)
	struct FString LeaderName; // 0x280(0x10)
	int MemberNum; // 0x290(0x04)
	int MaxMembers; // 0x294(0x04)
	bool bIsSelfInSquad; // 0x298(0x01)
	bool bIsCommandSquad; // 0x299(0x01)
	enum class EJoinButtonState JoinButtonState; // 0x29a(0x01)
	char pad_29B[0x5]; // 0x29b(0x05)
	struct ASQPlayerController* CachedSQPlayerController; // 0x2a0(0x08)
	char pad_2A8[0x8]; // 0x2a8(0x08)

	void OnSquadNameChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnSquadNameChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnSquadIdChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnSquadIdChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnMemberNumChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnMemberNumChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnMaxMembersChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnMaxMembersChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnLeaderNameChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnLeaderNameChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnJoinButtonStateChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnJoinButtonStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsSelfInSquadChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnIsSelfInSquadChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsCommandSquadChanged(); // Function Squad.SQCoreStateSquadItemWidget.OnIsCommandSquadChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnBanned(int SquadId, float BanDuration); // Function Squad.SQCoreStateSquadItemWidget.OnBanned // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void JoinSquad(); // Function Squad.SQCoreStateSquadItemWidget.JoinSquad // (Final|Native|Protected|BlueprintCallable) // @ game+0x85ad50
	struct UPanelWidget* GetMemberRoot(int FireTeamIndex); // Function Squad.SQCoreStateSquadItemWidget.GetMemberRoot // (Event|Public|BlueprintEvent|Const) // @ game+0x12b8b50
	struct ASQPlayerController* GetCachedSQPlayerController(); // Function Squad.SQCoreStateSquadItemWidget.GetCachedSQPlayerController // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x85aa80
};

// Class Squad.SQCoreStateSquadMemberWidget
// Size: 0x2b8 (Inherited: 0x260)
struct USQCoreStateSquadMemberWidget : USQCoreStateSquadListWidget {
	int RootWidgetSquadId; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct ASQPlayerState* PlayerState; // 0x268(0x08)
	int SquadId; // 0x270(0x04)
	char bIsPossessingPawn : 1; // 0x274(0x01)
	char pad_274_1 : 7; // 0x274(0x01)
	char pad_275[0x3]; // 0x275(0x03)
	bool bIsSquadLeader; // 0x278(0x01)
	bool bIsFireTeamLeader; // 0x279(0x01)
	char pad_27A[0x2]; // 0x27a(0x02)
	int FireTeamIndex; // 0x27c(0x04)
	char pad_280[0x4]; // 0x280(0x04)
	int FireTeamPosition; // 0x284(0x04)
	char pad_288[0x8]; // 0x288(0x08)
	struct USQRoleSettings* DeployRole; // 0x290(0x08)
	struct FString PlayerName; // 0x298(0x10)
	struct USQVehicleUIStaticDataAsset* CurrentVehicleData; // 0x2a8(0x08)
	enum class ESQVoiceChannel VoipChannel; // 0x2b0(0x01)
	bool bIsMuted; // 0x2b1(0x01)
	bool bIsAlive; // 0x2b2(0x01)
	bool bIsBleeding; // 0x2b3(0x01)
	bool bIsWounded; // 0x2b4(0x01)
	char pad_2B5[0x3]; // 0x2b5(0x03)

	void OnVoipChannelChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnVoipChannelChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnSquadIdChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnSquadIdChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnPlayerNameChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnPlayerNameChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsWoundedChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsWoundedChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsSquadLeaderChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsSquadLeaderChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsPossessingPawnChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsPossessingPawnChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsMutedChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsMutedChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsFireTeamLeaderChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsFireTeamLeaderChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsBleedingChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsBleedingChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnIsAliveChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnIsAliveChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnFireTeamPositionChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnFireTeamPositionChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnFireTeamIndexChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnFireTeamIndexChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnDeployRoleChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnDeployRoleChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
	void OnCurrentVehicleDataChanged(); // Function Squad.SQCoreStateSquadMemberWidget.OnCurrentVehicleDataChanged // (Event|Protected|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQRestriction
// Size: 0x58 (Inherited: 0x58)
struct USQRestriction : USQSettings {

	bool TryGetLocalVehicle(struct ASQPlayerController* InPlayer, struct ASQVehicle*& OutVehicle); // Function Squad.SQRestriction.TryGetLocalVehicle // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8d1c70
	bool TryGetLocalFOB(struct ASQPlayerController* InPlayer, struct ASQForwardBase*& OutFOB); // Function Squad.SQRestriction.TryGetLocalFOB // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x8d1ba0
	bool GetRestrictionReason(struct FDataTableRowHandle& OutRestrictionReason); // Function Squad.SQRestriction.GetRestrictionReason // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x8d09d0
};

// Class Squad.SQCountParameterBase
// Size: 0x60 (Inherited: 0x58)
struct USQCountParameterBase : USQRestriction {
	enum class ESQScalingCountingMode Operation; // 0x58(0x01)
	bool UseForTeam; // 0x59(0x01)
	bool UseForPlayer; // 0x5a(0x01)
	char pad_5B[0x5]; // 0x5b(0x05)

	bool TryGetValueForTeam(struct ASQTeam* InTeam, int& OutValue); // Function Squad.SQCountParameterBase.TryGetValueForTeam // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x860600
	bool TryGetValueForPlayer(struct ASQPlayerController* InPlayer, int& OutValue); // Function Squad.SQCountParameterBase.TryGetValueForPlayer // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x860520
};

// Class Squad.SQCountParameter
// Size: 0x78 (Inherited: 0x60)
struct USQCountParameter : USQCountParameterBase {
	bool UseCurve; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct UCurveFloat* Curve; // 0x68(0x08)
	float ValueToReach; // 0x70(0x04)
	int FixedAvailability; // 0x74(0x04)

	bool TryGetInputValueForTeam(struct ASQTeam* InTeam, float& OutValue); // Function Squad.SQCountParameter.TryGetInputValueForTeam // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x860440
	bool TryGetInputValueForPlayer(struct ASQPlayerController* InPlayer, float& OutValue); // Function Squad.SQCountParameter.TryGetInputValueForPlayer // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x860360
};

// Class Squad.SQCountParameter_Legacy
// Size: 0x98 (Inherited: 0x60)
struct USQCountParameter_Legacy : USQCountParameterBase {
	struct TArray<struct FSQRoleGroupLimit> GroupLimits; // 0x60(0x10)
	struct FSQRoleLimit RoleLimit; // 0x70(0x24)
	char pad_94[0x4]; // 0x94(0x04)

	bool IsPartOfRoleGroup(struct USQRoleSettings* InRole); // Function Squad.SQCountParameter_Legacy.IsPartOfRoleGroup // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x85f430
	struct FSQRoleGroupLimit GetGroupLimit(); // Function Squad.SQCountParameter_Legacy.GetGroupLimit // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x85f180
};

// Class Squad.SQCreateSquadButton
// Size: 0x318 (Inherited: 0x2e8)
struct USQCreateSquadButton : USQBaseButton {
	bool bUsesCustomName; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	struct ASQPlayerState* OwnerPlayerState; // 0x2f0(0x08)
	struct ASQPlayerController* OwnerPlayerController; // 0x2f8(0x08)
	struct UEditableTextBox* SquadNameTextBox; // 0x300(0x08)
	struct FScriptMulticastDelegate OnNewSquadCreated; // 0x308(0x10)

	void SquadNameTextCommit(struct FText Text, enum class ETextCommit CommitMethodEnum); // Function Squad.SQCreateSquadButton.SquadNameTextCommit // (Final|Native|Public|BlueprintCallable) // @ game+0x860230
	void SquadNameTextChanged(struct FText Text); // Function Squad.SQCreateSquadButton.SquadNameTextChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x860140
};

// Class Squad.SQDamageType_Collision
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_Collision : USQDamageType {
};

// Class Squad.SQDamageType_Explosive
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_Explosive : USQDamageType {
};

// Class Squad.SQDamageType_ExplosiveRocket
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_ExplosiveRocket : USQDamageType_Explosive {
};

// Class Squad.SQDamageType_Fall
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_Fall : USQDamageType {
};

// Class Squad.SQDamageType_HeatExplosive
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_HeatExplosive : USQDamageType {
};

// Class Squad.SQDamageType_Thermite
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_Thermite : USQDamageType {
};

// Class Squad.SQDamageType_Underwater
// Size: 0x48 (Inherited: 0x48)
struct USQDamageType_Underwater : USQDamageType {
};

// Class Squad.SQWoundedDamageType
// Size: 0x48 (Inherited: 0x48)
struct USQWoundedDamageType : USQDamageType {
};

// Class Squad.SQDataGatheringComponent
// Size: 0xe8 (Inherited: 0xd8)
struct USQDataGatheringComponent : UActorComponent {
	struct UHeatMapRecorder* HeatMapRecorder; // 0xd8(0x08)
	char pad_E0[0x8]; // 0xe0(0x08)

	void RunMultiMapHeatMap(struct FString Filename); // Function Squad.SQDataGatheringComponent.RunMultiMapHeatMap // (Final|Exec|Native|Public) // @ game+0x85ff60
	void RecordHeatMap(float XStepSize, float YStepSize, float HeightOffset, bool bRecordRawValues, float PositionWaitTime, float YawRotationAngle, float PitchRotationAngle, struct FString Filename); // Function Squad.SQDataGatheringComponent.RecordHeatMap // (Final|Exec|Native|Public) // @ game+0x85fc70
};

// Class Squad.SQDataSettings
// Size: 0x160 (Inherited: 0x38)
struct USQDataSettings : UDeveloperSettings {
	bool UseAdditiveLayer; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct USQLevel* LevelClass; // 0x40(0x08)
	struct USQLayer* LayerClass; // 0x48(0x08)
	struct USQFaction* FactionClass; // 0x50(0x08)
	struct USQFactionSetup* FactionSetupClass; // 0x58(0x08)
	int SecondsTimeForCollectingCommanderChoices; // 0x60(0x04)
	int SecondsTimeForCollectingCommanderChoicesCooldown; // 0x64(0x04)
	int MinimumSquadSizeForVoting; // 0x68(0x04)
	int MinimumSquadsRequiredForVoting; // 0x6c(0x04)
	struct FSQVoteConfig CommanderVoteConfig; // 0x70(0x40)
	bool UseVoteLevel; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	int LevelCountPerVote; // 0xb4(0x04)
	struct FSQVoteConfig LevelVoteConfig; // 0xb8(0x40)
	bool UseVoteLayer; // 0xf8(0x01)
	char pad_F9[0x3]; // 0xf9(0x03)
	int LayerCountPerVote; // 0xfc(0x04)
	struct FSQVoteConfig LayerVoteConfig; // 0x100(0x40)
	bool UseVoteFactions; // 0x140(0x01)
	bool PreventSameFaction; // 0x141(0x01)
	char pad_142[0x2]; // 0x142(0x02)
	int MaxInitializedTeamId; // 0x144(0x04)
	int MaxTeamId; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct TArray<struct FSQVoteConfig> FactionVoteConfigs; // 0x150(0x10)

	bool UseVote(); // Function Squad.SQDataSettings.UseVote // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x860790
	struct USQDataSettings* GetDataSettings(); // Function Squad.SQDataSettings.GetDataSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x85f050
};

// Class Squad.SQDemoSpectator
// Size: 0x5b0 (Inherited: 0x598)
struct ASQDemoSpectator : APlayerController {
	char pad_598[0x18]; // 0x598(0x18)
};

// Class Squad.SQDeployable
// Size: 0x440 (Inherited: 0x248)
struct ASQDeployable : AActor {
	char pad_248[0x10]; // 0x248(0x10)
	enum class ESQTeam InitialTeam; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)
	struct ASQForwardBase* OwningFob; // 0x260(0x08)
	float HalfBuiltTransitionHealth; // 0x268(0x04)
	float FullyBuiltTransitionHealth; // 0x26c(0x04)
	int Team; // 0x270(0x04)
	bool bIsFob; // 0x274(0x01)
	bool bPlaced; // 0x275(0x01)
	char pad_276[0x2]; // 0x276(0x02)
	struct UBoxComponent* StackingCollisionBox; // 0x278(0x08)
	struct UBoxComponent* PlacementCollisionBox; // 0x280(0x08)
	bool bUsePlacementCollisionBox; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct TArray<struct UClass*> AllowablePlacementIntersectionClasses; // 0x290(0x10)
	bool bUseLineOfSightTrace; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct FVector LineOfSightEndOffset; // 0x2a4(0x0c)
	float PositivePlacementTraceHeight; // 0x2b0(0x04)
	float NegativePlacementTraceHeight; // 0x2b4(0x04)
	float PositivePlacementVerticalAllowance; // 0x2b8(0x04)
	float NegativePlacementVerticalAllowance; // 0x2bc(0x04)
	float ViewPlacementCapsuleRadius; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct USQCoreStateComponent* StateObject; // 0x2c8(0x08)
	enum class ESQExplosiveType ExplosiveType; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct FSQUsableData UsableData; // 0x2d8(0x40)
	struct USceneComponent* Completed; // 0x318(0x08)
	struct USceneComponent* Unbuilt; // 0x320(0x08)
	struct USceneComponent* HalfBuilt; // 0x328(0x08)
	struct USphereComponent* SimpleDetectionSphere; // 0x330(0x08)
	struct FScriptMulticastDelegate OnBuildStateChange; // 0x338(0x10)
	struct FScriptMulticastDelegate OnDestroyedEvent; // 0x348(0x10)
	enum class ESQBuildState BuildState; // 0x358(0x01)
	char pad_359[0x7]; // 0x359(0x07)
	struct TArray<struct FSQDeployableChangeStateEffect> ChangeStateEffects; // 0x360(0x10)
	struct TArray<struct FSQDeployableStateDamageEffect> DamageStateEffects; // 0x370(0x10)
	int Cost; // 0x380(0x04)
	float MaxHealth; // 0x384(0x04)
	float InitialHealth; // 0x388(0x04)
	float Health; // 0x38c(0x04)
	bool bCanUnbuild; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)
	struct TArray<struct FSQDamageModifier> AllowableDamageTypes; // 0x398(0x10)
	enum class ESQDeployableSize Size; // 0x3a8(0x01)
	bool bIngoreNoResist; // 0x3a9(0x01)
	bool bStartUnbuilt; // 0x3aa(0x01)
	bool bTrackInFOB; // 0x3ab(0x01)
	bool bTrackInPlayerState; // 0x3ac(0x01)
	char pad_3AD[0x3]; // 0x3ad(0x03)
	struct TArray<enum class EObjectTypeQuery> ObjectTypesToStack; // 0x3b0(0x10)
	bool bAllowStacking; // 0x3c0(0x01)
	bool bAllowPlacementOnPawns; // 0x3c1(0x01)
	bool bAllowPlacementOnSoldiers; // 0x3c2(0x01)
	bool bAllowPlacementOnVehicles; // 0x3c3(0x01)
	bool bAllowPlacementInWaterBodies; // 0x3c4(0x01)
	bool bAttachToUnderlyingActor; // 0x3c5(0x01)
	bool bDestroyWhenAttachedActorIsDestroyed; // 0x3c6(0x01)
	enum class ESQInvalidPlacementReason bCachedPlacementResult; // 0x3c7(0x01)
	bool bAlignToGround; // 0x3c8(0x01)
	char pad_3C9[0x3]; // 0x3c9(0x03)
	float ValidPitchRange; // 0x3cc(0x04)
	float MaxCornerDifference; // 0x3d0(0x04)
	bool bRequiresSameTeam; // 0x3d4(0x01)
	bool bCantBePlacedInFOB; // 0x3d5(0x01)
	char pad_3D6[0x2]; // 0x3d6(0x02)
	struct FVector GhostOffset; // 0x3d8(0x0c)
	enum class ESQBuildState GhostBuildState; // 0x3e4(0x01)
	char pad_3E5[0x3]; // 0x3e5(0x03)
	struct UMaterialInterface* GhostMaterial; // 0x3e8(0x08)
	bool bIsGhost; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	float GhostRotationSpeed; // 0x3f4(0x04)
	float GhostRotationDelta; // 0x3f8(0x04)
	bool bAllowFireWeaponOverrideOnSQPlayerController; // 0x3fc(0x01)
	bool bAllowAltFireWeaponOverrideOnSQPlayerController; // 0x3fd(0x01)
	bool bRequiresFOB; // 0x3fe(0x01)
	char pad_3FF[0x1]; // 0x3ff(0x01)
	struct UMaterialInstanceDynamic* DynGhostInstance; // 0x400(0x08)
	char pad_408[0x10]; // 0x408(0x10)
	struct USQDeployableSettings* Setting; // 0x418(0x08)
	struct FDataTableRowHandle CachedInvalidPlacementReason; // 0x420(0x10)
	struct UDataTable* ErrorTable; // 0x430(0x08)
	bool WasEverBuilt; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)

	void UpdateState(); // Function Squad.SQDeployable.UpdateState // (Final|Native|Public|BlueprintCallable) // @ game+0x860770
	void SetTeam(int Team); // Function Squad.SQDeployable.SetTeam // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x8600b0
	void SetStateUnbuilt(); // Function Squad.SQDeployable.SetStateUnbuilt // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x860090
	void SetStateHalfBuilt(); // Function Squad.SQDeployable.SetStateHalfBuilt // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x860070
	void SetStateCompleted(); // Function Squad.SQDeployable.SetStateCompleted // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x860050
	void RemovedFromPlayersPlacedList(); // Function Squad.SQDeployable.RemovedFromPlayersPlacedList // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x85ff40
	void PushSoldiersOutOfBounds(); // Function Squad.SQDeployable.PushSoldiersOutOfBounds // (Final|Native|Public|BlueprintCallable) // @ game+0x85fb30
	float PreModifyHealth(float DeltaHealth, struct AController* inst, bool bCausedByDamage); // Function Squad.SQDeployable.PreModifyHealth // (Native|Event|Public|BlueprintEvent) // @ game+0x85fa20
	void PostModifyHealth(float DeltaHealth, struct AController* inst, bool bCausedByDamage); // Function Squad.SQDeployable.PostModifyHealth // (Native|Event|Public|BlueprintEvent) // @ game+0x85f920
	void PlayStateChangeEffects(enum class ESQBuildState OldBuildState); // Function Squad.SQDeployable.PlayStateChangeEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x85f8a0
	void Placed(); // Function Squad.SQDeployable.Placed // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x85f880
	void OnStateChangeClient(enum class ESQBuildState OldBuildState); // Function Squad.SQDeployable.OnStateChangeClient // (Final|Native|Public|BlueprintCallable) // @ game+0x85f800
	void OnRep_Team(); // Function Squad.SQDeployable.OnRep_Team // (Final|Native|Protected) // @ game+0x85f7e0
	void OnRep_BuildState(enum class ESQBuildState OldBuildState); // Function Squad.SQDeployable.OnRep_BuildState // (Final|Native|Public) // @ game+0x85f760
	void OnAttachedActorDestroyed(struct AActor* DestroyedActor); // Function Squad.SQDeployable.OnAttachedActorDestroyed // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x85f6d0
	void MulticastPlayDamageEffects(struct UDamageType* DamageTypeClass, struct FVector ImpactLocationZeroBased, enum class ESQBuildState OldBuildState, enum class ESQBuildState NewBuildState); // Function Squad.SQDeployable.MulticastPlayDamageEffects // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0x85f590
	void MakeGhost(); // Function Squad.SQDeployable.MakeGhost // (Final|Native|Public|BlueprintCallable) // @ game+0x85f570
	bool IsValidPlacement(enum class ESQInvalidPlacementReason& Reason); // Function Squad.SQDeployable.IsValidPlacement // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x85f4d0
	bool IsGhost(); // Function Squad.SQDeployable.IsGhost // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x85f400
	bool IsDeployableEmpty(); // Function Squad.SQDeployable.IsDeployableEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x85f3d0
	void InvalidatePlacement(); // Function Squad.SQDeployable.InvalidatePlacement // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x85f3b0
	void GoToBuildState(enum class ESQBuildState InBuildState); // Function Squad.SQDeployable.GoToBuildState // (Final|BlueprintAuthorityOnly|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x85f330
	enum class ESQTrackDeployableResult GetTrackDeployableResult(struct ASQPlayerState* PlayerState, bool bIncludeSelf); // Function Squad.SQDeployable.GetTrackDeployableResult // (Native|Public|BlueprintCallable) // @ game+0x85f260
	struct ASQForwardBase* GetNearestFOB(bool bIsFriendly); // Function Squad.SQDeployable.GetNearestFOB // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x85f1c0
	struct FText GetFailedSpawnReasonText(enum class ESQInvalidPlacementReason Reason); // Function Squad.SQDeployable.GetFailedSpawnReasonText // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x85f080
	enum class ESQBuildState GetBuildState(); // Function Squad.SQDeployable.GetBuildState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x85f020
	void Die(float KillingDamage, struct FDamageEvent& DamageEvent, struct AController* Killer, struct AActor* DamageCauser); // Function Squad.SQDeployable.Die // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x85eea0
	void ConstructionHit(struct ASQSoldier* Activator, struct AController* inst, float Amount); // Function Squad.SQDeployable.ConstructionHit // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x85eda0
	void CompletedConstruction(); // Function Squad.SQDeployable.CompletedConstruction // (Native|Event|Public|BlueprintEvent) // @ game+0x85ed80
	void BPOnGhostMade(); // Function Squad.SQDeployable.BPOnGhostMade // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BPOnDie(float KillingDamage, struct FDamageEvent& DamageEvent, struct AController* Killer, struct AActor* DamageCauser); // Function Squad.SQDeployable.BPOnDie // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x12b8b50
	void BP_OnStateChangeClient(enum class ESQBuildState OldBuildState); // Function Squad.SQDeployable.BP_OnStateChangeClient // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x12b8b50
	void BP_OnStateChange(enum class ESQBuildState OldBuildState); // Function Squad.SQDeployable.BP_OnStateChange // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
	enum class ESQTrackDeployableResult BP_ExtraTrackDeployableRules(struct ASQPlayerState* PlayerState, bool bIncludeSelf); // Function Squad.SQDeployable.BP_ExtraTrackDeployableRules // (Native|Event|Public|BlueprintEvent) // @ game+0x85ecb0
	void AttachToUnderlyingActor(); // Function Squad.SQDeployable.AttachToUnderlyingActor // (Native|Public|BlueprintCallable) // @ game+0x85ec90
};

// Class Squad.SQDeployableItem
// Size: 0x460 (Inherited: 0x440)
struct ASQDeployableItem : ASQDeployable {
	struct ASQPlayerController* InstigatingPlayerController; // 0x440(0x08)
	struct ASQPlayerState* InstigatingPlayerState; // 0x448(0x08)
	int MaxAllowedPerPlayerInGame; // 0x450(0x04)
	enum class ESQTrackDeployableResult TrackDeployableOverMaxResult; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	struct ASQEquipableItem* EquippableInstigatorClass; // 0x458(0x08)
};

// Class Squad.SQDeployableAmmoBag
// Size: 0x490 (Inherited: 0x460)
struct ASQDeployableAmmoBag : ASQDeployableItem {
	char pad_460[0x8]; // 0x460(0x08)
	struct FScriptMulticastDelegate AmmoBagAmmoUpdatedEvent; // 0x468(0x10)
	struct FScriptMulticastDelegate RearmSourceAmmoUpdatedEvent; // 0x478(0x10)
	float AmmoCount; // 0x488(0x04)
	float OutOfAmmoLifetime; // 0x48c(0x04)

	void OnRep_AmmoCount(); // Function Squad.SQDeployableAmmoBag.OnRep_AmmoCount // (Final|Native|Public) // @ game+0x864600
	void BP_PickedUp(struct ASQEquipableItem* EquippableAmmoBag); // Function Squad.SQDeployableAmmoBag.BP_PickedUp // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQDeployableChildActorComponent
// Size: 0x250 (Inherited: 0x250)
struct USQDeployableChildActorComponent : UChildActorComponent {
	enum class ESQBuildState SpawnBuildState; // 0x249(0x01)
	enum class ESQBuildState DespawnBuildState; // 0x24a(0x01)
	bool bShouldUseSpawningTeam; // 0x24b(0x01)
	char TimesSpawnable; // 0x24c(0x01)

	void OnDeployableStateChange(enum class ESQBuildState BuildState); // Function Squad.SQDeployableChildActorComponent.OnDeployableStateChange // (Native|Public) // @ game+0x864560
};

// Class Squad.SQDeployableInteractable
// Size: 0x460 (Inherited: 0x460)
struct ASQDeployableInteractable : ASQDeployableItem {

	void BP_PickedUp(struct ASQEquipableItem* EquippableDeployableInteractable); // Function Squad.SQDeployableInteractable.BP_PickedUp // (Event|Public|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQItemStaticInfo
// Size: 0x528 (Inherited: 0x28)
struct USQItemStaticInfo : UObject {
	struct UAnimMontage* BaseWeaponMontage; // 0x28(0x08)
	struct UAnimMontage* Base1pMontage; // 0x30(0x08)
	struct UAnimMontage* Base3pMontage; // 0x38(0x08)
	struct UAnimSequence* SprintToProne3p; // 0x40(0x08)
	struct UAnimSequence* StandToProne3p; // 0x48(0x08)
	struct UAnimSequence* ProneToStand3p; // 0x50(0x08)
	struct UAnimSequence* CrouchToProne3p; // 0x58(0x08)
	struct UAnimSequence* ProneToCrouch3p; // 0x60(0x08)
	struct UBlendSpace1D* AO1D_StandPitch; // 0x68(0x08)
	struct UBlendSpace1D* AO1D_CrouchPitch; // 0x70(0x08)
	struct UBlendSpace1D* AO1D_PronePitch; // 0x78(0x08)
	struct UBlendSpace* AO_BipodStandCrouchPitch; // 0x80(0x08)
	struct UAnimSequence* AO1D_StandYawSF; // 0x88(0x08)
	struct UAnimSequence* AO1D_CrouchYawSF; // 0x90(0x08)
	struct UAnimSequence* AO1D_ProneYawSF; // 0x98(0x08)
	struct UAnimSequence* StandTurnRight; // 0xa0(0x08)
	struct UAnimSequence* StandTurnLeft; // 0xa8(0x08)
	struct UAnimSequence* CrouchTurnRight; // 0xb0(0x08)
	struct UAnimSequence* CrouchTurnLeft; // 0xb8(0x08)
	struct UAnimSequence* ProneTurnRight; // 0xc0(0x08)
	struct UAnimSequence* ProneTurnLeft; // 0xc8(0x08)
	struct UAnimMontage* ReloadWeaponMontage; // 0xd0(0x08)
	struct UAnimMontage* Reload1pMontage; // 0xd8(0x08)
	struct UAnimMontage* Reload3pMontage; // 0xe0(0x08)
	bool bCheckCurrentMagazineForEquip; // 0xe8(0x01)
	bool bCheckCurrentMagazineForUnequip; // 0xe9(0x01)
	char pad_EA[0x6]; // 0xea(0x06)
	struct UAnimMontage* EmptyEquipWeaponMontage; // 0xf0(0x08)
	struct UAnimMontage* EmptyEquip1pMontage; // 0xf8(0x08)
	struct UAnimMontage* EmptyEquip3pMontage; // 0x100(0x08)
	struct UAnimMontage* EquipWeaponMontage; // 0x108(0x08)
	struct UAnimMontage* Equip1pMontage; // 0x110(0x08)
	struct UAnimMontage* Equip3pMontage; // 0x118(0x08)
	struct UAnimMontage* EmptyUnequipWeaponMontage; // 0x120(0x08)
	struct UAnimMontage* EmptyUnequip1pMontage; // 0x128(0x08)
	struct UAnimMontage* EmptyUnequip3pMontage; // 0x130(0x08)
	struct UAnimMontage* UnequipWeaponMontage; // 0x138(0x08)
	struct UAnimMontage* Unequip1pMontage; // 0x140(0x08)
	struct UAnimMontage* Unequip3pMontage; // 0x148(0x08)
	struct UAnimMontage* BobbingSprint1pMontage; // 0x150(0x08)
	struct UAnimMontage* BobbingEndSprint1pMontage; // 0x158(0x08)
	struct UAnimMontage* BobbingAddSprint1pMontage; // 0x160(0x08)
	struct UBlendSpace1D* BS1D_3pStandSprintType; // 0x168(0x08)
	struct UBlendSpace1D* BS1D_3pCrouchSprintType; // 0x170(0x08)
	struct UAnimSequence* SprintStop3p; // 0x178(0x08)
	struct UBlendSpace* BS_3pStandJogType; // 0x180(0x08)
	struct UBlendSpace* BS_3pStandWalkType; // 0x188(0x08)
	struct UBlendSpace* BS_3pCrouchWalkType; // 0x190(0x08)
	struct UBlendSpace1D* BS1D_3pProneCrawlType; // 0x198(0x08)
	struct UAnimSequence* StandStopMove; // 0x1a0(0x08)
	struct UAnimSequence* CrouchStopMove; // 0x1a8(0x08)
	struct UAnimMontage* BobbingMove1pMontage; // 0x1b0(0x08)
	struct UAnimMontage* Idle1pMontage; // 0x1b8(0x08)
	struct UAnimMontage* LeanLeftBegin3pMontage; // 0x1c0(0x08)
	struct UAnimMontage* LeanLeftEnd3pMontage; // 0x1c8(0x08)
	struct UAnimMontage* LeanRightBegin3pMontage; // 0x1d0(0x08)
	struct UAnimMontage* LeanRightEnd3pMontage; // 0x1d8(0x08)
	struct UAnimSequence* StandLeanLeftShuffle; // 0x1e0(0x08)
	struct UAnimSequence* StandLeanRightShuffle; // 0x1e8(0x08)
	struct UAnimSequence* CrouchLeanLeftShuffle; // 0x1f0(0x08)
	struct UAnimSequence* CrouchLeanRightShuffle; // 0x1f8(0x08)
	struct UAnimMontage* Lowered1pMontage; // 0x200(0x08)
	struct UAnimMontage* Lowered3pMontage; // 0x208(0x08)
	struct UAnimMontage* LoweredCrouch3pMontage; // 0x210(0x08)
	struct UAnimMontage* Raised1pMontage; // 0x218(0x08)
	struct UAnimMontage* Raised3pMontage; // 0x220(0x08)
	struct UAnimMontage* RaisedCrouch3pMontage; // 0x228(0x08)
	struct FSQMontageSectionNames MoveBobbingEndLoopSectionNames; // 0x230(0x28)
	struct FSQMontageSectionNames SprintBobbingEndLoopSectionNames; // 0x258(0x28)
	struct UBlendSpaceBase* BobbingProneMoveType; // 0x280(0x08)
	struct UAnimSequence* ProneMoveTypeAdditiveReference; // 0x288(0x08)
	struct UAnimSequence* OutProneMoveType; // 0x290(0x08)
	struct UAnimSequence* OutProneMoveTypeNonadditive; // 0x298(0x08)
	float LeftHandWeaponIkAlpha; // 0x2a0(0x04)
	float RightHand3pWeaponIkAlpha; // 0x2a4(0x04)
	float JogPlayRateFactorMinRange; // 0x2a8(0x04)
	float SprintPlayRateFactorMinRange; // 0x2ac(0x04)
	float SprintBlendFactorMinRange; // 0x2b0(0x04)
	float SprintBlendSpeedInterpSpeed; // 0x2b4(0x04)
	struct UAnimSequence* SprintStaticPose; // 0x2b8(0x08)
	float LoweringBlendOutTime; // 0x2c0(0x04)
	float IdleBlendOutTime; // 0x2c4(0x04)
	struct TArray<struct FSQBoredMontageSet> BoredMontage; // 0x2c8(0x10)
	float BoredMaxFrequency; // 0x2d8(0x04)
	float BoredAbortBlendOutTime; // 0x2dc(0x04)
	struct TArray<struct FSQMutualWeapon> MutualWeapons; // 0x2e0(0x10)
	float EmptyUnequipDuration; // 0x2f0(0x04)
	float EmptyEquipDuration; // 0x2f4(0x04)
	bool bUseAutoLowering; // 0x2f8(0x01)
	char pad_2F9[0x3]; // 0x2f9(0x03)
	float LoweringTimer; // 0x2fc(0x04)
	float ItemCollisionDistance; // 0x300(0x04)
	bool bReturnToADSAfterItemCollision; // 0x304(0x01)
	bool bAllowRaisingAboveHead; // 0x305(0x01)
	char pad_306[0x2]; // 0x306(0x02)
	float RaisingBlendOutTime; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct UCameraShake* FireShake; // 0x310(0x08)
	struct FVector StandLoc; // 0x318(0x0c)
	struct FVector CrouchLoc; // 0x324(0x0c)
	struct FVector ProneLoc; // 0x330(0x0c)
	struct FVector BipodLoc; // 0x33c(0x0c)
	float StandLocBlendTime; // 0x348(0x04)
	struct FRotator OffsetLineOfFire; // 0x34c(0x0c)
	struct FVector StandLeanLeftRootOffset; // 0x358(0x0c)
	struct FRotator StandLeanLeftWeaponRotation; // 0x364(0x0c)
	struct FRotator StandLeanLeftCameraRotation; // 0x370(0x0c)
	struct FVector StandLeanRightRootOffset; // 0x37c(0x0c)
	struct FRotator StandLeanRightWeaponRotation; // 0x388(0x0c)
	struct FRotator StandLeanRightCameraRotation; // 0x394(0x0c)
	struct FVector CrouchLeanLeftRootOffset; // 0x3a0(0x0c)
	struct FRotator CrouchLeanLeftWeaponRotation; // 0x3ac(0x0c)
	struct FRotator CrouchLeanLeftCameraRotation; // 0x3b8(0x0c)
	struct FVector CrouchLeanRightRootOffset; // 0x3c4(0x0c)
	struct FRotator CrouchLeanRightWeaponRotation; // 0x3d0(0x0c)
	struct FRotator CrouchLeanRightCameraRotation; // 0x3dc(0x0c)
	struct FVector ProneLeanLeftRootOffset; // 0x3e8(0x0c)
	struct FRotator ProneLeanLeftWeaponRotation; // 0x3f4(0x0c)
	struct FRotator ProneLeanLeftCameraRotation; // 0x400(0x0c)
	struct FVector ProneLeanRightRootOffset; // 0x40c(0x0c)
	struct FRotator ProneLeanRightWeaponRotation; // 0x418(0x0c)
	struct FRotator ProneLeanRightCameraRotation; // 0x424(0x0c)
	struct FVector FpvLowerRootBoneOffset; // 0x430(0x0c)
	struct FVector FpvTorsoCameraOffset; // 0x43c(0x0c)
	int WeaponSpringSide; // 0x448(0x04)
	float WeaponSpringStiffness; // 0x44c(0x04)
	float WeaponSpringCriticalDampingFactor; // 0x450(0x04)
	float WeaponSpringMass; // 0x454(0x04)
	float WeaponSpringFactor2; // 0x458(0x04)
	float WeaponMeshSpringLocDelayFactor; // 0x45c(0x04)
	float WeaponMeshSpringRotDelayFactor; // 0x460(0x04)
	float WeaponSpringClamp; // 0x464(0x04)
	float WeaponSpringTurnSpeedToFullIntensity; // 0x468(0x04)
	struct FRotator StrafeSpringRotator; // 0x46c(0x0c)
	struct FVector StrafeSpringVector; // 0x478(0x0c)
	struct FRotator AdsStrafeSpringRotator; // 0x484(0x0c)
	struct FName SoundsSocket; // 0x490(0x08)
	struct USoundCue* FireSound1P; // 0x498(0x08)
	struct USoundCue* FireSound3P; // 0x4a0(0x08)
	struct USoundCue* ReloadSound1P; // 0x4a8(0x08)
	struct USoundCue* ReloadSound3P; // 0x4b0(0x08)
	struct USoundCue* DryReloadSound1P; // 0x4b8(0x08)
	struct USoundCue* DryReloadSound3P; // 0x4c0(0x08)
	struct USoundCue* EquipSound1P; // 0x4c8(0x08)
	struct USoundCue* EquipSound3P; // 0x4d0(0x08)
	struct USoundCue* UnequipSound1P; // 0x4d8(0x08)
	struct USoundCue* UnequipSound3P; // 0x4e0(0x08)
	struct USoundBase* IntoForcedLoweringSound; // 0x4e8(0x08)
	struct USoundBase* OutOfForcedLoweringSound; // 0x4f0(0x08)
	struct USoundBase* IntoForcedRaisingSound; // 0x4f8(0x08)
	struct USoundBase* OutOfForcedRaisingSound; // 0x500(0x08)
	bool bUsableInMainBase; // 0x508(0x01)
	char pad_509[0x7]; // 0x509(0x07)
	struct FText ItemUsageNullifiedText; // 0x510(0x18)
};

// Class Squad.SQDeployableItemStaticInfo
// Size: 0x558 (Inherited: 0x528)
struct USQDeployableItemStaticInfo : USQItemStaticInfo {
	struct UAnimMontage* PlacingDeployableWeaponMontage; // 0x528(0x08)
	struct UAnimMontage* PlacingDeployable1pMontage; // 0x530(0x08)
	struct UAnimMontage* PlacingDeployable3pMontage; // 0x538(0x08)
	struct ASQDeployableItem* DeployableClass; // 0x540(0x08)
	struct USQDeployableSettings* Deployable; // 0x548(0x08)
	float PlacingDeployableDuration; // 0x550(0x04)
	float FinishPlacingDeployableBlendOutDuration; // 0x554(0x04)
};

// Class Squad.SQPawn
// Size: 0x340 (Inherited: 0x2a8)
struct ASQPawn : APawn {
	char pad_2A8[0x8]; // 0x2a8(0x08)
	char bClientUpdating : 1; // 0x2b0(0x01)
	char pad_2B0_1 : 7; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	bool bUseEngineActorReplication; // 0x2b4(0x01)
	bool bIsUsingNewMovementComponent; // 0x2b5(0x01)
	enum class ESQTeam Team; // 0x2b6(0x01)
	char pad_2B7[0x1]; // 0x2b7(0x01)
	struct FSQBasedMovementInfo BasedMovement; // 0x2b8(0x30)
	struct USQCoreStateComponent* StateObject; // 0x2e8(0x08)
	struct FVector BaseTranslationOffset; // 0x2f0(0x0c)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct FQuat BaseRotationOffset; // 0x300(0x10)
	bool bInBaseReplication; // 0x310(0x01)
	char pad_311[0x7]; // 0x311(0x07)
	struct FScriptMulticastDelegate OnPawnPossessedEvent; // 0x318(0x10)
	struct FScriptMulticastDelegate OnPawnUnPossessedEvent; // 0x328(0x10)
	char pad_338[0x8]; // 0x338(0x08)

	void SetTeam(enum class ESQTeam Team); // Function Squad.SQPawn.SetTeam // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x8ac790
	void OnRep_Team(); // Function Squad.SQPawn.OnRep_Team // (Native|Public) // @ game+0x8abc00
	void OnPossessionChanged__DelegateSignature(); // DelegateFunction Squad.SQPawn.OnPossessionChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x12b8b50
	enum class ESQTeam GetTeam(); // Function Squad.SQPawn.GetTeam // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x8aad70
	void BlueprintCalcCamera(float DeltaTime, struct FVector InLocation, struct FRotator InRotation, float InFOV, struct FVector& OutLocation, struct FRotator& OutRotation, float& OutFOV); // Function Squad.SQPawn.BlueprintCalcCamera // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x12b8b50
};

// Class Squad.SQVehicleSeat
// Size: 0x3d0 (Inherited: 0x340)
struct ASQVehicleSeat : ASQPawn {
	char pad_340[0x20]; // 0x340(0x20)
	float ADSSpeed; // 0x360(0x04)
	float PitchLimit; // 0x364(0x04)
	float MinPitchLimit; // 0x368(0x04)
	float YawLimit; // 0x36c(0x04)
